----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  22 Sep 2024, 22:59:21

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.305     1000    0.000    0.000    0.000    0.001    0.000     6.83   100.00        .
        init          0.555     1000    0.000    0.001    0.001    0.003    0.001    12.44   181.97        .
       parse          0.694     1000    0.000    0.001    0.001    0.002    0.000    15.55   227.54        .
       check          2.730     1000    0.002    0.003    0.003    0.006    0.001    61.17   895.08        .
        eval          0.455     1000    0.000    0.000    0.000    0.002    0.001    10.19   149.18        .
       total          4.463     1000    0.004    0.004    0.004    0.008    0.001   100.00  1463.28    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.827     1000    0.002    0.003    0.003    0.006    0.001    37.53   100.00        .
        init          0.877     1000    0.000    0.001    0.001    0.003    0.000    11.64    31.02        .
       parse          0.729     1000    0.000    0.001    0.001    0.002    0.000     9.68    25.79        .
       check          2.706     1000    0.002    0.003    0.003    0.005    0.001    35.92    95.72        .
        eval          3.188     1000    0.002    0.003    0.003    0.008    0.000    42.32   112.77        .
       total          7.533     1000    0.007    0.008    0.007    0.013    0.001   100.00   266.47    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.155      100    0.029    0.032    0.031    0.042    0.002    73.65   100.00        .
        init          0.551      100    0.005    0.006    0.005    0.007    0.001    12.86    17.46        .
       parse          0.085      100    0.000    0.001    0.001    0.004    0.001     1.98     2.69        .
       check          0.273      100    0.002    0.003    0.003    0.004    0.001     6.37     8.65        .
        eval          3.373      100    0.030    0.034    0.033    0.043    0.003    78.73   106.91        .
       total          4.284      100    0.039    0.043    0.043    0.052    0.003   100.00   135.78    0.011
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.587       10    0.253    0.259    0.258    0.265    0.004    83.97   100.00        .
        init          0.450       10    0.044    0.045    0.045    0.048    0.001    14.61    17.39        .
       parse          0.008       10    0.000    0.001    0.001    0.001    0.000     0.26     0.31        .
       check          0.028       10    0.002    0.003    0.003    0.003    0.000     0.91     1.08        .
        eval          2.595       10    0.253    0.260    0.258    0.267    0.005    84.23   100.31        .
       total          3.081       10    0.302    0.308    0.306    0.315    0.005   100.00   119.10    0.049
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.593        1    2.593    2.593    2.593    2.593        .    85.32   100.00        .
        init          0.446        1    0.446    0.446    0.446    0.446        .    14.68    17.20        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
       check          0.002        1    0.002    0.002    0.002    0.002        .     0.07     0.08        .
        eval          2.590        1    2.590    2.590    2.590    2.590        .    85.23    99.88        .
       total          3.039        1    3.039    3.039    3.039    3.039        .   100.00   117.20    0.446
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.330     1000    0.000    0.000    0.000    0.002    0.000    10.01   100.00        .
        init          0.831     1000    0.000    0.001    0.001    0.003    0.000    25.20   251.82        .
       parse          0.653     1000    0.000    0.001    0.001    0.002    0.000    19.81   197.88        .
       check          1.346     1000    0.001    0.001    0.001    0.003    0.000    40.82   407.88        .
        eval          0.439     1000    0.000    0.000    0.000    0.002    0.000    13.32   133.03        .
       total          3.297     1000    0.003    0.003    0.003    0.006    0.001   100.00   999.09    0.003
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.662     1000    0.002    0.003    0.003    0.007    0.001    31.39   100.00        .
        init          3.669     1000    0.003    0.004    0.004    0.006    0.001    43.27   137.83        .
       parse          0.718     1000    0.000    0.001    0.001    0.004    0.000     8.47    26.97        .
       check          1.320     1000    0.001    0.001    0.001    0.003    0.000    15.57    49.59        .
        eval          2.736     1000    0.002    0.003    0.003    0.006    0.001    32.26   102.78        .
       total          8.480     1000    0.008    0.008    0.008    0.013    0.001   100.00   318.56    0.006
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.635      100    0.025    0.026    0.026    0.037    0.002    38.28   100.00        .
        init          3.805      100    0.036    0.038    0.037    0.045    0.002    55.28   144.40        .
       parse          0.084      100    0.000    0.001    0.001    0.002    0.000     1.22     3.19        .
       check          0.157      100    0.001    0.002    0.002    0.003    0.001     2.28     5.96        .
        eval          2.832      100    0.025    0.028    0.028    0.035    0.002    41.14   107.48        .
       total          6.883      100    0.063    0.069    0.069    0.077    0.003   100.00   261.21    0.042
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.637       10    0.259    0.264    0.262    0.270    0.004    42.16   100.00        .
        init          3.633       10    0.355    0.363    0.358    0.381    0.009    58.08   137.77        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.10     0.23        .
       check          0.017       10    0.001    0.002    0.002    0.002    0.000     0.27     0.64        .
        eval          2.599       10    0.257    0.260    0.259    0.264    0.002    41.55    98.56        .
       total          6.255       10    0.615    0.625    0.623    0.640    0.009   100.00   237.20    0.362
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.637        1    2.637    2.637    2.637    2.637        .    41.56   100.00        .
        init          3.599        1    3.599    3.599    3.599    3.599        .    56.72   136.48        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
       check          0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
        eval          2.744        1    2.744    2.744    2.744    2.744        .    43.25   104.06        .
       total          6.345        1    6.345    6.345    6.345    6.345        .   100.00   240.61    3.708
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.269     1000    0.000    0.000    0.000    0.002    0.000     6.21   100.00        .
        init          0.543     1000    0.000    0.001    0.001    0.003    0.001    12.53   201.86        .
       parse          0.592     1000    0.000    0.001    0.001    0.001    0.000    13.66   220.07        .
       check          2.823     1000    0.002    0.003    0.003    0.007    0.001    65.12  1049.44        .
        eval          0.343     1000    0.000    0.000    0.000    0.001    0.000     7.91   127.51        .
       total          4.335     1000    0.004    0.004    0.004    0.010    0.001   100.00  1611.52    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.479     1000    0.002    0.002    0.002    0.005    0.001    22.24   100.00        .
        init          4.969     1000    0.004    0.005    0.005    0.008    0.001    44.58   200.44        .
       parse          0.591     1000    0.000    0.001    0.001    0.006    0.001     5.30    23.84        .
       check          2.876     1000    0.002    0.003    0.003    0.006    0.000    25.80   116.01        .
        eval          2.688     1000    0.002    0.003    0.003    0.009    0.001    24.11   108.43        .
       total         11.147     1000    0.010    0.011    0.011    0.020    0.001   100.00   449.66    0.009
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.491      100    0.042    0.045    0.044    0.060    0.003    32.55   100.00        .
        init          8.936      100    0.082    0.089    0.087    0.172    0.011    64.76   198.98        .
       parse          0.069      100    0.000    0.001    0.001    0.002    0.000     0.50     1.54        .
       check          0.292      100    0.002    0.003    0.003    0.008    0.001     2.12     6.50        .
        eval          4.497      100    0.041    0.045    0.043    0.113    0.007    32.59   100.13        .
       total         13.799      100    0.128    0.138    0.133    0.295    0.018   100.00   307.26    0.093
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.200       10    0.215    0.220    0.217    0.228    0.005    30.66   100.00        .
        init          4.902       10    0.473    0.490    0.484    0.540    0.019    68.31   222.82        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.08     0.27        .
       check          0.028       10    0.002    0.003    0.003    0.003    0.000     0.39     1.27        .
        eval          2.240       10    0.216    0.224    0.221    0.235    0.006    31.22   101.82        .
       total          7.176       10    0.703    0.718    0.707    0.768    0.019   100.00   326.18    0.498
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.170        1    2.170    2.170    2.170    2.170        .    31.00   100.00        .
        init          4.800        1    4.800    4.800    4.800    4.800        .    68.56   221.20        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.05        .
       check          0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.09        .
        eval          2.198        1    2.198    2.198    2.198    2.198        .    31.40   101.29        .
       total          7.001        1    7.001    7.001    7.001    7.001        .   100.00   322.63    4.831
--------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.133      100    0.001    0.001    0.001    0.004    0.001     1.03   100.00        .
        init          0.070      100    0.000    0.001    0.001    0.002    0.000     0.54    52.63        .
       parse          0.364      100    0.003    0.004    0.003    0.008    0.001     2.82   273.68        .
       check         12.259      100    0.116    0.123    0.120    0.172    0.009    94.95  9217.29        .
        eval          0.210      100    0.002    0.002    0.002    0.004    0.000     1.63   157.89        .
       total         12.911      100    0.122    0.129    0.126    0.178    0.009   100.00  9707.52    0.128
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.116      100    0.010    0.011    0.011    0.017    0.001     8.01   100.00        .
        init          0.171      100    0.001    0.002    0.002    0.003    0.000     1.23    15.32        .
       parse          0.334      100    0.003    0.003    0.003    0.005    0.001     2.40    29.93        .
       check         12.237      100    0.116    0.122    0.120    0.197    0.009    87.81  1096.51        .
        eval          1.187      100    0.011    0.012    0.012    0.015    0.001     8.52   106.36        .
       total         13.935      100    0.133    0.139    0.137    0.214    0.010   100.00  1248.66    0.128
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.115       10    0.107    0.112    0.110    0.128    0.006    44.78   100.00        .
        init          0.126       10    0.012    0.013    0.013    0.013    0.001     5.06    11.30        .
       parse          0.035       10    0.003    0.004    0.003    0.004    0.001     1.41     3.14        .
       check          1.201       10    0.118    0.120    0.119    0.124    0.002    48.23   107.71        .
        eval          1.128       10    0.109    0.113    0.110    0.120    0.005    45.30   101.17        .
       total          2.490       10    0.244    0.249    0.246    0.259    0.005   100.00   223.32    0.138
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.148        1    1.148    1.148    1.148    1.148        .    84.16   100.00        .
        init          0.128        1    0.128    0.128    0.128    0.128        .     9.38    11.15        .
       parse          0.003        1    0.003    0.003    0.003    0.003        .     0.22     0.26        .
       check          0.122        1    0.122    0.122    0.122    0.122        .     8.94    10.63        .
        eval          1.111        1    1.111    1.111    1.111    1.111        .    81.45    96.78        .
       total          1.364        1    1.364    1.364    1.364    1.364        .   100.00   118.82    0.216
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         11.164        1   11.164   11.164   11.164   11.164        .    88.71   100.00        .
        init          1.299        1    1.299    1.299    1.299    1.299        .    10.32    11.64        .
       parse          0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
       check          0.120        1    0.120    0.120    0.120    0.120        .     0.95     1.07        .
        eval         11.163        1   11.163   11.163   11.163   11.163        .    88.70    99.99        .
       total         12.585        1   12.585   12.585   12.585   12.585        .   100.00   112.73    1.421
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.132      100    0.001    0.001    0.001    0.003    0.001     5.26   100.00        .
        init          0.087      100    0.000    0.001    0.001    0.002    0.000     3.47    65.91        .
       parse          0.297      100    0.002    0.003    0.003    0.006    0.001    11.84   225.00        .
       check          1.910      100    0.018    0.019    0.018    0.030    0.002    76.13  1446.97        .
        eval          0.206      100    0.001    0.002    0.002    0.004    0.000     8.21   156.06        .
       total          2.509      100    0.023    0.025    0.024    0.037    0.002   100.00  1900.76    0.024
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.250      100    0.011    0.013    0.012    0.019    0.002    30.27   100.00        .
        init          0.377      100    0.003    0.004    0.004    0.006    0.001     9.13    30.16        .
       parse          0.320      100    0.002    0.003    0.003    0.007    0.001     7.75    25.60        .
       check          1.956      100    0.018    0.020    0.019    0.041    0.003    47.37   156.48        .
        eval          1.473      100    0.013    0.015    0.014    0.024    0.002    35.67   117.84        .
       total          4.129      100    0.038    0.041    0.040    0.076    0.004   100.00   330.32    0.029
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.923       10    0.286    0.292    0.291    0.298    0.004    76.56   100.00        .
        init          0.628       10    0.058    0.063    0.062    0.068    0.003    16.45    21.48        .
       parse          0.030       10    0.003    0.003    0.003    0.003    0.000     0.79     1.03        .
       check          0.187       10    0.018    0.019    0.018    0.021    0.001     4.90     6.40        .
        eval          2.973       10    0.289    0.297    0.292    0.340    0.015    77.87   101.71        .
       total          3.818       10    0.369    0.382    0.376    0.423    0.015   100.00   130.62    0.090
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.132        1    1.132    1.132    1.132    1.132        .    77.06   100.00        .
        init          0.329        1    0.329    0.329    0.329    0.329        .    22.40    29.06        .
       parse          0.002        1    0.002    0.002    0.002    0.002        .     0.14     0.18        .
       check          0.019        1    0.019    0.019    0.019    0.019        .     1.29     1.68        .
        eval          1.119        1    1.119    1.119    1.119    1.119        .    76.17    98.85        .
       total          1.469        1    1.469    1.469    1.469    1.469        .   100.00   129.77    0.337
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         11.367        1   11.367   11.367   11.367   11.367        .    78.34   100.00        .
        init          3.223        1    3.223    3.223    3.223    3.223        .    22.21    28.35        .
       parse          0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
       check          0.018        1    0.018    0.018    0.018    0.018        .     0.12     0.16        .
        eval         11.266        1   11.266   11.266   11.266   11.266        .    77.64    99.11        .
       total         14.510        1   14.510   14.510   14.510   14.510        .   100.00   127.65    3.143
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.131      100    0.001    0.001    0.001    0.003    0.001     0.95   100.00        .
        init          0.068      100    0.000    0.001    0.001    0.001    0.000     0.49    51.91        .
       parse          0.244      100    0.002    0.002    0.002    0.004    0.001     1.77   186.26        .
       check         13.303      100    0.129    0.133    0.131    0.163    0.006    96.38 10154.96        .
        eval          0.185      100    0.001    0.002    0.002    0.003    0.001     1.34   141.22        .
       total         13.802      100    0.133    0.138    0.136    0.169    0.006   100.00 10535.88    0.137
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.168      100    0.010    0.012    0.011    0.019    0.002     7.44   100.00        .
        init          0.571      100    0.005    0.006    0.005    0.009    0.001     3.64    48.89        .
       parse          0.238      100    0.002    0.002    0.002    0.004    0.001     1.52    20.38        .
       check         13.659      100    0.128    0.137    0.134    0.160    0.008    86.98  1169.43        .
        eval          1.233      100    0.011    0.012    0.012    0.023    0.002     7.85   105.57        .
       total         15.704      100    0.148    0.157    0.154    0.188    0.009   100.00  1344.52    0.145
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.179       10    0.109    0.118    0.114    0.138    0.009    32.64   100.00        .
        init          0.820       10    0.067    0.082    0.075    0.104    0.014    22.70    69.55        .
       parse          0.029       10    0.002    0.003    0.003    0.006    0.001     0.80     2.46        .
       check          1.502       10    0.137    0.150    0.146    0.172    0.010    41.58   127.40        .
        eval          1.261       10    0.114    0.126    0.126    0.138    0.008    34.91   106.96        .
       total          3.612       10    0.328    0.361    0.350    0.403    0.026   100.00   306.36    0.243
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.395        1    1.395    1.395    1.395    1.395        .    64.91   100.00        .
        init          0.582        1    0.582    0.582    0.582    0.582        .    27.08    41.72        .
       parse          0.005        1    0.005    0.005    0.005    0.005        .     0.23     0.36        .
       check          0.175        1    0.175    0.175    0.175    0.175        .     8.14    12.54        .
        eval          1.386        1    1.386    1.386    1.386    1.386        .    64.50    99.35        .
       total          2.149        1    2.149    2.149    2.149    2.149        .   100.00   154.05    0.754
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         11.950        1   11.950   11.950   11.950   11.950        .    66.64   100.00        .
        init          5.549        1    5.549    5.549    5.549    5.549        .    30.94    46.44        .
       parse          0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
       check          0.135        1    0.135    0.135    0.135    0.135        .     0.75     1.13        .
        eval         12.245        1   12.245   12.245   12.245   12.245        .    68.29   102.47        .
       total         17.932        1   17.932   17.932   17.932   17.932        .   100.00   150.06    5.982
--------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.107       10    0.009    0.011    0.010    0.014    0.001     0.15   100.00        .
        init          0.009       10    0.000    0.001    0.001    0.001    0.000     0.01     8.41        .
       parse          1.527       10    0.138    0.153    0.139    0.256    0.037     2.14  1427.10        .
       check         69.695       10    6.498    6.969    6.657    9.042    0.777    97.58 65135.51        .
        eval          0.188       10    0.016    0.019    0.017    0.034    0.006     0.26   175.70        .
       total         71.423       10    6.654    7.142    6.813    9.212    0.782   100.00 66750.47    7.132
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.947       10    0.091    0.095    0.094    0.098    0.002     0.86   100.00        .
        init          0.016       10    0.001    0.002    0.002    0.002    0.001     0.01     1.69        .
       parse          1.402       10    0.137    0.140    0.140    0.142    0.002     1.27   148.05        .
       check        107.689       10   10.710   10.769   10.771   10.831    0.042    97.79 11371.59        .
        eval          1.012       10    0.098    0.101    0.101    0.105    0.002     0.92   106.86        .
       total        110.123       10   10.953   11.012   11.010   11.075    0.042   100.00 11628.62   10.918
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.945        1    0.945    0.945    0.945    0.945        .     7.98   100.00        .
        init          0.012        1    0.012    0.012    0.012    0.012        .     0.10     1.27        .
       parse          0.139        1    0.139    0.139    0.139    0.139        .     1.17    14.71        .
       check         10.741        1   10.741   10.741   10.741   10.741        .    90.71  1136.61        .
        eval          0.948        1    0.948    0.948    0.948    0.948        .     8.01   100.32        .
       total         11.841        1   11.841   11.841   11.841   11.841        .   100.00  1253.02   10.896
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          9.550        1    9.550    9.550    9.550    9.550        .    46.44   100.00        .
        init          0.128        1    0.128    0.128    0.128    0.128        .     0.62     1.34        .
       parse          0.139        1    0.139    0.139    0.139    0.139        .     0.68     1.46        .
       check         10.765        1   10.765   10.765   10.765   10.765        .    52.35   112.72        .
        eval          9.533        1    9.533    9.533    9.533    9.533        .    46.36    99.82        .
       total         20.565        1   20.565   20.565   20.565   20.565        .   100.00   215.34   11.015
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         95.610        1   95.610   95.610   95.610   95.610        .    89.19   100.00        .
        init          1.257        1    1.257    1.257    1.257    1.257        .     1.17     1.31        .
       parse          0.140        1    0.140    0.140    0.140    0.140        .     0.13     0.15        .
       check         10.837        1   10.837   10.837   10.837   10.837        .    10.11    11.33        .
        eval         94.965        1   94.965   94.965   94.965   94.965        .    88.59    99.33        .
       total        107.199        1  107.199  107.199  107.199  107.199        .   100.00   112.12   11.589
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.104       10    0.010    0.010    0.010    0.012    0.001     0.63   100.00        .
        init          0.010       10    0.001    0.001    0.001    0.001    0.000     0.06     9.62        .
       parse          1.371       10    0.134    0.137    0.136    0.141    0.003     8.32  1318.27        .
       check         14.945       10    1.475    1.494    1.499    1.510    0.014    90.64 14370.19        .
        eval          0.159       10    0.015    0.016    0.016    0.017    0.001     0.96   152.88        .
       total         16.488       10    1.629    1.649    1.654    1.663    0.014   100.00 15853.85    1.638
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.005       10    0.097    0.101    0.100    0.104    0.002     5.79   100.00        .
        init          0.039       10    0.003    0.004    0.004    0.004    0.000     0.22     3.88        .
       parse          1.364       10    0.134    0.136    0.135    0.141    0.002     7.85   135.72        .
       check         14.795       10    1.470    1.480    1.479    1.485    0.005    85.18  1472.14        .
        eval          1.169       10    0.114    0.117    0.117    0.119    0.002     6.73   116.32        .
       total         17.369       10    1.729    1.737    1.737    1.744    0.005   100.00  1728.26    1.636
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.429        1    2.429    2.429    2.429    2.429        .    59.58   100.00        .
        init          0.062        1    0.062    0.062    0.062    0.062        .     1.52     2.55        .
       parse          0.136        1    0.136    0.136    0.136    0.136        .     3.34     5.60        .
       check          1.483        1    1.483    1.483    1.483    1.483        .    36.37    61.05        .
        eval          2.395        1    2.395    2.395    2.395    2.395        .    58.74    98.60        .
       total          4.077        1    4.077    4.077    4.077    4.077        .   100.00   167.85    1.648
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         10.010        1   10.010   10.010   10.010   10.010        .    85.00   100.00        .
        init          0.329        1    0.329    0.329    0.329    0.329        .     2.79     3.29        .
       parse          0.136        1    0.136    0.136    0.136    0.136        .     1.15     1.36        .
       check          1.488        1    1.488    1.488    1.488    1.488        .    12.64    14.87        .
        eval          9.823        1    9.823    9.823    9.823    9.823        .    83.42    98.13        .
       total         11.776        1   11.776   11.776   11.776   11.776        .   100.00   117.64    1.766
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         98.468        1   98.468   98.468   98.468   98.468        .    97.58   100.00        .
        init          3.311        1    3.311    3.311    3.311    3.311        .     3.28     3.36        .
       parse          0.138        1    0.138    0.138    0.138    0.138        .     0.14     0.14        .
       check          1.486        1    1.486    1.486    1.486    1.486        .     1.47     1.51        .
        eval         95.975        1   95.975   95.975   95.975   95.975        .    95.11    97.47        .
       total        100.910        1  100.910  100.910  100.910  100.910        .   100.00   102.48    2.442
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.102       10    0.009    0.010    0.010    0.011    0.001     0.15   100.00        .
        init          0.011       10    0.001    0.001    0.001    0.002    0.000     0.02    10.78        .
       parse          0.652       10    0.063    0.065    0.064    0.071    0.002     0.98   639.22        .
       check         65.610       10    6.371    6.561    6.560    6.704    0.100    98.76 64323.53        .
        eval          0.160       10    0.014    0.016    0.015    0.026    0.004     0.24   156.86        .
       total         66.434       10    6.451    6.643    6.640    6.792    0.102   100.00 65131.37    6.633
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.032       10    0.101    0.103    0.102    0.107    0.002     0.85   100.00        .
        init          0.065       10    0.006    0.007    0.006    0.007    0.001     0.05     6.30        .
       parse          0.664       10    0.065    0.066    0.066    0.069    0.001     0.54    64.34        .
       check        120.239       10   11.956   12.024   12.012   12.095    0.045    98.46 11651.07        .
        eval          1.151       10    0.113    0.115    0.114    0.119    0.002     0.94   111.53        .
       total        122.119       10   12.145   12.212   12.198   12.281    0.045   100.00 11833.24   12.109
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.129        1    1.129    1.129    1.129    1.129        .     8.44   100.00        .
        init          0.089        1    0.089    0.089    0.089    0.089        .     0.67     7.88        .
       parse          0.067        1    0.067    0.067    0.067    0.067        .     0.50     5.93        .
       check         12.100        1   12.100   12.100   12.100   12.100        .    90.49  1071.74        .
        eval          1.115        1    1.115    1.115    1.115    1.115        .     8.34    98.76        .
       total         13.371        1   13.371   13.371   13.371   13.371        .   100.00  1184.32   12.242
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         10.049        1   10.049   10.049   10.049   10.049        .    44.25   100.00        .
        init          0.545        1    0.545    0.545    0.545    0.545        .     2.40     5.42        .
       parse          0.065        1    0.065    0.065    0.065    0.065        .     0.29     0.65        .
       check         12.039        1   12.039   12.039   12.039   12.039        .    53.01   119.80        .
        eval         10.061        1   10.061   10.061   10.061   10.061        .    44.30   100.12        .
       total         22.710        1   22.710   22.710   22.710   22.710        .   100.00   225.99   12.661
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base        100.675        1  100.675  100.675  100.675  100.675        .    85.95   100.00        .
        init          5.390        1    5.390    5.390    5.390    5.390        .     4.60     5.35        .
       parse          0.065        1    0.065    0.065    0.065    0.065        .     0.06     0.06        .
       check         12.047        1   12.047   12.047   12.047   12.047        .    10.29    11.97        .
        eval         99.626        1   99.626   99.626   99.626   99.626        .    85.06    98.96        .
       total        117.129        1  117.129  117.129  117.129  117.129        .   100.00   116.34   16.454
--------------------------------------------------------------------------------------------------------------

. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.305     1000    0.000    0.000    0.000    0.004    0.000    27.11   100.00        .
        init          0.078     1000    0.000    0.000    0.000    0.001    0.000     6.93    25.57        .
       parse          0.612     1000    0.000    0.001    0.001    0.002    0.000    54.40   200.66        .
       check          0.005     1000    0.000    0.000    0.000    0.001    0.000     0.44     1.64        .
        eval          0.405     1000    0.000    0.000    0.000    0.001    0.000    36.00   132.79        .
       total          1.125     1000    0.001    0.001    0.001    0.003    0.000   100.00   368.85    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.756     1000    0.002    0.003    0.003    0.005    0.000    73.42   100.00        .
        init          0.076     1000    0.000    0.000    0.000    0.001    0.000     2.02     2.76        .
       parse          0.673     1000    0.000    0.001    0.001    0.002    0.000    17.93    24.42        .
       check          0.003     1000    0.000    0.000    0.000    0.001    0.000     0.08     0.11        .
        eval          2.981     1000    0.002    0.003    0.003    0.005    0.000    79.41   108.16        .
       total          3.754     1000    0.003    0.004    0.004    0.006    0.000   100.00   136.21    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          6.028      100    0.058    0.060    0.060    0.072    0.002    98.71   100.00        .
        init          0.010      100    0.000    0.000    0.000    0.001    0.000     0.16     0.17        .
       parse          0.067      100    0.000    0.001    0.001    0.001    0.000     1.10     1.11        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          6.028      100    0.058    0.060    0.060    0.066    0.002    98.71   100.00        .
       total          6.107      100    0.059    0.061    0.061    0.067    0.002   100.00   101.31    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.759       10    0.270    0.276    0.275    0.292    0.006    99.93   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.14     0.14        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.755       10    0.270    0.276    0.275    0.284    0.004    99.78    99.86        .
       total          2.761       10    0.271    0.276    0.276    0.285    0.004   100.00   100.07    0.000
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.586        1    2.586    2.586    2.586    2.586        .    99.46   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          2.599        1    2.599    2.599    2.599    2.599        .    99.96   100.50        .
       total          2.600        1    2.600    2.600    2.600    2.600        .   100.00   100.54    0.014
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.294     1000    0.000    0.000    0.000    0.002    0.000    26.27   100.00        .
        init          0.066     1000    0.000    0.000    0.000    0.001    0.000     5.90    22.45        .
       parse          0.614     1000    0.000    0.001    0.001    0.003    0.000    54.87   208.84        .
       check          0.002     1000    0.000    0.000    0.000    0.001    0.000     0.18     0.68        .
        eval          0.411     1000    0.000    0.000    0.000    0.002    0.000    36.73   139.80        .
       total          1.119     1000    0.001    0.001    0.001    0.004    0.000   100.00   380.61    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.565     1000    0.002    0.003    0.003    0.004    0.001    75.37   100.00        .
        init          0.068     1000    0.000    0.000    0.000    0.001    0.000     2.00     2.65        .
       parse          0.612     1000    0.000    0.001    0.001    0.001    0.000    17.98    23.86        .
       check          0.003     1000    0.000    0.000    0.000    0.001    0.000     0.09     0.12        .
        eval          2.687     1000    0.002    0.003    0.003    0.005    0.000    78.96   104.76        .
       total          3.403     1000    0.003    0.003    0.003    0.005    0.000   100.00   132.67    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.640      100    0.025    0.026    0.026    0.030    0.001    96.95   100.00        .
        init          0.006      100    0.000    0.000    0.000    0.001    0.000     0.22     0.23        .
       parse          0.073      100    0.000    0.001    0.001    0.001    0.000     2.68     2.77        .
       check          0.001      100    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
        eval          2.640      100    0.025    0.026    0.026    0.031    0.001    96.95   100.00        .
       total          2.723      100    0.025    0.027    0.027    0.032    0.001   100.00   103.14    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.697       10    0.260    0.270    0.268    0.279    0.005   100.33   100.00        .
        init          0.003       10    0.000    0.000    0.000    0.001    0.000     0.11     0.11        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.19     0.19        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.680       10    0.259    0.268    0.265    0.281    0.008    99.70    99.37        .
       total          2.688       10    0.260    0.269    0.265    0.282    0.008   100.00    99.67   -0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.621        1    2.621    2.621    2.621    2.621        .    99.51   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          2.634        1    2.634    2.634    2.634    2.634        .   100.00   100.50        .
       total          2.634        1    2.634    2.634    2.634    2.634        .   100.00   100.50    0.013
--------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.237     1000    0.000    0.000    0.000    0.001    0.000    26.42   100.00        .
        init          0.068     1000    0.000    0.000    0.000    0.001    0.000     7.58    28.69        .
       parse          0.488     1000    0.000    0.000    0.000    0.001    0.001    54.40   205.91        .
       check          0.003     1000    0.000    0.000    0.000    0.001    0.000     0.33     1.27        .
        eval          0.309     1000    0.000    0.000    0.000    0.001    0.000    34.45   130.38        .
       total          0.897     1000    0.000    0.001    0.001    0.002    0.000   100.00   378.48    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.155     1000    0.002    0.002    0.002    0.005    0.000    76.15   100.00        .
        init          0.083     1000    0.000    0.000    0.000    0.001    0.000     2.93     3.85        .
       parse          0.488     1000    0.000    0.000    0.000    0.001    0.001    17.24    22.65        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.21     0.28        .
        eval          2.231     1000    0.002    0.002    0.002    0.004    0.000    78.83   103.53        .
       total          2.830     1000    0.002    0.003    0.003    0.005    0.000   100.00   131.32    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.183      100    0.021    0.022    0.022    0.024    0.001    95.49   100.00        .
        init          0.009      100    0.000    0.000    0.000    0.001    0.000     0.39     0.41        .
       parse          0.051      100    0.000    0.001    0.001    0.001    0.001     2.23     2.34        .
       check          0.002      100    0.000    0.000    0.000    0.001    0.000     0.09     0.09        .
        eval          2.220      100    0.020    0.022    0.022    0.039    0.002    97.11   101.69        .
       total          2.286      100    0.021    0.023    0.023    0.039    0.002   100.00   104.72    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.166       10    0.213    0.217    0.217    0.220    0.003    99.27   100.00        .
        init          0.002       10    0.000    0.000    0.000    0.001    0.000     0.09     0.09        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.23     0.23        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.175       10    0.213    0.217    0.218    0.220    0.002    99.68   100.42        .
       total          2.182       10    0.213    0.218    0.219    0.220    0.002   100.00   100.74    0.002
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.138        1    2.138    2.138    2.138    2.138        .    99.53   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.05     0.05        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          2.147        1    2.147    2.147    2.147    2.147        .    99.95   100.42        .
       total          2.148        1    2.148    2.148    2.148    2.148        .   100.00   100.47    0.010
--------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  22 Sep 2024, 23:27:46
----------------------------------------------------------------------------------------------------------------------------------------
