-----------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  29 Sep 2024, 23:10:28

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.528     1000    0.001    0.002    0.002    0.004    0.001    34.09   456.12        .
  base                     0.335     1000    0.000    0.000    0.000    0.002    0.000     7.47   100.00        .
  init                     0.515     1000    0.000    0.001    0.001    0.003    0.001    11.49   153.73        .
  parse                    0.726     1000    0.000    0.001    0.001    0.003    0.000    16.20   216.72        .
  check                    2.848     1000    0.002    0.003    0.003    0.005    0.000    63.54   850.15        .
  - usefulness             0.989     1000    0.000    0.001    0.001    0.003    0.000    22.07   295.22        .
  - combine                0.054     1000    0.000    0.000    0.000    0.001    0.000     1.20    16.12        .
  - exhaustiveness         1.728     1000    0.001    0.002    0.002    0.003    0.000    38.55   515.82        .
  - compress               0.009     1000    0.000    0.000    0.000    0.001    0.000     0.20     2.69        .
  - print                  0.024     1000    0.000    0.000    0.000    0.001    0.000     0.54     7.16        .
  eval                     0.361     1000    0.000    0.000    0.000    0.002    0.000     8.05   107.76        .
  total                    4.482     1000    0.004    0.004    0.004    0.008    0.001   100.00  1337.91    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.564     1000    0.002    0.004    0.004    0.007    0.001    47.18   127.06        .
  base                     2.805     1000    0.002    0.003    0.003    0.007    0.001    37.13   100.00        .
  init                     0.930     1000    0.000    0.001    0.001    0.003    0.000    12.31    33.16        .
  parse                    0.707     1000    0.000    0.001    0.001    0.002    0.000     9.36    25.20        .
  check                    2.767     1000    0.002    0.003    0.003    0.005    0.000    36.63    98.65        .
  - usefulness             0.970     1000    0.000    0.001    0.001    0.002    0.000    12.84    34.58        .
  - combine                0.047     1000    0.000    0.000    0.000    0.001    0.000     0.62     1.68        .
  - exhaustiveness         1.659     1000    0.001    0.002    0.002    0.004    0.000    21.96    59.14        .
  - compress               0.008     1000    0.000    0.000    0.000    0.001    0.000     0.11     0.29        .
  - print                  0.022     1000    0.000    0.000    0.000    0.001    0.000     0.29     0.78        .
  eval                     3.112     1000    0.002    0.003    0.003    0.005    0.000    41.20   110.94        .
  total                    7.554     1000    0.007    0.008    0.008    0.011    0.001   100.00   269.30    0.005
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.575      100    0.014    0.016    0.016    0.021    0.001    38.28    51.59        .
  base                     3.053      100    0.029    0.031    0.030    0.038    0.001    74.21   100.00        .
  init                     0.579      100    0.005    0.006    0.006    0.008    0.001    14.07    18.96        .
  parse                    0.074      100    0.000    0.001    0.001    0.002    0.000     1.80     2.42        .
  check                    0.279      100    0.002    0.003    0.003    0.005    0.001     6.78     9.14        .
  - usefulness             0.101      100    0.000    0.001    0.001    0.003    0.000     2.46     3.31        .
  - combine                0.002      100    0.000    0.000    0.000    0.001    0.000     0.05     0.07        .
  - exhaustiveness         0.169      100    0.001    0.002    0.002    0.003    0.000     4.11     5.54        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.02     0.03        .
  - print                  0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     3.179      100    0.030    0.032    0.031    0.043    0.002    77.27   104.13        .
  total                    4.114      100    0.039    0.041    0.041    0.054    0.002   100.00   134.75    0.011
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.929       10    0.179    0.193    0.184    0.226    0.015    61.69    76.52        .
  base                     2.521       10    0.249    0.252    0.252    0.256    0.002    80.62   100.00        .
  init                     0.490       10    0.047    0.049    0.048    0.052    0.002    15.67    19.44        .
  parse                    0.009       10    0.000    0.001    0.001    0.002    0.001     0.29     0.36        .
  check                    0.028       10    0.002    0.003    0.002    0.005    0.001     0.90     1.11        .
  - usefulness             0.010       10    0.001    0.001    0.001    0.001    0.000     0.32     0.40        .
  - combine                0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.04        .
  - exhaustiveness         0.017       10    0.001    0.002    0.001    0.004    0.001     0.54     0.67        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     2.599       10    0.254    0.260    0.258    0.270    0.005    83.11   103.09        .
  total                    3.127       10    0.306    0.313    0.311    0.321    0.005   100.00   124.04    0.061
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.108        1    3.108    3.108    3.108    3.108        .   101.27   123.63        .
  base                     2.514        1    2.514    2.514    2.514    2.514        .    81.92   100.00        .
  init                     0.477        1    0.477    0.477    0.477    0.477        .    15.54    18.97        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  check                    0.002        1    0.002    0.002    0.002    0.002        .     0.07     0.08        .
  - usefulness             0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     2.589        1    2.589    2.589    2.589    2.589        .    84.36   102.98        .
  total                    3.069        1    3.069    3.069    3.069    3.069        .   100.00   122.08    0.555
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.568     1000    0.000    0.002    0.002    0.003    0.001    32.86   461.18        .
  base                     0.340     1000    0.000    0.000    0.000    0.002    0.000     7.12   100.00        .
  init                     0.821     1000    0.000    0.001    0.001    0.003    0.000    17.20   241.47        .
  parse                    0.704     1000    0.000    0.001    0.001    0.002    0.000    14.75   207.06        .
  check                    2.822     1000    0.002    0.003    0.003    0.005    0.001    59.14   830.00        .
  - usefulness             0.998     1000    0.000    0.001    0.001    0.003    0.000    20.91   293.53        .
  - combine                0.052     1000    0.000    0.000    0.000    0.001    0.000     1.09    15.29        .
  - exhaustiveness         1.700     1000    0.001    0.002    0.002    0.003    0.001    35.62   500.00        .
  - compress               0.003     1000    0.000    0.000    0.000    0.001    0.000     0.06     0.88        .
  - print                  0.021     1000    0.000    0.000    0.000    0.001    0.000     0.44     6.18        .
  eval                     0.394     1000    0.000    0.000    0.000    0.001    0.000     8.26   115.88        .
  total                    4.772     1000    0.004    0.005    0.005    0.008    0.001   100.00  1403.53    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.485     1000    0.002    0.003    0.003    0.007    0.001    32.26   122.58        .
  base                     2.843     1000    0.002    0.003    0.003    0.006    0.001    26.32   100.00        .
  init                     3.786     1000    0.003    0.004    0.004    0.007    0.001    35.05   133.17        .
  parse                    0.770     1000    0.000    0.001    0.001    0.004    0.000     7.13    27.08        .
  check                    2.910     1000    0.002    0.003    0.003    0.006    0.001    26.94   102.36        .
  - usefulness             1.026     1000    0.000    0.001    0.001    0.002    0.000     9.50    36.09        .
  - combine                0.055     1000    0.000    0.000    0.000    0.001    0.000     0.51     1.93        .
  - exhaustiveness         1.741     1000    0.001    0.002    0.002    0.004    0.001    16.12    61.24        .
  - compress               0.008     1000    0.000    0.000    0.000    0.001    0.000     0.07     0.28        .
  - print                  0.021     1000    0.000    0.000    0.000    0.001    0.000     0.19     0.74        .
  eval                     3.308     1000    0.002    0.003    0.003    0.006    0.000    30.62   116.36        .
  total                   10.803     1000    0.010    0.011    0.011    0.015    0.001   100.00   379.99    0.008
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.817      100    0.017    0.018    0.018    0.021    0.001    13.64    29.58        .
  base                     6.142      100    0.059    0.061    0.061    0.071    0.002    46.09   100.00        .
  init                     6.460      100    0.059    0.065    0.064    0.081    0.003    48.48   105.18        .
  parse                    0.081      100    0.000    0.001    0.001    0.003    0.001     0.61     1.32        .
  check                    0.284      100    0.002    0.003    0.003    0.007    0.001     2.13     4.62        .
  - usefulness             0.099      100    0.000    0.001    0.001    0.003    0.000     0.74     1.61        .
  - combine                0.004      100    0.000    0.000    0.000    0.001    0.000     0.03     0.07        .
  - exhaustiveness         0.173      100    0.001    0.002    0.002    0.004    0.001     1.30     2.82        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     0.05        .
  eval                     6.497      100    0.062    0.065    0.065    0.072    0.002    48.76   105.78        .
  total                   13.325      100    0.125    0.133    0.132    0.154    0.004   100.00   216.95    0.072
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.933       10    0.185    0.193    0.194    0.199    0.004    29.64    74.15        .
  base                     2.607       10    0.258    0.261    0.260    0.264    0.002    39.98   100.00        .
  init                     3.786       10    0.370    0.379    0.376    0.390    0.007    58.06   145.22        .
  parse                    0.010       10    0.001    0.001    0.001    0.001    0.000     0.15     0.38        .
  check                    0.027       10    0.002    0.003    0.003    0.003    0.000     0.41     1.04        .
  - usefulness             0.010       10    0.001    0.001    0.001    0.001    0.000     0.15     0.38        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.017       10    0.001    0.002    0.002    0.002    0.000     0.26     0.65        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     2.698       10    0.266    0.270    0.269    0.275    0.003    41.37   103.49        .
  total                    6.521       10    0.641    0.652    0.649    0.665    0.007   100.00   250.13    0.391
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.097        1    3.097    3.097    3.097    3.097        .    48.53   119.30        .
  base                     2.596        1    2.596    2.596    2.596    2.596        .    40.68   100.00        .
  init                     3.756        1    3.756    3.756    3.756    3.756        .    58.85   144.68        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  check                    0.003        1    0.003    0.003    0.003    0.003        .     0.05     0.12        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.08        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     2.622        1    2.622    2.622    2.622    2.622        .    41.08   101.00        .
  total                    6.382        1    6.382    6.382    6.382    6.382        .   100.00   245.84    3.786
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.062     1000    0.001    0.002    0.002    0.004    0.000    68.96  1212.94        .
  base                     0.170     1000    0.000    0.000    0.000    0.002    0.000     5.69   100.00        .
  init                     0.545     1000    0.000    0.001    0.001    0.002    0.001    18.23   320.59        .
  parse                    0.436     1000    0.000    0.000    0.000    0.002    0.000    14.58   256.47        .
  check                    1.784     1000    0.001    0.002    0.002    0.003    0.000    59.67  1049.41        .
  - usefulness             0.393     1000    0.000    0.000    0.000    0.001    0.000    13.14   231.18        .
  - combine                0.025     1000    0.000    0.000    0.000    0.001    0.000     0.84    14.71        .
  - exhaustiveness         1.309     1000    0.001    0.001    0.001    0.002    0.000    43.78   770.00        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.17     2.94        .
  - print                  0.016     1000    0.000    0.000    0.000    0.001    0.000     0.54     9.41        .
  eval                     0.193     1000    0.000    0.000    0.000    0.001    0.000     6.45   113.53        .
  total                    2.990     1000    0.002    0.003    0.003    0.005    0.000   100.00  1758.82    0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.296     1000    0.007    0.008    0.008    0.013    0.001    97.51   521.76        .
  base                     1.590     1000    0.001    0.002    0.002    0.005    0.001    18.69   100.00        .
  init                     4.697     1000    0.004    0.005    0.005    0.008    0.001    55.21   295.41        .
  parse                    0.464     1000    0.000    0.000    0.000    0.001    0.000     5.45    29.18        .
  check                    1.775     1000    0.001    0.002    0.002    0.003    0.000    20.86   111.64        .
  - usefulness             0.366     1000    0.000    0.000    0.000    0.002    0.000     4.30    23.02        .
  - combine                0.018     1000    0.000    0.000    0.000    0.001    0.000     0.21     1.13        .
  - exhaustiveness         1.328     1000    0.001    0.001    0.001    0.002    0.000    15.61    83.52        .
  - compress               0.001     1000    0.000    0.000    0.000    0.001    0.000     0.01     0.06        .
  - print                  0.018     1000    0.000    0.000    0.000    0.001    0.000     0.21     1.13        .
  eval                     1.539     1000    0.001    0.002    0.002    0.002    0.000    18.09    96.79        .
  total                    8.508     1000    0.008    0.009    0.008    0.012    0.001   100.00   535.09    0.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.441      100    0.062    0.064    0.064    0.071    0.002    86.28   428.54        .
  base                     1.503      100    0.014    0.015    0.015    0.022    0.001    20.13   100.00        .
  init                     5.710      100    0.054    0.057    0.057    0.070    0.002    76.49   379.91        .
  parse                    0.052      100    0.000    0.001    0.001    0.001    0.001     0.70     3.46        .
  check                    0.176      100    0.001    0.002    0.002    0.003    0.000     2.36    11.71        .
  - usefulness             0.036      100    0.000    0.000    0.000    0.001    0.000     0.48     2.40        .
  - combine                0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.135      100    0.001    0.001    0.001    0.003    0.001     1.81     8.98        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.07        .
  - print                  0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.07        .
  eval                     1.526      100    0.014    0.015    0.015    0.019    0.001    20.44   101.53        .
  total                    7.465      100    0.072    0.075    0.074    0.088    0.002   100.00   496.67    0.060
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.045       10    0.696    0.705    0.701    0.716    0.007   111.54   467.49        .
  base                     1.507       10    0.148    0.151    0.150    0.155    0.002    23.86   100.00        .
  init                     4.756       10    0.469    0.476    0.475    0.487    0.005    75.30   315.59        .
  parse                    0.007       10    0.000    0.001    0.001    0.001    0.000     0.11     0.46        .
  check                    0.018       10    0.001    0.002    0.002    0.002    0.000     0.28     1.19        .
  - usefulness             0.002       10    0.000    0.000    0.000    0.001    0.000     0.03     0.13        .
  - combine                0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.07        .
  - exhaustiveness         0.014       10    0.001    0.001    0.001    0.002    0.001     0.22     0.93        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     1.535       10    0.151    0.153    0.154    0.156    0.002    24.30   101.86        .
  total                    6.316       10    0.627    0.632    0.631    0.643    0.005   100.00   419.11    0.481
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.306        1    8.306    8.306    8.306    8.306        .   133.00   540.76        .
  base                     1.536        1    1.536    1.536    1.536    1.536        .    24.60   100.00        .
  init                     4.695        1    4.695    4.695    4.695    4.695        .    75.18   305.66        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.07        .
  check                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.07        .
  - usefulness             0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.07        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.548        1    1.548    1.548    1.548    1.548        .    24.79   100.78        .
  total                    6.245        1    6.245    6.245    6.245    6.245        .   100.00   406.58    4.709
-------------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.136      100    0.001    0.001    0.001    0.002    0.000     1.09   104.62        .
  base                     0.130      100    0.001    0.001    0.001    0.002    0.000     1.04   100.00        .
  init                     0.067      100    0.000    0.001    0.001    0.001    0.000     0.54    51.54        .
  parse                    0.341      100    0.003    0.003    0.003    0.006    0.001     2.74   262.31        .
  check                   11.881      100    0.116    0.119    0.118    0.128    0.002    95.38  9139.23        .
  - usefulness             3.560      100    0.034    0.036    0.035    0.039    0.001    28.58  2738.46        .
  - combine                0.077      100    0.000    0.001    0.001    0.001    0.000     0.62    59.23        .
  - exhaustiveness         8.220      100    0.079    0.082    0.082    0.090    0.002    65.99  6323.08        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.77        .
  - print                  0.006      100    0.000    0.000    0.000    0.001    0.000     0.05     4.62        .
  eval                     0.164      100    0.001    0.002    0.002    0.003    0.001     1.32   126.15        .
  total                   12.457      100    0.122    0.125    0.124    0.133    0.002   100.00  9582.31    0.123
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.324      100    0.002    0.003    0.003    0.004    0.001     2.38    30.45        .
  base                     1.064      100    0.010    0.011    0.011    0.013    0.001     7.82   100.00        .
  init                     0.161      100    0.001    0.002    0.002    0.002    0.000     1.18    15.13        .
  parse                    0.331      100    0.003    0.003    0.003    0.005    0.000     2.43    31.11        .
  check                   11.967      100    0.116    0.120    0.119    0.133    0.003    87.91  1124.72        .
  - usefulness             3.572      100    0.034    0.036    0.035    0.041    0.001    26.24   335.71        .
  - combine                0.086      100    0.000    0.001    0.001    0.002    0.000     0.63     8.08        .
  - exhaustiveness         8.276      100    0.080    0.083    0.082    0.094    0.002    60.79   777.82        .
  - compress               0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     0.28        .
  - print                  0.009      100    0.000    0.000    0.000    0.001    0.000     0.07     0.85        .
  eval                     1.147      100    0.011    0.011    0.011    0.017    0.001     8.43   107.80        .
  total                   13.613      100    0.132    0.136    0.135    0.149    0.003   100.00  1279.42    0.125
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.129       10    0.012    0.013    0.013    0.014    0.001     5.30    12.25        .
  base                     1.053       10    0.103    0.105    0.104    0.116    0.004    43.28   100.00        .
  init                     0.129       10    0.012    0.013    0.013    0.014    0.001     5.30    12.25        .
  parse                    0.033       10    0.003    0.003    0.003    0.004    0.000     1.36     3.13        .
  check                    1.184       10    0.117    0.118    0.118    0.120    0.001    48.66   112.44        .
  - usefulness             0.359       10    0.035    0.036    0.035    0.039    0.001    14.76    34.09        .
  - combine                0.009       10    0.000    0.001    0.001    0.002    0.001     0.37     0.85        .
  - exhaustiveness         0.816       10    0.080    0.082    0.082    0.083    0.001    33.54    77.49        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     1.086       10    0.107    0.109    0.108    0.115    0.002    44.64   103.13        .
  total                    2.433       10    0.240    0.243    0.242    0.250    0.003   100.00   231.05    0.138
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.177        1    0.177    0.177    0.177    0.177        .    13.20    16.59        .
  base                     1.067        1    1.067    1.067    1.067    1.067        .    79.57   100.00        .
  init                     0.125        1    0.125    0.125    0.125    0.125        .     9.32    11.72        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.22     0.28        .
  check                    0.120        1    0.120    0.120    0.120    0.120        .     8.95    11.25        .
  - usefulness             0.038        1    0.038    0.038    0.038    0.038        .     2.83     3.56        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.09        .
  - exhaustiveness         0.081        1    0.081    0.081    0.081    0.081        .     6.04     7.59        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.093        1    1.093    1.093    1.093    1.093        .    81.51   102.44        .
  total                    1.341        1    1.341    1.341    1.341    1.341        .   100.00   125.68    0.274
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.062        1    3.062    3.062    3.062    3.062        .    25.22    28.74        .
  base                    10.653        1   10.653   10.653   10.653   10.653        .    87.74   100.00        .
  init                     1.266        1    1.266    1.266    1.266    1.266        .    10.43    11.88        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check                    0.118        1    0.118    0.118    0.118    0.118        .     0.97     1.11        .
  - usefulness             0.035        1    0.035    0.035    0.035    0.035        .     0.29     0.33        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.081        1    0.081    0.081    0.081    0.081        .     0.67     0.76        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    10.754        1   10.754   10.754   10.754   10.754        .    88.58   100.95        .
  total                   12.141        1   12.141   12.141   12.141   12.141        .   100.00   113.97    1.488
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.140      100    0.001    0.001    0.001    0.003    0.001     1.12   102.94        .
  base                     0.136      100    0.001    0.001    0.001    0.003    0.001     1.09   100.00        .
  init                     0.086      100    0.000    0.001    0.001    0.002    0.000     0.69    63.24        .
  parse                    0.336      100    0.003    0.003    0.003    0.004    0.000     2.69   247.06        .
  check                   11.881      100    0.116    0.119    0.118    0.126    0.002    95.23  8736.03        .
  - usefulness             3.563      100    0.034    0.036    0.035    0.040    0.001    28.56  2619.85        .
  - combine                0.090      100    0.000    0.001    0.001    0.002    0.000     0.72    66.18        .
  - exhaustiveness         8.193      100    0.080    0.082    0.081    0.087    0.002    65.67  6024.26        .
  - compress               0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     2.21        .
  - print                  0.012      100    0.000    0.000    0.000    0.001    0.000     0.10     8.82        .
  eval                     0.171      100    0.001    0.002    0.002    0.003    0.000     1.37   125.74        .
  total                   12.476      100    0.122    0.125    0.124    0.131    0.002   100.00  9173.53    0.123
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.335      100    0.002    0.003    0.003    0.005    0.001     2.36    28.58        .
  base                     1.172      100    0.010    0.012    0.012    0.015    0.001     8.27   100.00        .
  init                     0.372      100    0.003    0.004    0.004    0.005    0.000     2.62    31.74        .
  parse                    0.350      100    0.003    0.004    0.003    0.006    0.001     2.47    29.86        .
  check                   11.973      100    0.116    0.120    0.119    0.145    0.003    84.48  1021.59        .
  - usefulness             3.622      100    0.034    0.036    0.036    0.051    0.002    25.56   309.04        .
  - combine                0.093      100    0.000    0.001    0.001    0.002    0.000     0.66     7.94        .
  - exhaustiveness         8.229      100    0.080    0.082    0.082    0.092    0.002    58.06   702.13        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.01     0.17        .
  - print                  0.010      100    0.000    0.000    0.000    0.001    0.000     0.07     0.85        .
  eval                     1.473      100    0.013    0.015    0.014    0.019    0.001    10.39   125.68        .
  total                   14.173      100    0.137    0.142    0.141    0.169    0.004   100.00  1209.30    0.130
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.186       10    0.017    0.019    0.018    0.021    0.001     3.81     6.47        .
  base                     2.875       10    0.284    0.287    0.286    0.297    0.004    58.96   100.00        .
  init                     0.612       10    0.057    0.061    0.060    0.067    0.003    12.55    21.29        .
  parse                    0.034       10    0.003    0.003    0.003    0.005    0.001     0.70     1.18        .
  check                    1.209       10    0.116    0.121    0.120    0.127    0.003    24.79    42.05        .
  - usefulness             0.358       10    0.035    0.036    0.035    0.039    0.001     7.34    12.45        .
  - combine                0.008       10    0.000    0.001    0.001    0.001    0.000     0.16     0.28        .
  - exhaustiveness         0.840       10    0.080    0.084    0.083    0.089    0.003    17.23    29.22        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     3.021       10    0.298    0.302    0.301    0.310    0.004    61.96   105.08        .
  total                    4.876       10    0.482    0.488    0.488    0.492    0.003   100.00   169.60    0.200
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.195        1    0.195    0.195    0.195    0.195        .    12.27    17.65        .
  base                     1.105        1    1.105    1.105    1.105    1.105        .    69.54   100.00        .
  init                     0.336        1    0.336    0.336    0.336    0.336        .    21.15    30.41        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.19     0.27        .
  check                    0.119        1    0.119    0.119    0.119    0.119        .     7.49    10.77        .
  - usefulness             0.036        1    0.036    0.036    0.036    0.036        .     2.27     3.26        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.09        .
  - exhaustiveness         0.082        1    0.082    0.082    0.082    0.082        .     5.16     7.42        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.131        1    1.131    1.131    1.131    1.131        .    71.18   102.35        .
  total                    1.589        1    1.589    1.589    1.589    1.589        .   100.00   143.80    0.484
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.059        1    3.059    3.059    3.059    3.059        .    21.35    28.30        .
  base                    10.809        1   10.809   10.809   10.809   10.809        .    75.43   100.00        .
  init                     3.177        1    3.177    3.177    3.177    3.177        .    22.17    29.39        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check                    0.119        1    0.119    0.119    0.119    0.119        .     0.83     1.10        .
  - usefulness             0.036        1    0.036    0.036    0.036    0.036        .     0.25     0.33        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.082        1    0.082    0.082    0.082    0.082        .     0.57     0.76        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    11.030        1   11.030   11.030   11.030   11.030        .    76.98   102.04        .
  total                   14.329        1   14.329   14.329   14.329   14.329        .   100.00   132.57    3.520
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.199      100    0.001    0.002    0.002    0.003    0.000     1.59   177.68        .
  base                     0.112      100    0.001    0.001    0.001    0.003    0.000     0.89   100.00        .
  init                     0.070      100    0.000    0.001    0.001    0.002    0.000     0.56    62.50        .
  parse                    0.231      100    0.002    0.002    0.002    0.005    0.001     1.85   206.25        .
  check                   12.072      100    0.118    0.121    0.120    0.130    0.002    96.45 10778.57        .
  - usefulness             2.868      100    0.027    0.029    0.028    0.032    0.001    22.91  2560.71        .
  - combine                0.035      100    0.000    0.000    0.000    0.001    0.000     0.28    31.25        .
  - exhaustiveness         9.150      100    0.089    0.091    0.091    0.102    0.002    73.11  8169.64        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     2.68        .
  eval                     0.139      100    0.001    0.001    0.001    0.003    0.001     1.11   124.11        .
  total                   12.516      100    0.122    0.125    0.125    0.134    0.002   100.00 11175.00    0.124
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.874      100    0.007    0.009    0.008    0.013    0.001     6.34    88.55        .
  base                     0.987      100    0.009    0.010    0.010    0.013    0.001     7.16   100.00        .
  init                     0.523      100    0.005    0.005    0.005    0.007    0.000     3.79    52.99        .
  parse                    0.223      100    0.002    0.002    0.002    0.003    0.000     1.62    22.59        .
  check                   12.015      100    0.117    0.120    0.120    0.128    0.002    87.16  1217.33        .
  - usefulness             2.856      100    0.027    0.029    0.028    0.033    0.001    20.72   289.36        .
  - combine                0.033      100    0.000    0.000    0.000    0.005    0.001     0.24     3.34        .
  - exhaustiveness         9.110      100    0.089    0.091    0.091    0.099    0.002    66.09   923.00        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     0.30        .
  eval                     1.018      100    0.009    0.010    0.010    0.012    0.001     7.38   103.14        .
  total                   13.785      100    0.135    0.138    0.137    0.146    0.002   100.00  1396.66    0.128
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.668       10    0.065    0.067    0.066    0.070    0.002    23.56    68.30        .
  base                     0.978       10    0.095    0.098    0.096    0.106    0.004    34.50   100.00        .
  init                     0.621       10    0.060    0.062    0.062    0.065    0.002    21.90    63.50        .
  parse                    0.025       10    0.002    0.003    0.002    0.003    0.001     0.88     2.56        .
  check                    1.200       10    0.118    0.120    0.119    0.125    0.002    42.33   122.70        .
  - usefulness             0.285       10    0.028    0.029    0.028    0.029    0.001    10.05    29.14        .
  - combine                0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.10        .
  - exhaustiveness         0.913       10    0.090    0.091    0.090    0.096    0.002    32.20    93.35        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     0.988       10    0.097    0.099    0.098    0.101    0.001    34.85   101.02        .
  total                    2.835       10    0.280    0.283    0.283    0.291    0.003   100.00   289.88    0.186
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.726        1    0.726    0.726    0.726    0.726        .    45.09    73.26        .
  base                     0.991        1    0.991    0.991    0.991    0.991        .    61.55   100.00        .
  init                     0.500        1    0.500    0.500    0.500    0.500        .    31.06    50.45        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.12     0.20        .
  check                    0.120        1    0.120    0.120    0.120    0.120        .     7.45    12.11        .
  - usefulness             0.029        1    0.029    0.029    0.029    0.029        .     1.80     2.93        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.10        .
  - exhaustiveness         0.090        1    0.090    0.090    0.090    0.090        .     5.59     9.08        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     0.988        1    0.988    0.988    0.988    0.988        .    61.37    99.70        .
  total                    1.610        1    1.610    1.610    1.610    1.610        .   100.00   162.46    0.619
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.515        1    8.515    8.515    8.515    8.515        .    56.05    86.19        .
  base                     9.879        1    9.879    9.879    9.879    9.879        .    65.03   100.00        .
  init                     5.027        1    5.027    5.027    5.027    5.027        .    33.09    50.89        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.02        .
  check                    0.118        1    0.118    0.118    0.118    0.118        .     0.78     1.19        .
  - usefulness             0.029        1    0.029    0.029    0.029    0.029        .     0.19     0.29        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.089        1    0.089    0.089    0.089    0.089        .     0.59     0.90        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    10.044        1   10.044   10.044   10.044   10.044        .    66.12   101.67        .
  total                   15.191        1   15.191   15.191   15.191   15.191        .   100.00   153.77    5.312
-------------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.003        1    0.003    0.003    0.003    0.003        .     0.03    30.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.09   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.02    20.00        .
  parse                    0.150        1    0.150    0.150    0.150    0.150        .     1.32  1500.00        .
  check                   11.180        1   11.180   11.180   11.180   11.180        .    98.54  1.1e+05        .
  - usefulness             3.352        1    3.352    3.352    3.352    3.352        .    29.54 33520.00        .
  - combine                0.125        1    0.125    0.125    0.125    0.125        .     1.10  1250.00        .
  - exhaustiveness         7.696        1    7.696    7.696    7.696    7.696        .    67.83 76960.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  eval                     0.014        1    0.014    0.014    0.014    0.014        .     0.12   140.00        .
  total                   11.346        1   11.346   11.346   11.346   11.346        .   100.00  1.1e+05   11.336
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.004        1    0.004    0.004    0.004    0.004        .     0.04     4.30        .
  base                     0.093        1    0.093    0.093    0.093    0.093        .     0.82   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.02     2.15        .
  parse                    0.146        1    0.146    0.146    0.146    0.146        .     1.28   156.99        .
  check                   11.145        1   11.145   11.145   11.145   11.145        .    97.83 11983.87        .
  - usefulness             3.372        1    3.372    3.372    3.372    3.372        .    29.60  3625.81        .
  - combine                0.128        1    0.128    0.128    0.128    0.128        .     1.12   137.63        .
  - exhaustiveness         7.641        1    7.641    7.641    7.641    7.641        .    67.07  8216.13        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.08        .
  eval                     0.098        1    0.098    0.098    0.098    0.098        .     0.86   105.38        .
  total                   11.392        1   11.392   11.392   11.392   11.392        .   100.00 12249.46   11.299
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.014        1    0.014    0.014    0.014    0.014        .     0.11     1.54        .
  base                     0.912        1    0.912    0.912    0.912    0.912        .     7.49   100.00        .
  init                     0.013        1    0.013    0.013    0.013    0.013        .     0.11     1.43        .
  parse                    0.144        1    0.144    0.144    0.144    0.144        .     1.18    15.79        .
  check                   11.080        1   11.080   11.080   11.080   11.080        .    90.98  1214.91        .
  - usefulness             3.330        1    3.330    3.330    3.330    3.330        .    27.34   365.13        .
  - combine                0.128        1    0.128    0.128    0.128    0.128        .     1.05    14.04        .
  - exhaustiveness         7.619        1    7.619    7.619    7.619    7.619        .    62.56   835.42        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.11        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.11        .
  eval                     0.942        1    0.942    0.942    0.942    0.942        .     7.73   103.29        .
  total                   12.179        1   12.179   12.179   12.179   12.179        .   100.00  1335.42   11.267
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.199        1    0.199    0.199    0.199    0.199        .     0.95     2.14        .
  base                     9.314        1    9.314    9.314    9.314    9.314        .    44.42   100.00        .
  init                     0.128        1    0.128    0.128    0.128    0.128        .     0.61     1.37        .
  parse                    0.148        1    0.148    0.148    0.148    0.148        .     0.71     1.59        .
  check                   11.218        1   11.218   11.218   11.218   11.218        .    53.50   120.44        .
  - usefulness             3.347        1    3.347    3.347    3.347    3.347        .    15.96    35.94        .
  - combine                0.127        1    0.127    0.127    0.127    0.127        .     0.61     1.36        .
  - exhaustiveness         7.739        1    7.739    7.739    7.739    7.739        .    36.91    83.09        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  eval                     9.474        1    9.474    9.474    9.474    9.474        .    45.18   101.72        .
  total                   20.969        1   20.969   20.969   20.969   20.969        .   100.00   225.13   11.655
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_integer, obs(10000000) levels(1000) rep(1)
. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.010        1    0.010    0.010    0.010    0.010        .     0.09   100.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.09   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  parse                    0.157        1    0.157    0.157    0.157    0.157        .     1.37  1570.00        .
  check                   11.265        1   11.265   11.265   11.265   11.265        .    98.48  1.1e+05        .
  - usefulness             3.331        1    3.331    3.331    3.331    3.331        .    29.12 33310.00        .
  - combine                0.127        1    0.127    0.127    0.127    0.127        .     1.11  1270.00        .
  - exhaustiveness         7.803        1    7.803    7.803    7.803    7.803        .    68.21 78030.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  eval                     0.014        1    0.014    0.014    0.014    0.014        .     0.12   140.00        .
  total                   11.439        1   11.439   11.439   11.439   11.439        .   100.00  1.1e+05   11.429
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.004        1    0.004    0.004    0.004    0.004        .     0.04     3.96        .
  base                     0.101        1    0.101    0.101    0.101    0.101        .     0.89   100.00        .
  init                     0.004        1    0.004    0.004    0.004    0.004        .     0.04     3.96        .
  parse                    0.145        1    0.145    0.145    0.145    0.145        .     1.28   143.56        .
  check                   11.080        1   11.080   11.080   11.080   11.080        .    97.58 10970.30        .
  - usefulness             3.319        1    3.319    3.319    3.319    3.319        .    29.23  3286.14        .
  - combine                0.125        1    0.125    0.125    0.125    0.125        .     1.10   123.76        .
  - exhaustiveness         7.632        1    7.632    7.632    7.632    7.632        .    67.21  7556.44        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.99        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.99        .
  eval                     0.125        1    0.125    0.125    0.125    0.125        .     1.10   123.76        .
  total                   11.355        1   11.355   11.355   11.355   11.355        .   100.00 11242.57   11.254
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.018        1    0.018    0.018    0.018    0.018        .     0.14     1.63        .
  base                     1.104        1    1.104    1.104    1.104    1.104        .     8.77   100.00        .
  init                     0.060        1    0.060    0.060    0.060    0.060        .     0.48     5.43        .
  parse                    0.168        1    0.168    0.168    0.168    0.168        .     1.33    15.22        .
  check                   11.186        1   11.186   11.186   11.186   11.186        .    88.84  1013.22        .
  - usefulness             3.340        1    3.340    3.340    3.340    3.340        .    26.53   302.54        .
  - combine                0.126        1    0.126    0.126    0.126    0.126        .     1.00    11.41        .
  - exhaustiveness         7.716        1    7.716    7.716    7.716    7.716        .    61.28   698.91        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.09        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.09        .
  eval                     1.176        1    1.176    1.176    1.176    1.176        .     9.34   106.52        .
  total                   12.591        1   12.591   12.591   12.591   12.591        .   100.00  1140.49   11.487
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.196        1    0.196    0.196    0.196    0.196        .     0.91     2.08        .
  base                     9.421        1    9.421    9.421    9.421    9.421        .    43.88   100.00        .
  init                     0.336        1    0.336    0.336    0.336    0.336        .     1.57     3.57        .
  parse                    0.146        1    0.146    0.146    0.146    0.146        .     0.68     1.55        .
  check                   11.294        1   11.294   11.294   11.294   11.294        .    52.61   119.88        .
  - usefulness             3.365        1    3.365    3.365    3.365    3.365        .    15.67    35.72        .
  - combine                0.126        1    0.126    0.126    0.126    0.126        .     0.59     1.34        .
  - exhaustiveness         7.800        1    7.800    7.800    7.800    7.800        .    36.33    82.79        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  eval                     9.692        1    9.692    9.692    9.692    9.692        .    45.14   102.88        .
  total                   21.469        1   21.469   21.469   21.469   21.469        .   100.00   227.88   12.048
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_float,   obs(10000000) levels(1000) rep(1)
. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.02    20.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.08   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  parse                    0.073        1    0.073    0.073    0.073    0.073        .     0.61   730.00        .
  check                   11.906        1   11.906   11.906   11.906   11.906        .    99.27  1.2e+05        .
  - usefulness             2.931        1    2.931    2.931    2.931    2.931        .    24.44 29310.00        .
  - combine                0.051        1    0.051    0.051    0.051    0.051        .     0.43   510.00        .
  - exhaustiveness         8.920        1    8.920    8.920    8.920    8.920        .    74.38 89200.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  eval                     0.012        1    0.012    0.012    0.012    0.012        .     0.10   120.00        .
  total                   11.993        1   11.993   11.993   11.993   11.993        .   100.00  1.2e+05   11.983
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.011        1    0.011    0.011    0.011    0.011        .     0.09    11.46        .
  base                     0.096        1    0.096    0.096    0.096    0.096        .     0.79   100.00        .
  init                     0.006        1    0.006    0.006    0.006    0.006        .     0.05     6.25        .
  parse                    0.068        1    0.068    0.068    0.068    0.068        .     0.56    70.83        .
  check                   11.972        1   11.972   11.972   11.972   11.972        .    98.57 12470.83        .
  - usefulness             2.916        1    2.916    2.916    2.916    2.916        .    24.01  3037.50        .
  - combine                0.051        1    0.051    0.051    0.051    0.051        .     0.42    53.13        .
  - exhaustiveness         8.999        1    8.999    8.999    8.999    8.999        .    74.09  9373.96        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.04        .
  eval                     0.100        1    0.100    0.100    0.100    0.100        .     0.82   104.17        .
  total                   12.146        1   12.146   12.146   12.146   12.146        .   100.00 12652.08   12.050
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.071        1    0.071    0.071    0.071    0.071        .     0.54     7.50        .
  base                     0.947        1    0.947    0.947    0.947    0.947        .     7.21   100.00        .
  init                     0.069        1    0.069    0.069    0.069    0.069        .     0.53     7.29        .
  parse                    0.070        1    0.070    0.070    0.070    0.070        .     0.53     7.39        .
  check                   12.019        1   12.019   12.019   12.019   12.019        .    91.54  1269.17        .
  - usefulness             2.950        1    2.950    2.950    2.950    2.950        .    22.47   311.51        .
  - combine                0.050        1    0.050    0.050    0.050    0.050        .     0.38     5.28        .
  - exhaustiveness         9.015        1    9.015    9.015    9.015    9.015        .    68.66   951.95        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.11        .
  eval                     0.972        1    0.972    0.972    0.972    0.972        .     7.40   102.64        .
  total                   13.130        1   13.130   13.130   13.130   13.130        .   100.00  1386.48   12.183
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.758        1    0.758    0.758    0.758    0.758        .     3.38     7.87        .
  base                     9.629        1    9.629    9.629    9.629    9.629        .    42.91   100.00        .
  init                     0.529        1    0.529    0.529    0.529    0.529        .     2.36     5.49        .
  parse                    0.071        1    0.071    0.071    0.071    0.071        .     0.32     0.74        .
  check                   12.030        1   12.030   12.030   12.030   12.030        .    53.61   124.94        .
  - usefulness             2.963        1    2.963    2.963    2.963    2.963        .    13.21    30.77        .
  - combine                0.051        1    0.051    0.051    0.051    0.051        .     0.23     0.53        .
  - exhaustiveness         9.011        1    9.011    9.011    9.011    9.011        .    40.16    93.58        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     9.808        1    9.808    9.808    9.808    9.808        .    43.71   101.86        .
  total                   22.438        1   22.438   22.438   22.438   22.438        .   100.00   233.03   12.809
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_string,  obs(10000000) levels(1000) rep(1)
. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.526     1000    0.000    0.002    0.002    0.004    0.001   134.09   455.52        .
  base                     0.335     1000    0.000    0.000    0.000    0.002    0.000    29.44   100.00        .
  init                     0.087     1000    0.000    0.000    0.000    0.001    0.000     7.64    25.97        .
  parse                    0.654     1000    0.000    0.001    0.001    0.002    0.000    57.47   195.22        .
  check                    0.005     1000    0.000    0.000    0.000    0.001    0.000     0.44     1.49        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.368     1000    0.000    0.000    0.000    0.002    0.000    32.34   109.85        .
  total                    1.138     1000    0.001    0.001    0.001    0.003    0.000   100.00   339.70    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.577     1000    0.002    0.004    0.004    0.005    0.001   105.49   139.89        .
  base                     2.557     1000    0.002    0.003    0.003    0.005    0.001    75.41   100.00        .
  init                     0.093     1000    0.000    0.000    0.000    0.001    0.000     2.74     3.64        .
  parse                    0.658     1000    0.000    0.001    0.001    0.003    0.000    19.40    25.73        .
  check                    0.005     1000    0.000    0.000    0.000    0.001    0.000     0.15     0.20        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.607     1000    0.002    0.003    0.003    0.004    0.001    76.88   101.96        .
  total                    3.391     1000    0.003    0.003    0.003    0.006    0.001   100.00   132.62    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.357      100    0.012    0.014    0.013    0.016    0.001    51.28    54.24        .
  base                     2.502      100    0.024    0.025    0.025    0.029    0.001    94.56   100.00        .
  init                     0.017      100    0.000    0.000    0.000    0.001    0.000     0.64     0.68        .
  parse                    0.066      100    0.000    0.001    0.001    0.001    0.000     2.49     2.64        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.562      100    0.025    0.026    0.025    0.031    0.001    96.83   102.40        .
  total                    2.646      100    0.025    0.026    0.026    0.032    0.001   100.00   105.76    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.888       10    0.182    0.189    0.190    0.195    0.004    73.29    74.33        .
  base                     2.540       10    0.249    0.254    0.252    0.263    0.004    98.60   100.00        .
  init                     0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  parse                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.31     0.31        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.568       10    0.252    0.257    0.255    0.268    0.005    99.69   101.10        .
  total                    2.576       10    0.253    0.258    0.256    0.268    0.004   100.00   101.42    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.078        1    3.078    3.078    3.078    3.078        .   120.14   124.16        .
  base                     2.479        1    2.479    2.479    2.479    2.479        .    96.76   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.562        1    2.562    2.562    2.562    2.562        .   100.00   103.35        .
  total                    2.562        1    2.562    2.562    2.562    2.562        .   100.00   103.35    0.083
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.641     1000    0.000    0.002    0.002    0.003    0.001   142.20   492.79        .
  base                     0.333     1000    0.000    0.000    0.000    0.003    0.000    28.86   100.00        .
  init                     0.071     1000    0.000    0.000    0.000    0.001    0.000     6.15    21.32        .
  parse                    0.693     1000    0.000    0.001    0.001    0.002    0.000    60.05   208.11        .
  check                    0.004     1000    0.000    0.000    0.000    0.001    0.000     0.35     1.20        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.362     1000    0.000    0.000    0.000    0.003    0.000    31.37   108.71        .
  total                    1.154     1000    0.001    0.001    0.001    0.003    0.000   100.00   346.55    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.571     1000    0.002    0.004    0.004    0.005    0.001    89.61   124.56        .
  base                     2.867     1000    0.002    0.003    0.003    0.007    0.001    71.94   100.00        .
  init                     0.101     1000    0.000    0.000    0.000    0.001    0.000     2.53     3.52        .
  parse                    0.681     1000    0.000    0.001    0.001    0.002    0.000    17.09    23.75        .
  check                    0.005     1000    0.000    0.000    0.000    0.001    0.000     0.13     0.17        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     3.180     1000    0.002    0.003    0.003    0.005    0.000    79.80   110.92        .
  total                    3.985     1000    0.003    0.004    0.004    0.006    0.000   100.00   139.00    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.827      100    0.017    0.018    0.018    0.022    0.001    28.02    29.82        .
  base                     6.126      100    0.059    0.061    0.061    0.070    0.002    93.96   100.00        .
  init                     0.009      100    0.000    0.000    0.000    0.001    0.000     0.14     0.15        .
  parse                    0.068      100    0.000    0.001    0.001    0.001    0.000     1.04     1.11        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     6.439      100    0.062    0.064    0.064    0.075    0.002    98.76   105.11        .
  total                    6.520      100    0.063    0.065    0.065    0.076    0.002   100.00   106.43    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.939       10    0.188    0.194    0.192    0.201    0.005    72.32    74.41        .
  base                     2.606       10    0.258    0.261    0.260    0.267    0.003    97.20   100.00        .
  init                     0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  parse                    0.007       10    0.000    0.001    0.001    0.001    0.000     0.26     0.27        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.674       10    0.263    0.267    0.268    0.271    0.002    99.74   102.61        .
  total                    2.681       10    0.264    0.268    0.269    0.272    0.003   100.00   102.88    0.008
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.081        1    3.081    3.081    3.081    3.081        .   116.75   120.78        .
  base                     2.551        1    2.551    2.551    2.551    2.551        .    96.67   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.638        1    2.638    2.638    2.638    2.638        .    99.96   103.41        .
  total                    2.639        1    2.639    2.639    2.639    2.639        .   100.00   103.45    0.088
-------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.003     1000    0.001    0.002    0.002    0.003    0.000   198.51  1082.70        .
  base                     0.185     1000    0.000    0.000    0.000    0.001    0.000    18.33   100.00        .
  init                     0.078     1000    0.000    0.000    0.000    0.001    0.000     7.73    42.16        .
  parse                    0.705     1000    0.000    0.001    0.001    0.002    0.000    69.87   381.08        .
  check                    0.001     1000    0.000    0.000    0.000    0.001    0.000     0.10     0.54        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.202     1000    0.000    0.000    0.000    0.001    0.000    20.02   109.19        .
  total                    1.009     1000    0.000    0.001    0.001    0.003    0.000   100.00   545.41    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.201     1000    0.007    0.008    0.008    0.012    0.001   344.44   528.07        .
  base                     1.553     1000    0.001    0.002    0.002    0.004    0.001    65.22   100.00        .
  init                     0.080     1000    0.000    0.000    0.000    0.001    0.000     3.36     5.15        .
  parse                    0.714     1000    0.000    0.001    0.001    0.002    0.000    29.99    45.98        .
  check                    0.004     1000    0.000    0.000    0.000    0.001    0.000     0.17     0.26        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     1.556     1000    0.001    0.002    0.002    0.003    0.001    65.35   100.19        .
  total                    2.381     1000    0.002    0.002    0.002    0.004    0.001   100.00   153.32    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.404      100    0.062    0.064    0.064    0.069    0.001   405.32   433.29        .
  base                     1.478      100    0.014    0.015    0.015    0.018    0.001    93.54   100.00        .
  init                     0.009      100    0.000    0.000    0.000    0.001    0.000     0.57     0.61        .
  parse                    0.070      100    0.000    0.001    0.001    0.001    0.000     4.43     4.74        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     1.500      100    0.014    0.015    0.015    0.017    0.001    94.94   101.49        .
  total                    1.580      100    0.015    0.016    0.016    0.017    0.001   100.00   106.90    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.013       10    0.692    0.701    0.699    0.711    0.006   457.17   462.90        .
  base                     1.515       10    0.147    0.151    0.149    0.159    0.004    98.76   100.00        .
  init                     0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  parse                    0.006       10    0.000    0.001    0.001    0.001    0.001     0.39     0.40        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     1.527       10    0.151    0.153    0.152    0.157    0.002    99.54   100.79        .
  total                    1.534       10    0.151    0.153    0.153    0.157    0.002   100.00   101.25    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.230        1    8.230    8.230    8.230    8.230        .   539.67   551.61        .
  base                     1.492        1    1.492    1.492    1.492    1.492        .    97.84   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     1.525        1    1.525    1.525    1.525    1.525        .   100.00   102.21        .
  total                    1.525        1    1.525    1.525    1.525    1.525        .   100.00   102.21    0.033
-------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  29 Sep 2024, 23:22:34
-----------------------------------------------------------------------------------------------------------------------------------------------------
