----------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  25 Feb 2025, 12:49:39

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.761     1000    0.000    0.001    0.001    0.002    0.000    28.10   260.62        .
  base                     0.292     1000    0.000    0.000    0.000    0.001    0.000    10.78   100.00        .
  init                     0.540     1000    0.000    0.001    0.001    0.004    0.001    19.94   184.93        .
  parse                    0.489     1000    0.000    0.000    0.000    0.002    0.001    18.06   167.47        .
  check                    1.290     1000    0.001    0.001    0.001    0.007    0.000    47.64   441.78        .
  - usefulness             0.662     1000    0.000    0.001    0.001    0.002    0.000    24.45   226.71        .
    - is_useful() 1        0.555     1000    0.000    0.001    0.001    0.002    0.001    20.49   190.07        .
  - combine                0.046     1000    0.000    0.000    0.000    0.001    0.000     1.70    15.75        .
  - exhaustiveness         0.525     1000    0.000    0.001    0.001    0.006    0.001    19.39   179.79        .
    - is_useful() 2        0.502     1000    0.000    0.001    0.000    0.006    0.001    18.54   171.92        .
  - compress               0.009     1000    0.000    0.000    0.000    0.001    0.000     0.33     3.08        .
  - print                  0.020     1000    0.000    0.000    0.000    0.001    0.000     0.74     6.85        .
  + Overlap()              0.470     1000    0.000    0.000    0.000    0.006    0.001    17.36   160.96        .
  + Difference()           0.272     1000    0.000    0.000    0.000    0.002    0.000    10.04    93.15        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.368     1000    0.000    0.000    0.000    0.006    0.001    13.59   126.03        .
  total                    2.708     1000    0.002    0.003    0.003    0.013    0.001   100.00   927.40    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.085     1000    0.001    0.002    0.002    0.006    0.000    37.45    77.14        .
  base                     2.703     1000    0.002    0.003    0.003    0.006    0.001    48.55   100.00        .
  init                     0.885     1000    0.000    0.001    0.001    0.002    0.000    15.90    32.74        .
  parse                    0.526     1000    0.000    0.001    0.001    0.002    0.001     9.45    19.46        .
  check                    1.292     1000    0.001    0.001    0.001    0.003    0.000    23.21    47.80        .
  - usefulness             0.638     1000    0.000    0.001    0.001    0.001    0.000    11.46    23.60        .
    - is_useful() 1        0.545     1000    0.000    0.001    0.001    0.001    0.000     9.79    20.16        .
  - combine                0.061     1000    0.000    0.000    0.000    0.001    0.000     1.10     2.26        .
  - exhaustiveness         0.521     1000    0.000    0.001    0.001    0.001    0.000     9.36    19.27        .
    - is_useful() 2        0.495     1000    0.000    0.000    0.000    0.001    0.001     8.89    18.31        .
  - compress               0.003     1000    0.000    0.000    0.000    0.001    0.000     0.05     0.11        .
  - print                  0.033     1000    0.000    0.000    0.000    0.001    0.000     0.59     1.22        .
  + Overlap()              0.489     1000    0.000    0.000    0.000    0.002    0.001     8.78    18.09        .
  + Difference()           0.251     1000    0.000    0.000    0.000    0.001    0.000     4.51     9.29        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.832     1000    0.002    0.003    0.003    0.007    0.001    50.87   104.77        .
  total                    5.567     1000    0.005    0.006    0.005    0.011    0.001   100.00   205.96    0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.581      100    0.013    0.016    0.016    0.022    0.002    39.42    48.54        .
  base                     3.257      100    0.029    0.033    0.032    0.046    0.003    81.20   100.00        .
  init                     0.561      100    0.005    0.006    0.006    0.008    0.001    13.99    17.22        .
  parse                    0.058      100    0.000    0.001    0.001    0.001    0.000     1.45     1.78        .
  check                    0.125      100    0.001    0.001    0.001    0.003    0.000     3.12     3.84        .
  - usefulness             0.058      100    0.000    0.001    0.001    0.001    0.000     1.45     1.78        .
    - is_useful() 1        0.043      100    0.000    0.000    0.000    0.001    0.000     1.07     1.32        .
  - combine                0.007      100    0.000    0.000    0.000    0.001    0.000     0.17     0.21        .
  - exhaustiveness         0.049      100    0.000    0.000    0.000    0.001    0.001     1.22     1.50        .
    - is_useful() 2        0.047      100    0.000    0.000    0.000    0.001    0.001     1.17     1.44        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.02     0.03        .
  - print                  0.003      100    0.000    0.000    0.000    0.001    0.000     0.07     0.09        .
  + Overlap()              0.038      100    0.000    0.000    0.000    0.002    0.001     0.95     1.17        .
  + Difference()           0.028      100    0.000    0.000    0.000    0.001    0.000     0.70     0.86        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.261      100    0.029    0.033    0.032    0.041    0.002    81.30   100.12        .
  total                    4.011      100    0.036    0.040    0.039    0.049    0.002   100.00   123.15    0.008
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.155       10    0.187    0.215    0.215    0.242    0.015    69.70    84.41        .
  base                     2.553       10    0.248    0.255    0.254    0.262    0.005    82.57   100.00        .
  init                     0.453       10    0.044    0.045    0.045    0.047    0.001    14.65    17.74        .
  parse                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.26     0.31        .
  check                    0.013       10    0.001    0.001    0.001    0.002    0.000     0.42     0.51        .
  - usefulness             0.006       10    0.000    0.001    0.001    0.001    0.001     0.19     0.24        .
    - is_useful() 1        0.003       10    0.000    0.000    0.000    0.001    0.000     0.10     0.12        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.007       10    0.000    0.001    0.001    0.001    0.000     0.23     0.27        .
    - is_useful() 2        0.007       10    0.000    0.001    0.001    0.001    0.000     0.23     0.27        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.006       10    0.000    0.001    0.000    0.002    0.001     0.19     0.24        .
  + Difference()           0.002       10    0.000    0.000    0.000    0.001    0.000     0.06     0.08        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.617       10    0.251    0.262    0.260    0.269    0.006    84.64   102.51        .
  total                    3.092       10    0.301    0.309    0.308    0.317    0.005   100.00   121.11    0.054
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.368        1    3.368    3.368    3.368    3.368        .   110.14   130.19        .
  base                     2.587        1    2.587    2.587    2.587    2.587        .    84.60   100.00        .
  init                     0.446        1    0.446    0.446    0.446    0.446        .    14.58    17.24        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
    - is_useful() 1        0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
    - is_useful() 2        0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.611        1    2.611    2.611    2.611    2.611        .    85.38   100.93        .
  total                    3.058        1    3.058    3.058    3.058    3.058        .   100.00   118.21    0.471
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.729     1000    0.000    0.001    0.001    0.002    0.000    24.69   241.39        .
  base                     0.302     1000    0.000    0.000    0.000    0.001    0.000    10.23   100.00        .
  init                     0.796     1000    0.000    0.001    0.001    0.002    0.000    26.96   263.58        .
  parse                    0.499     1000    0.000    0.000    0.000    0.002    0.001    16.90   165.23        .
  check                    1.277     1000    0.001    0.001    0.001    0.003    0.000    43.24   422.85        .
  - usefulness             0.641     1000    0.000    0.001    0.001    0.002    0.000    21.71   212.25        .
    - is_useful() 1        0.536     1000    0.000    0.001    0.001    0.002    0.001    18.15   177.48        .
  - combine                0.049     1000    0.000    0.000    0.000    0.001    0.000     1.66    16.23        .
  - exhaustiveness         0.538     1000    0.000    0.001    0.001    0.002    0.001    18.22   178.15        .
    - is_useful() 2        0.508     1000    0.000    0.001    0.001    0.002    0.001    17.20   168.21        .
  - compress               0.003     1000    0.000    0.000    0.000    0.001    0.000     0.10     0.99        .
  - print                  0.015     1000    0.000    0.000    0.000    0.001    0.000     0.51     4.97        .
  + Overlap()              0.496     1000    0.000    0.000    0.000    0.002    0.001    16.80   164.24        .
  + Difference()           0.260     1000    0.000    0.000    0.000    0.002    0.000     8.80    86.09        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.358     1000    0.000    0.000    0.000    0.001    0.000    12.12   118.54        .
  total                    2.953     1000    0.002    0.003    0.003    0.005    0.000   100.00   977.81    0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.132     1000    0.001    0.002    0.002    0.004    0.000    25.06    75.66        .
  base                     2.818     1000    0.002    0.003    0.003    0.006    0.001    33.12   100.00        .
  init                     3.619     1000    0.003    0.004    0.004    0.007    0.001    42.54   128.42        .
  parse                    0.544     1000    0.000    0.001    0.001    0.002    0.001     6.39    19.30        .
  check                    1.280     1000    0.001    0.001    0.001    0.003    0.000    15.04    45.42        .
  - usefulness             0.627     1000    0.000    0.001    0.001    0.002    0.000     7.37    22.25        .
    - is_useful() 1        0.541     1000    0.000    0.001    0.001    0.002    0.001     6.36    19.20        .
  - combine                0.053     1000    0.000    0.000    0.000    0.001    0.000     0.62     1.88        .
  - exhaustiveness         0.543     1000    0.000    0.001    0.001    0.001    0.000     6.38    19.27        .
    - is_useful() 2        0.514     1000    0.000    0.001    0.001    0.001    0.001     6.04    18.24        .
  - compress               0.003     1000    0.000    0.000    0.000    0.001    0.000     0.04     0.11        .
  - print                  0.021     1000    0.000    0.000    0.000    0.001    0.000     0.25     0.75        .
  + Overlap()              0.493     1000    0.000    0.000    0.000    0.002    0.001     5.79    17.49        .
  + Difference()           0.285     1000    0.000    0.000    0.000    0.001    0.000     3.35    10.11        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.027     1000    0.002    0.003    0.003    0.006    0.001    35.58   107.42        .
  total                    8.508     1000    0.008    0.009    0.008    0.013    0.001   100.00   301.92    0.006
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.770      100    0.015    0.018    0.017    0.024    0.002    12.18    26.85        .
  base                     6.592      100    0.061    0.066    0.065    0.079    0.004    45.36   100.00        .
  init                     7.549      100    0.066    0.075    0.074    0.099    0.006    51.94   114.52        .
  parse                    0.062      100    0.000    0.001    0.001    0.001    0.000     0.43     0.94        .
  check                    0.145      100    0.001    0.001    0.001    0.004    0.001     1.00     2.20        .
  - usefulness             0.071      100    0.000    0.001    0.001    0.002    0.001     0.49     1.08        .
    - is_useful() 1        0.056      100    0.000    0.001    0.001    0.002    0.001     0.39     0.85        .
  - combine                0.005      100    0.000    0.000    0.000    0.001    0.000     0.03     0.08        .
  - exhaustiveness         0.062      100    0.000    0.001    0.001    0.002    0.001     0.43     0.94        .
    - is_useful() 2        0.060      100    0.000    0.001    0.001    0.002    0.001     0.41     0.91        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.02        .
  + Overlap()              0.060      100    0.000    0.001    0.000    0.003    0.001     0.41     0.91        .
  + Difference()           0.026      100    0.000    0.000    0.000    0.001    0.000     0.18     0.39        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     6.775      100    0.063    0.068    0.067    0.086    0.004    46.62   102.78        .
  total                   14.533      100    0.133    0.145    0.144    0.180    0.008   100.00   220.46    0.079
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.280       10    0.206    0.228    0.221    0.305    0.028    34.92    83.70        .
  base                     2.724       10    0.257    0.272    0.267    0.299    0.013    41.72   100.00        .
  init                     3.830       10    0.363    0.383    0.371    0.425    0.020    58.65   140.60        .
  parse                    0.009       10    0.000    0.001    0.001    0.001    0.000     0.14     0.33        .
  check                    0.013       10    0.001    0.001    0.001    0.003    0.001     0.20     0.48        .
  - usefulness             0.006       10    0.000    0.001    0.001    0.001    0.001     0.09     0.22        .
    - is_useful() 1        0.006       10    0.000    0.001    0.001    0.001    0.001     0.09     0.22        .
  - combine                0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.04        .
  - exhaustiveness         0.006       10    0.000    0.001    0.001    0.001    0.001     0.09     0.22        .
    - is_useful() 2        0.006       10    0.000    0.001    0.001    0.001    0.001     0.09     0.22        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.006       10    0.000    0.001    0.001    0.001    0.001     0.09     0.22        .
  + Difference()           0.003       10    0.000    0.000    0.000    0.001    0.000     0.05     0.11        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.678       10    0.254    0.268    0.263    0.282    0.009    41.01    98.31        .
  total                    6.530       10    0.626    0.653    0.644    0.689    0.022   100.00   239.72    0.381
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.351        1    3.351    3.351    3.351    3.351        .    53.04   130.39        .
  base                     2.570        1    2.570    2.570    2.570    2.570        .    40.68   100.00        .
  init                     3.686        1    3.686    3.686    3.686    3.686        .    58.34   143.42        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.08        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
    - is_useful() 1        0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
    - is_useful() 2        0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.630        1    2.630    2.630    2.630    2.630        .    41.63   102.33        .
  total                    6.318        1    6.318    6.318    6.318    6.318        .   100.00   245.84    3.748
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.247     1000    0.000    0.001    0.001    0.004    0.000    65.70   712.57        .
  base                     0.175     1000    0.000    0.000    0.000    0.001    0.000     9.22   100.00        .
  init                     0.580     1000    0.000    0.001    0.001    0.002    0.001    30.56   331.43        .
  parse                    0.353     1000    0.000    0.000    0.000    0.003    0.000    18.60   201.71        .
  check                    0.738     1000    0.000    0.001    0.001    0.003    0.000    38.88   421.71        .
  - usefulness             0.275     1000    0.000    0.000    0.000    0.001    0.000    14.49   157.14        .
    - is_useful() 1        0.224     1000    0.000    0.000    0.000    0.001    0.000    11.80   128.00        .
  - combine                0.019     1000    0.000    0.000    0.000    0.001    0.000     1.00    10.86        .
  - exhaustiveness         0.388     1000    0.000    0.000    0.000    0.002    0.000    20.44   221.71        .
    - is_useful() 2        0.367     1000    0.000    0.000    0.000    0.002    0.000    19.34   209.71        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.26     2.86        .
  - print                  0.009     1000    0.000    0.000    0.000    0.001    0.000     0.47     5.14        .
  + Overlap()              0.231     1000    0.000    0.000    0.000    0.001    0.000    12.17   132.00        .
  + Difference()           0.226     1000    0.000    0.000    0.000    0.002    0.000    11.91   129.14        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.209     1000    0.000    0.000    0.000    0.001    0.000    11.01   119.43        .
  total                    1.898     1000    0.001    0.002    0.002    0.006    0.000   100.00  1084.57    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.069     1000    0.006    0.007    0.007    0.012    0.001    95.14   458.43        .
  base                     1.542     1000    0.001    0.002    0.002    0.004    0.001    20.75   100.00        .
  init                     4.742     1000    0.004    0.005    0.005    0.008    0.001    63.82   307.52        .
  parse                    0.399     1000    0.000    0.000    0.000    0.001    0.000     5.37    25.88        .
  check                    0.694     1000    0.000    0.001    0.001    0.002    0.000     9.34    45.01        .
  - usefulness             0.231     1000    0.000    0.000    0.000    0.001    0.000     3.11    14.98        .
    - is_useful() 1        0.182     1000    0.000    0.000    0.000    0.001    0.000     2.45    11.80        .
  - combine                0.019     1000    0.000    0.000    0.000    0.001    0.000     0.26     1.23        .
  - exhaustiveness         0.385     1000    0.000    0.000    0.000    0.001    0.000     5.18    24.97        .
    - is_useful() 2        0.358     1000    0.000    0.000    0.000    0.001    0.000     4.82    23.22        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.07     0.32        .
  - print                  0.018     1000    0.000    0.000    0.000    0.001    0.000     0.24     1.17        .
  + Overlap()              0.188     1000    0.000    0.000    0.000    0.002    0.000     2.53    12.19        .
  + Difference()           0.227     1000    0.000    0.000    0.000    0.001    0.000     3.06    14.72        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.564     1000    0.001    0.002    0.002    0.003    0.001    21.05   101.43        .
  total                    7.430     1000    0.007    0.007    0.007    0.014    0.001   100.00   481.84    0.006
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.442      100    0.061    0.064    0.063    0.078    0.003    87.24   430.61        .
  base                     1.496      100    0.014    0.015    0.015    0.018    0.001    20.26   100.00        .
  init                     5.728      100    0.054    0.057    0.057    0.070    0.003    77.57   382.89        .
  parse                    0.037      100    0.000    0.000    0.000    0.001    0.000     0.50     2.47        .
  check                    0.076      100    0.000    0.001    0.001    0.002    0.000     1.03     5.08        .
  - usefulness             0.027      100    0.000    0.000    0.000    0.001    0.000     0.37     1.80        .
    - is_useful() 1        0.020      100    0.000    0.000    0.000    0.001    0.000     0.27     1.34        .
  - combine                0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.07        .
  - exhaustiveness         0.041      100    0.000    0.000    0.000    0.001    0.000     0.56     2.74        .
    - is_useful() 2        0.040      100    0.000    0.000    0.000    0.001    0.000     0.54     2.67        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.07        .
  - print                  0.002      100    0.000    0.000    0.000    0.001    0.000     0.03     0.13        .
  + Overlap()              0.024      100    0.000    0.000    0.000    0.001    0.000     0.33     1.60        .
  + Difference()           0.028      100    0.000    0.000    0.000    0.001    0.000     0.38     1.87        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.540      100    0.014    0.015    0.015    0.024    0.001    20.86   102.94        .
  total                    7.384      100    0.069    0.074    0.073    0.087    0.004   100.00   493.58    0.059
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.193       10    0.685    0.719    0.697    0.760    0.030   113.33   473.22        .
  base                     1.520       10    0.146    0.152    0.150    0.160    0.004    23.95   100.00        .
  init                     4.775       10    0.460    0.478    0.476    0.507    0.014    75.23   314.14        .
  parse                    0.004       10    0.000    0.000    0.000    0.001    0.001     0.06     0.26        .
  check                    0.007       10    0.000    0.001    0.001    0.001    0.000     0.11     0.46        .
  - usefulness             0.005       10    0.000    0.001    0.000    0.001    0.001     0.08     0.33        .
    - is_useful() 1        0.005       10    0.000    0.001    0.000    0.001    0.001     0.08     0.33        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.002       10    0.000    0.000    0.000    0.001    0.000     0.03     0.13        .
    - is_useful() 2        0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.07        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.002       10    0.000    0.000    0.000    0.001    0.000     0.03     0.13        .
  + Difference()           0.002       10    0.000    0.000    0.000    0.001    0.000     0.03     0.13        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.561       10    0.148    0.156    0.153    0.171    0.008    24.59   102.70        .
  total                    6.347       10    0.609    0.635    0.633    0.665    0.015   100.00   417.57    0.483
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.708        1    8.708    8.708    8.708    8.708        .   132.14   546.30        .
  base                     1.594        1    1.594    1.594    1.594    1.594        .    24.19   100.00        .
  init                     4.971        1    4.971    4.971    4.971    4.971        .    75.43   311.86        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
  check                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
    - is_useful() 1        0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
    - is_useful() 2        0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.617        1    1.617    1.617    1.617    1.617        .    24.54   101.44        .
  total                    6.590        1    6.590    6.590    6.590    6.590        .   100.00   413.43    4.996
-------------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.083      100    0.000    0.001    0.001    0.003    0.000     1.55    63.85        .
  base                     0.130      100    0.001    0.001    0.001    0.003    0.000     2.42   100.00        .
  init                     0.060      100    0.000    0.001    0.001    0.002    0.001     1.12    46.15        .
  parse                    0.224      100    0.002    0.002    0.002    0.005    0.001     4.18   172.31        .
  check                    4.913      100    0.046    0.049    0.047    0.064    0.004    91.64  3779.23        .
  - usefulness             2.294      100    0.021    0.023    0.022    0.032    0.002    42.79  1764.62        .
    - is_useful() 1        2.159      100    0.017    0.022    0.022    0.029    0.002    40.27  1660.77        .
  - combine                0.092      100    0.000    0.001    0.001    0.002    0.000     1.72    70.77        .
  - exhaustiveness         2.508      100    0.023    0.025    0.024    0.040    0.003    46.78  1929.23        .
    - is_useful() 2        2.500      100    0.023    0.025    0.024    0.040    0.003    46.63  1923.08        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.02     0.77        .
  - print                  0.011      100    0.000    0.000    0.000    0.001    0.000     0.21     8.46        .
  + Overlap()              2.109      100    0.013    0.021    0.021    0.028    0.003    39.34  1622.31        .
  + Difference()           1.851      100    0.012    0.019    0.018    0.033    0.003    34.53  1423.85        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.158      100    0.001    0.002    0.002    0.003    0.001     2.95   121.54        .
  total                    5.361      100    0.050    0.054    0.052    0.068    0.004   100.00  4123.85    0.052
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.198      100    0.001    0.002    0.002    0.003    0.000     3.06    17.63        .
  base                     1.123      100    0.010    0.011    0.011    0.022    0.002    17.35   100.00        .
  init                     0.173      100    0.001    0.002    0.002    0.003    0.001     2.67    15.41        .
  parse                    0.223      100    0.002    0.002    0.002    0.004    0.000     3.45    19.86        .
  check                    4.905      100    0.046    0.049    0.047    0.067    0.004    75.79   436.78        .
  - usefulness             2.323      100    0.021    0.023    0.022    0.034    0.003    35.89   206.86        .
    - is_useful() 1        2.214      100    0.019    0.022    0.021    0.033    0.003    34.21   197.15        .
  - combine                0.088      100    0.000    0.001    0.001    0.002    0.000     1.36     7.84        .
  - exhaustiveness         2.476      100    0.023    0.025    0.024    0.035    0.002    38.26   220.48        .
    - is_useful() 2        2.463      100    0.022    0.025    0.024    0.035    0.002    38.06   219.32        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.009      100    0.000    0.000    0.000    0.001    0.000     0.14     0.80        .
  + Overlap()              2.119      100    0.013    0.021    0.021    0.029    0.003    32.74   188.69        .
  + Difference()           1.834      100    0.012    0.018    0.018    0.030    0.003    28.34   163.31        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.167      100    0.010    0.012    0.011    0.022    0.002    18.03   103.92        .
  total                    6.472      100    0.060    0.065    0.062    0.083    0.005   100.00   576.31    0.053
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.124       10    0.011    0.012    0.012    0.014    0.001     6.82    10.77        .
  base                     1.151       10    0.105    0.115    0.109    0.141    0.012    63.31   100.00        .
  init                     0.135       10    0.012    0.014    0.013    0.018    0.002     7.43    11.73        .
  parse                    0.023       10    0.002    0.002    0.002    0.004    0.001     1.27     2.00        .
  check                    0.512       10    0.047    0.051    0.050    0.060    0.004    28.16    44.48        .
  - usefulness             0.252       10    0.022    0.025    0.024    0.036    0.004    13.86    21.89        .
    - is_useful() 1        0.227       10    0.019    0.023    0.022    0.034    0.004    12.49    19.72        .
  - combine                0.009       10    0.000    0.001    0.001    0.001    0.000     0.50     0.78        .
  - exhaustiveness         0.248       10    0.023    0.025    0.024    0.028    0.002    13.64    21.55        .
    - is_useful() 2        0.247       10    0.023    0.025    0.024    0.028    0.002    13.59    21.46        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.002       10    0.000    0.000    0.000    0.001    0.000     0.11     0.17        .
  + Overlap()              0.219       10    0.015    0.022    0.020    0.028    0.004    12.05    19.03        .
  + Difference()           0.177       10    0.013    0.018    0.016    0.024    0.003     9.74    15.38        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.148       10    0.106    0.115    0.114    0.125    0.007    63.15    99.74        .
  total                    1.818       10    0.170    0.182    0.177    0.203    0.011   100.00   157.95    0.067
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.234        1    0.234    0.234    0.234    0.234        .    18.14    20.69        .
  base                     1.131        1    1.131    1.131    1.131    1.131        .    87.67   100.00        .
  init                     0.134        1    0.134    0.134    0.134    0.134        .    10.39    11.85        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.16     0.18        .
  check                    0.047        1    0.047    0.047    0.047    0.047        .     3.64     4.16        .
  - usefulness             0.022        1    0.022    0.022    0.022    0.022        .     1.71     1.95        .
    - is_useful() 1        0.022        1    0.022    0.022    0.022    0.022        .     1.71     1.95        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.08     0.09        .
  - exhaustiveness         0.023        1    0.023    0.023    0.023    0.023        .     1.78     2.03        .
    - is_useful() 2        0.023        1    0.023    0.023    0.023    0.023        .     1.78     2.03        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.08     0.09        .
  + Overlap()              0.016        1    0.016    0.016    0.016    0.016        .     1.24     1.41        .
  + Difference()           0.020        1    0.020    0.020    0.020    0.020        .     1.55     1.77        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.107        1    1.107    1.107    1.107    1.107        .    85.81    97.88        .
  total                    1.290        1    1.290    1.290    1.290    1.290        .   100.00   114.06    0.159
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.312        1    3.312    3.312    3.312    3.312        .    26.38    29.68        .
  base                    11.160        1   11.160   11.160   11.160   11.160        .    88.88   100.00        .
  init                     1.288        1    1.288    1.288    1.288    1.288        .    10.26    11.54        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check                    0.047        1    0.047    0.047    0.047    0.047        .     0.37     0.42        .
  - usefulness             0.022        1    0.022    0.022    0.022    0.022        .     0.18     0.20        .
    - is_useful() 1        0.021        1    0.021    0.021    0.021    0.021        .     0.17     0.19        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.023        1    0.023    0.023    0.023    0.023        .     0.18     0.21        .
    - is_useful() 2        0.023        1    0.023    0.023    0.023    0.023        .     0.18     0.21        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.020        1    0.020    0.020    0.020    0.020        .     0.16     0.18        .
  + Difference()           0.015        1    0.015    0.015    0.015    0.015        .     0.12     0.13        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    11.218        1   11.218   11.218   11.218   11.218        .    89.34   100.52        .
  total                   12.556        1   12.556   12.556   12.556   12.556        .   100.00   112.51    1.396
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.083      100    0.000    0.001    0.001    0.002    0.000     1.54    67.48        .
  base                     0.123      100    0.001    0.001    0.001    0.002    0.000     2.28   100.00        .
  init                     0.091      100    0.000    0.001    0.001    0.002    0.000     1.69    73.98        .
  parse                    0.216      100    0.002    0.002    0.002    0.004    0.000     4.01   175.61        .
  check                    4.914      100    0.045    0.049    0.047    0.064    0.004    91.17  3995.12        .
  - usefulness             2.310      100    0.021    0.023    0.022    0.032    0.002    42.86  1878.05        .
    - is_useful() 1        2.192      100    0.017    0.022    0.022    0.031    0.002    40.67  1782.11        .
  - combine                0.095      100    0.000    0.001    0.001    0.002    0.000     1.76    77.24        .
  - exhaustiveness         2.491      100    0.023    0.025    0.024    0.039    0.003    46.22  2025.20        .
    - is_useful() 2        2.481      100    0.023    0.025    0.024    0.039    0.003    46.03  2017.07        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.009      100    0.000    0.000    0.000    0.001    0.000     0.17     7.32        .
  + Overlap()              2.150      100    0.013    0.022    0.021    0.032    0.003    39.89  1747.97        .
  + Difference()           1.834      100    0.013    0.018    0.018    0.028    0.003    34.03  1491.06        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.167      100    0.001    0.002    0.002    0.004    0.001     3.10   135.77        .
  total                    5.390      100    0.050    0.054    0.052    0.067    0.004   100.00  4382.11    0.053
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.235      100    0.002    0.002    0.002    0.004    0.001     3.43    19.65        .
  base                     1.196      100    0.010    0.012    0.012    0.020    0.002    17.45   100.00        .
  init                     0.366      100    0.003    0.004    0.004    0.006    0.001     5.34    30.60        .
  parse                    0.231      100    0.002    0.002    0.002    0.004    0.001     3.37    19.31        .
  check                    4.885      100    0.046    0.049    0.048    0.058    0.003    71.29   408.44        .
  - usefulness             2.298      100    0.021    0.023    0.022    0.032    0.002    33.54   192.14        .
    - is_useful() 1        2.156      100    0.018    0.022    0.021    0.030    0.002    31.47   180.27        .
  - combine                0.086      100    0.000    0.001    0.001    0.002    0.000     1.26     7.19        .
  - exhaustiveness         2.476      100    0.023    0.025    0.024    0.033    0.002    36.14   207.02        .
    - is_useful() 2        2.463      100    0.023    0.025    0.024    0.033    0.002    35.95   205.94        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.08        .
  - print                  0.009      100    0.000    0.000    0.000    0.001    0.000     0.13     0.75        .
  + Overlap()              2.147      100    0.012    0.021    0.021    0.030    0.004    31.33   179.52        .
  + Difference()           1.778      100    0.011    0.018    0.018    0.023    0.002    25.95   148.66        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.364      100    0.012    0.014    0.013    0.024    0.002    19.91   114.05        .
  total                    6.852      100    0.064    0.069    0.067    0.081    0.003   100.00   572.91    0.057
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.183       10    0.016    0.018    0.018    0.020    0.001     4.21     5.97        .
  base                     3.064       10    0.297    0.306    0.300    0.327    0.011    70.57   100.00        .
  init                     0.691       10    0.065    0.069    0.067    0.085    0.006    15.91    22.55        .
  parse                    0.023       10    0.002    0.002    0.002    0.004    0.001     0.53     0.75        .
  check                    0.487       10    0.046    0.049    0.047    0.055    0.003    11.22    15.89        .
  - usefulness             0.223       10    0.022    0.022    0.022    0.024    0.001     5.14     7.28        .
    - is_useful() 1        0.216       10    0.020    0.022    0.022    0.023    0.001     4.97     7.05        .
  - combine                0.010       10    0.001    0.001    0.001    0.001    0.000     0.23     0.33        .
  - exhaustiveness         0.251       10    0.023    0.025    0.024    0.030    0.003     5.78     8.19        .
    - is_useful() 2        0.251       10    0.023    0.025    0.024    0.030    0.003     5.78     8.19        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.03        .
  + Overlap()              0.226       10    0.020    0.023    0.022    0.026    0.002     5.20     7.38        .
  + Difference()           0.180       10    0.014    0.018    0.018    0.023    0.003     4.15     5.87        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.141       10    0.306    0.314    0.308    0.326    0.008    72.34   102.51        .
  total                    4.342       10    0.420    0.434    0.425    0.467    0.014   100.00   141.71    0.128
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.251        1    0.251    0.251    0.251    0.251        .    15.93    21.60        .
  base                     1.162        1    1.162    1.162    1.162    1.162        .    73.73   100.00        .
  init                     0.367        1    0.367    0.367    0.367    0.367        .    23.29    31.58        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.13     0.17        .
  check                    0.062        1    0.062    0.062    0.062    0.062        .     3.93     5.34        .
  - usefulness             0.033        1    0.033    0.033    0.033    0.033        .     2.09     2.84        .
    - is_useful() 1        0.030        1    0.030    0.030    0.030    0.030        .     1.90     2.58        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.09        .
  - exhaustiveness         0.028        1    0.028    0.028    0.028    0.028        .     1.78     2.41        .
    - is_useful() 2        0.028        1    0.028    0.028    0.028    0.028        .     1.78     2.41        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.025        1    0.025    0.025    0.025    0.025        .     1.59     2.15        .
  + Difference()           0.025        1    0.025    0.025    0.025    0.025        .     1.59     2.15        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.145        1    1.145    1.145    1.145    1.145        .    72.65    98.54        .
  total                    1.576        1    1.576    1.576    1.576    1.576        .   100.00   135.63    0.414
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.238        1    3.238    3.238    3.238    3.238        .    22.08    28.66        .
  base                    11.297        1   11.297   11.297   11.297   11.297        .    77.04   100.00        .
  init                     3.334        1    3.334    3.334    3.334    3.334        .    22.74    29.51        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.02        .
  check                    0.047        1    0.047    0.047    0.047    0.047        .     0.32     0.42        .
  - usefulness             0.023        1    0.023    0.023    0.023    0.023        .     0.16     0.20        .
    - is_useful() 1        0.022        1    0.022    0.022    0.022    0.022        .     0.15     0.19        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.023        1    0.023    0.023    0.023    0.023        .     0.16     0.20        .
    - is_useful() 2        0.023        1    0.023    0.023    0.023    0.023        .     0.16     0.20        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.021        1    0.021    0.021    0.021    0.021        .     0.14     0.19        .
  + Difference()           0.017        1    0.017    0.017    0.017    0.017        .     0.12     0.15        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    11.281        1   11.281   11.281   11.281   11.281        .    76.93    99.86        .
  total                   14.664        1   14.664   14.664   14.664   14.664        .   100.00   129.80    3.367
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.137      100    0.001    0.001    0.001    0.002    0.000     3.07   119.13        .
  base                     0.115      100    0.001    0.001    0.001    0.003    0.000     2.57   100.00        .
  init                     0.066      100    0.000    0.001    0.001    0.001    0.000     1.48    57.39        .
  parse                    0.136      100    0.001    0.001    0.001    0.003    0.001     3.04   118.26        .
  check                    4.119      100    0.038    0.041    0.040    0.061    0.004    92.17  3581.74        .
  - usefulness             1.512      100    0.014    0.015    0.014    0.025    0.002    33.83  1314.78        .
    - is_useful() 1        1.463      100    0.012    0.015    0.014    0.025    0.002    32.74  1272.17        .
  - combine                0.045      100    0.000    0.000    0.000    0.001    0.000     1.01    39.13        .
  - exhaustiveness         2.551      100    0.024    0.026    0.025    0.047    0.003    57.08  2218.26        .
    - is_useful() 2        2.537      100    0.024    0.025    0.025    0.047    0.003    56.77  2206.09        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.008      100    0.000    0.000    0.000    0.001    0.000     0.18     6.96        .
  + Overlap()              1.830      100    0.014    0.018    0.018    0.029    0.003    40.95  1591.30        .
  + Difference()           1.720      100    0.013    0.017    0.017    0.026    0.002    38.49  1495.65        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.143      100    0.001    0.001    0.001    0.003    0.001     3.20   124.35        .
  total                    4.469      100    0.042    0.045    0.043    0.065    0.004   100.00  3886.09    0.044
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.750      100    0.006    0.007    0.007    0.011    0.001    12.71    74.48        .
  base                     1.007      100    0.009    0.010    0.010    0.018    0.001    17.06   100.00        .
  init                     0.528      100    0.004    0.005    0.005    0.009    0.001     8.94    52.43        .
  parse                    0.134      100    0.001    0.001    0.001    0.003    0.000     2.27    13.31        .
  check                    4.165      100    0.038    0.042    0.040    0.054    0.003    70.56   413.60        .
  - usefulness             1.527      100    0.014    0.015    0.015    0.024    0.002    25.87   151.64        .
    - is_useful() 1        1.469      100    0.012    0.015    0.014    0.022    0.002    24.89   145.88        .
  - combine                0.032      100    0.000    0.000    0.000    0.001    0.000     0.54     3.18        .
  - exhaustiveness         2.591      100    0.024    0.026    0.025    0.037    0.003    43.89   257.30        .
    - is_useful() 2        2.585      100    0.024    0.026    0.025    0.037    0.003    43.79   256.70        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.02     0.10        .
  - print                  0.008      100    0.000    0.000    0.000    0.001    0.000     0.14     0.79        .
  + Overlap()              1.869      100    0.013    0.019    0.018    0.033    0.003    31.66   185.60        .
  + Difference()           1.748      100    0.013    0.017    0.017    0.026    0.002    29.61   173.58        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.075      100    0.009    0.011    0.010    0.017    0.001    18.21   106.75        .
  total                    5.903      100    0.055    0.059    0.058    0.074    0.004   100.00   586.20    0.049
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.672       10    0.064    0.067    0.066    0.074    0.003    31.71    65.24        .
  base                     1.030       10    0.097    0.103    0.101    0.111    0.005    48.61   100.00        .
  init                     0.650       10    0.061    0.065    0.063    0.075    0.005    30.67    63.11        .
  parse                    0.014       10    0.001    0.001    0.001    0.003    0.001     0.66     1.36        .
  check                    0.415       10    0.039    0.041    0.039    0.050    0.004    19.58    40.29        .
  - usefulness             0.157       10    0.014    0.016    0.015    0.020    0.002     7.41    15.24        .
    - is_useful() 1        0.154       10    0.013    0.015    0.015    0.020    0.003     7.27    14.95        .
  - combine                0.005       10    0.000    0.001    0.000    0.001    0.001     0.24     0.49        .
  - exhaustiveness         0.253       10    0.024    0.025    0.024    0.034    0.003    11.94    24.56        .
    - is_useful() 2        0.252       10    0.024    0.025    0.024    0.034    0.003    11.89    24.47        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.195       10    0.016    0.020    0.019    0.026    0.003     9.20    18.93        .
  + Difference()           0.166       10    0.012    0.017    0.016    0.020    0.003     7.83    16.12        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.040       10    0.097    0.104    0.103    0.115    0.006    49.08   100.97        .
  total                    2.119       10    0.201    0.212    0.207    0.234    0.010   100.00   205.73    0.109
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.810        1    0.810    0.810    0.810    0.810        .    50.91    77.81        .
  base                     1.041        1    1.041    1.041    1.041    1.041        .    65.43   100.00        .
  init                     0.528        1    0.528    0.528    0.528    0.528        .    33.19    50.72        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.10        .
  check                    0.041        1    0.041    0.041    0.041    0.041        .     2.58     3.94        .
  - usefulness             0.015        1    0.015    0.015    0.015    0.015        .     0.94     1.44        .
    - is_useful() 1        0.015        1    0.015    0.015    0.015    0.015        .     0.94     1.44        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.025        1    0.025    0.025    0.025    0.025        .     1.57     2.40        .
    - is_useful() 2        0.025        1    0.025    0.025    0.025    0.025        .     1.57     2.40        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.10        .
  + Overlap()              0.019        1    0.019    0.019    0.019    0.019        .     1.19     1.83        .
  + Difference()           0.014        1    0.014    0.014    0.014    0.014        .     0.88     1.34        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.021        1    1.021    1.021    1.021    1.021        .    64.17    98.08        .
  total                    1.591        1    1.591    1.591    1.591    1.591        .   100.00   152.83    0.550
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.868        1    8.868    8.868    8.868    8.868        .    58.02    87.82        .
  base                    10.098        1   10.098   10.098   10.098   10.098        .    66.07   100.00        .
  init                     5.140        1    5.140    5.140    5.140    5.140        .    33.63    50.90        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  check                    0.050        1    0.050    0.050    0.050    0.050        .     0.33     0.50        .
  - usefulness             0.015        1    0.015    0.015    0.015    0.015        .     0.10     0.15        .
    - is_useful() 1        0.015        1    0.015    0.015    0.015    0.015        .     0.10     0.15        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.035        1    0.035    0.035    0.035    0.035        .     0.23     0.35        .
    - is_useful() 2        0.035        1    0.035    0.035    0.035    0.035        .     0.23     0.35        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.026        1    0.026    0.026    0.026    0.026        .     0.17     0.26        .
  + Difference()           0.018        1    0.018    0.018    0.018    0.018        .     0.12     0.18        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.093        1   10.093   10.093   10.093   10.093        .    66.04    99.95        .
  total                   15.284        1   15.284   15.284   15.284   15.284        .   100.00   151.36    5.186
-------------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.02    20.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.08   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.135        1    0.135    0.135    0.135    0.135        .     1.02  1350.00        .
  check                   13.113        1   13.113   13.113   13.113   13.113        .    98.88  1.3e+05        .
  - usefulness            10.213        1   10.213   10.213   10.213   10.213        .    77.01  1.0e+05        .
    - is_useful() 1        9.985        1    9.985    9.985    9.985    9.985        .    75.29 99850.00        .
  - combine                0.196        1    0.196    0.196    0.196    0.196        .     1.48  1960.00        .
  - exhaustiveness         2.702        1    2.702    2.702    2.702    2.702        .    20.37 27020.00        .
    - is_useful() 2        2.701        1    2.701    2.701    2.701    2.701        .    20.37 27010.00        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              5.980        1    5.980    5.980    5.980    5.980        .    45.09 59800.00        .
  + Difference()           2.029        1    2.029    2.029    2.029    2.029        .    15.30 20290.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.014        1    0.014    0.014    0.014    0.014        .     0.11   140.00        .
  total                   13.262        1   13.262   13.262   13.262   13.262        .   100.00  1.3e+05   13.252
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.02     2.02        .
  base                     0.099        1    0.099    0.099    0.099    0.099        .     0.78   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.02     2.02        .
  parse                    0.147        1    0.147    0.147    0.147    0.147        .     1.15   148.48        .
  check                   12.516        1   12.516   12.516   12.516   12.516        .    98.00 12642.42        .
  - usefulness             9.866        1    9.866    9.866    9.866    9.866        .    77.25  9965.66        .
    - is_useful() 1        9.651        1    9.651    9.651    9.651    9.651        .    75.57  9748.48        .
  - combine                0.130        1    0.130    0.130    0.130    0.130        .     1.02   131.31        .
  - exhaustiveness         2.518        1    2.518    2.518    2.518    2.518        .    19.72  2543.43        .
    - is_useful() 2        2.517        1    2.517    2.517    2.517    2.517        .    19.71  2542.42        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              5.765        1    5.765    5.765    5.765    5.765        .    45.14  5823.23        .
  + Difference()           1.880        1    1.880    1.880    1.880    1.880        .    14.72  1898.99        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.106        1    0.106    0.106    0.106    0.106        .     0.83   107.07        .
  total                   12.771        1   12.771   12.771   12.771   12.771        .   100.00 12900.00   12.672
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.016        1    0.016    0.016    0.016    0.016        .     0.12     1.55        .
  base                     1.032        1    1.032    1.032    1.032    1.032        .     7.47   100.00        .
  init                     0.014        1    0.014    0.014    0.014    0.014        .     0.10     1.36        .
  parse                    0.135        1    0.135    0.135    0.135    0.135        .     0.98    13.08        .
  check                   12.754        1   12.754   12.754   12.754   12.754        .    92.27  1235.85        .
  - usefulness            10.297        1   10.297   10.297   10.297   10.297        .    74.50   997.77        .
    - is_useful() 1       10.071        1   10.071   10.071   10.071   10.071        .    72.86   975.87        .
  - combine                0.120        1    0.120    0.120    0.120    0.120        .     0.87    11.63        .
  - exhaustiveness         2.334        1    2.334    2.334    2.334    2.334        .    16.89   226.16        .
    - is_useful() 2        2.333        1    2.333    2.333    2.333    2.333        .    16.88   226.07        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.10        .
  + Overlap()              5.969        1    5.969    5.969    5.969    5.969        .    43.18   578.39        .
  + Difference()           1.854        1    1.854    1.854    1.854    1.854        .    13.41   179.65        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.919        1    0.919    0.919    0.919    0.919        .     6.65    89.05        .
  total                   13.822        1   13.822   13.822   13.822   13.822        .   100.00  1339.34   12.790
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.218        1    0.218    0.218    0.218    0.218        .     1.01     2.25        .
  base                     9.688        1    9.688    9.688    9.688    9.688        .    44.70   100.00        .
  init                     0.123        1    0.123    0.123    0.123    0.123        .     0.57     1.27        .
  parse                    0.127        1    0.127    0.127    0.127    0.127        .     0.59     1.31        .
  check                   11.954        1   11.954   11.954   11.954   11.954        .    55.15   123.39        .
  - usefulness             9.420        1    9.420    9.420    9.420    9.420        .    43.46    97.23        .
    - is_useful() 1        9.232        1    9.232    9.232    9.232    9.232        .    42.59    95.29        .
  - combine                0.131        1    0.131    0.131    0.131    0.131        .     0.60     1.35        .
  - exhaustiveness         2.401        1    2.401    2.401    2.401    2.401        .    11.08    24.78        .
    - is_useful() 2        2.400        1    2.400    2.400    2.400    2.400        .    11.07    24.77        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()              5.550        1    5.550    5.550    5.550    5.550        .    25.61    57.29        .
  + Difference()           1.786        1    1.786    1.786    1.786    1.786        .     8.24    18.44        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     9.471        1    9.471    9.471    9.471    9.471        .    43.70    97.76        .
  total                   21.675        1   21.675   21.675   21.675   21.675        .   100.00   223.73   11.987
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_integer, obs(10000000) levels(1000) rep(1)
. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.01     5.56        .
  base                     0.018        1    0.018    0.018    0.018    0.018        .     0.14   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.02    11.11        .
  parse                    0.152        1    0.152    0.152    0.152    0.152        .     1.21   844.44        .
  check                   12.342        1   12.342   12.342   12.342   12.342        .    98.65 68566.67        .
  - usefulness             9.718        1    9.718    9.718    9.718    9.718        .    77.68 53988.89        .
    - is_useful() 1        9.513        1    9.513    9.513    9.513    9.513        .    76.04 52850.00        .
  - combine                0.124        1    0.124    0.124    0.124    0.124        .     0.99   688.89        .
  - exhaustiveness         2.498        1    2.498    2.498    2.498    2.498        .    19.97 13877.78        .
    - is_useful() 2        2.496        1    2.496    2.496    2.496    2.496        .    19.95 13866.67        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     5.56        .
  + Overlap()              5.795        1    5.795    5.795    5.795    5.795        .    46.32 32194.44        .
  + Difference()           1.849        1    1.849    1.849    1.849    1.849        .    14.78 10272.22        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.015        1    0.015    0.015    0.015    0.015        .     0.12    83.33        .
  total                   12.511        1   12.511   12.511   12.511   12.511        .   100.00 69505.56   12.493
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.003        1    0.003    0.003    0.003    0.003        .     0.02     1.67        .
  base                     0.180        1    0.180    0.180    0.180    0.180        .     1.11   100.00        .
  init                     0.009        1    0.009    0.009    0.009    0.009        .     0.06     5.00        .
  parse                    0.394        1    0.394    0.394    0.394    0.394        .     2.44   218.89        .
  check                   15.633        1   15.633   15.633   15.633   15.633        .    96.67  8685.00        .
  - usefulness            12.123        1   12.123   12.123   12.123   12.123        .    74.97  6735.00        .
    - is_useful() 1       11.815        1   11.815   11.815   11.815   11.815        .    73.06  6563.89        .
  - combine                0.157        1    0.157    0.157    0.157    0.157        .     0.97    87.22        .
  - exhaustiveness         3.347        1    3.347    3.347    3.347    3.347        .    20.70  1859.44        .
    - is_useful() 2        3.345        1    3.345    3.345    3.345    3.345        .    20.69  1858.33        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.002        1    0.002    0.002    0.002    0.002        .     0.01     1.11        .
  + Overlap()              7.277        1    7.277    7.277    7.277    7.277        .    45.00  4042.78        .
  + Difference()           2.473        1    2.473    2.473    2.473    2.473        .    15.29  1373.89        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.135        1    0.135    0.135    0.135    0.135        .     0.83    75.00        .
  total                   16.171        1   16.171   16.171   16.171   16.171        .   100.00  8983.89   15.991
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.019        1    0.019    0.019    0.019    0.019        .     0.12     1.22        .
  base                     1.556        1    1.556    1.556    1.556    1.556        .    10.01   100.00        .
  init                     0.103        1    0.103    0.103    0.103    0.103        .     0.66     6.62        .
  parse                    0.176        1    0.176    0.176    0.176    0.176        .     1.13    11.31        .
  check                   13.855        1   13.855   13.855   13.855   13.855        .    89.15   890.42        .
  - usefulness            10.953        1   10.953   10.953   10.953   10.953        .    70.47   703.92        .
    - is_useful() 1       10.702        1   10.702   10.702   10.702   10.702        .    68.86   687.79        .
  - combine                0.142        1    0.142    0.142    0.142    0.142        .     0.91     9.13        .
  - exhaustiveness         2.756        1    2.756    2.756    2.756    2.756        .    17.73   177.12        .
    - is_useful() 2        2.754        1    2.754    2.754    2.754    2.754        .    17.72   176.99        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.06        .
  + Overlap()              6.444        1    6.444    6.444    6.444    6.444        .    41.46   414.14        .
  + Difference()           2.067        1    2.067    2.067    2.067    2.067        .    13.30   132.84        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.408        1    1.408    1.408    1.408    1.408        .     9.06    90.49        .
  total                   15.542        1   15.542   15.542   15.542   15.542        .   100.00   998.84   13.986
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.290        1    0.290    0.290    0.290    0.290        .     1.20     2.61        .
  base                    11.115        1   11.115   11.115   11.115   11.115        .    46.17   100.00        .
  init                     0.386        1    0.386    0.386    0.386    0.386        .     1.60     3.47        .
  parse                    0.171        1    0.171    0.171    0.171    0.171        .     0.71     1.54        .
  check                   13.152        1   13.152   13.152   13.152   13.152        .    54.64   118.33        .
  - usefulness            10.456        1   10.456   10.456   10.456   10.456        .    43.44    94.07        .
    - is_useful() 1       10.224        1   10.224   10.224   10.224   10.224        .    42.47    91.98        .
  - combine                0.130        1    0.130    0.130    0.130    0.130        .     0.54     1.17        .
  - exhaustiveness         2.563        1    2.563    2.563    2.563    2.563        .    10.65    23.06        .
    - is_useful() 2        2.562        1    2.562    2.562    2.562    2.562        .    10.64    23.05        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              6.102        1    6.102    6.102    6.102    6.102        .    25.35    54.90        .
  + Difference()           1.948        1    1.948    1.948    1.948    1.948        .     8.09    17.53        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.363        1   10.363   10.363   10.363   10.363        .    43.05    93.23        .
  total                   24.072        1   24.072   24.072   24.072   24.072        .   100.00   216.57   12.957
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_float,   obs(10000000) levels(1000) rep(1)
. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.03    20.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.17   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.02    10.00        .
  parse                    0.075        1    0.075    0.075    0.075    0.075        .     1.25   750.00        .
  check                    5.928        1    5.928    5.928    5.928    5.928        .    98.54 59280.00        .
  - usefulness             3.097        1    3.097    3.097    3.097    3.097        .    51.48 30970.00        .
    - is_useful() 1        3.013        1    3.013    3.013    3.013    3.013        .    50.08 30130.00        .
  - combine                0.050        1    0.050    0.050    0.050    0.050        .     0.83   500.00        .
  - exhaustiveness         2.780        1    2.780    2.780    2.780    2.780        .    46.21 27800.00        .
    - is_useful() 2        2.778        1    2.778    2.778    2.778    2.778        .    46.18 27780.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              2.737        1    2.737    2.737    2.737    2.737        .    45.50 27370.00        .
  + Difference()           1.861        1    1.861    1.861    1.861    1.861        .    30.93 18610.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.012        1    0.012    0.012    0.012    0.012        .     0.20   120.00        .
  total                    6.016        1    6.016    6.016    6.016    6.016        .   100.00 60160.00    6.006
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.009        1    0.009    0.009    0.009    0.009        .     0.15     8.41        .
  base                     0.107        1    0.107    0.107    0.107    0.107        .     1.75   100.00        .
  init                     0.007        1    0.007    0.007    0.007    0.007        .     0.11     6.54        .
  parse                    0.084        1    0.084    0.084    0.084    0.084        .     1.37    78.50        .
  check                    5.870        1    5.870    5.870    5.870    5.870        .    96.02  5485.98        .
  - usefulness             3.087        1    3.087    3.087    3.087    3.087        .    50.50  2885.05        .
    - is_useful() 1        2.999        1    2.999    2.999    2.999    2.999        .    49.06  2802.80        .
  - combine                0.052        1    0.052    0.052    0.052    0.052        .     0.85    48.60        .
  - exhaustiveness         2.729        1    2.729    2.729    2.729    2.729        .    44.64  2550.47        .
    - is_useful() 2        2.729        1    2.729    2.729    2.729    2.729        .    44.64  2550.47        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.93        .
  + Overlap()              2.720        1    2.720    2.720    2.720    2.720        .    44.50  2542.06        .
  + Difference()           1.865        1    1.865    1.865    1.865    1.865        .    30.51  1742.99        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.152        1    0.152    0.152    0.152    0.152        .     2.49   142.06        .
  total                    6.113        1    6.113    6.113    6.113    6.113        .   100.00  5713.08    6.006
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.075        1    0.075    0.075    0.075    0.075        .     1.05     7.15        .
  base                     1.049        1    1.049    1.049    1.049    1.049        .    14.74   100.00        .
  init                     0.074        1    0.074    0.074    0.074    0.074        .     1.04     7.05        .
  parse                    0.064        1    0.064    0.064    0.064    0.064        .     0.90     6.10        .
  check                    5.883        1    5.883    5.883    5.883    5.883        .    82.68   560.82        .
  - usefulness             3.006        1    3.006    3.006    3.006    3.006        .    42.25   286.56        .
    - is_useful() 1        2.916        1    2.916    2.916    2.916    2.916        .    40.98   277.98        .
  - combine                0.078        1    0.078    0.078    0.078    0.078        .     1.10     7.44        .
  - exhaustiveness         2.797        1    2.797    2.797    2.797    2.797        .    39.31   266.63        .
    - is_useful() 2        2.795        1    2.795    2.795    2.795    2.795        .    39.28   266.44        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.10        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              2.708        1    2.708    2.708    2.708    2.708        .    38.06   258.15        .
  + Difference()           1.858        1    1.858    1.858    1.858    1.858        .    26.11   177.12        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.094        1    1.094    1.094    1.094    1.094        .    15.38   104.29        .
  total                    7.115        1    7.115    7.115    7.115    7.115        .   100.00   678.27    6.066
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.853        1    0.853    0.853    0.853    0.853        .     5.47     8.19        .
  base                    10.414        1   10.414   10.414   10.414   10.414        .    66.84   100.00        .
  init                     0.548        1    0.548    0.548    0.548    0.548        .     3.52     5.26        .
  parse                    0.056        1    0.056    0.056    0.056    0.056        .     0.36     0.54        .
  check                    5.239        1    5.239    5.239    5.239    5.239        .    33.63    50.31        .
  - usefulness             2.725        1    2.725    2.725    2.725    2.725        .    17.49    26.17        .
    - is_useful() 1        2.653        1    2.653    2.653    2.653    2.653        .    17.03    25.48        .
  - combine                0.049        1    0.049    0.049    0.049    0.049        .     0.31     0.47        .
  - exhaustiveness         2.464        1    2.464    2.464    2.464    2.464        .    15.82    23.66        .
    - is_useful() 2        2.462        1    2.462    2.462    2.462    2.462        .    15.80    23.64        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              2.392        1    2.392    2.392    2.392    2.392        .    15.35    22.97        .
  + Difference()           1.674        1    1.674    1.674    1.674    1.674        .    10.74    16.07        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     9.737        1    9.737    9.737    9.737    9.737        .    62.50    93.50        .
  total                   15.580        1   15.580   15.580   15.580   15.580        .   100.00   149.61    5.166
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_string,  obs(10000000) levels(1000) rep(1)
. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.540     1000    0.000    0.001    0.001    0.002    0.001    55.90   177.05        .
  base                     0.305     1000    0.000    0.000    0.000    0.001    0.000    31.57   100.00        .
  init                     0.081     1000    0.000    0.000    0.000    0.001    0.000     8.39    26.56        .
  parse                    0.489     1000    0.000    0.000    0.000    0.002    0.001    50.62   160.33        .
  check                    0.007     1000    0.000    0.000    0.000    0.001    0.000     0.72     2.30        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.354     1000    0.000    0.000    0.000    0.001    0.000    36.65   116.07        .
  total                    0.966     1000    0.000    0.001    0.001    0.002    0.000   100.00   316.72    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.912     1000    0.001    0.002    0.002    0.006    0.000    60.83    75.19        .
  base                     2.543     1000    0.002    0.003    0.003    0.006    0.001    80.91   100.00        .
  init                     0.082     1000    0.000    0.000    0.000    0.001    0.000     2.61     3.22        .
  parse                    0.490     1000    0.000    0.000    0.000    0.001    0.001    15.59    19.27        .
  check                    0.002     1000    0.000    0.000    0.000    0.001    0.000     0.06     0.08        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.545     1000    0.002    0.003    0.003    0.005    0.001    80.97   100.08        .
  total                    3.143     1000    0.003    0.003    0.003    0.006    0.000   100.00   123.59    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.144      100    0.010    0.011    0.011    0.015    0.001    43.66    44.83        .
  base                     2.552      100    0.024    0.026    0.025    0.040    0.002    97.40   100.00        .
  init                     0.012      100    0.000    0.000    0.000    0.001    0.000     0.46     0.47        .
  parse                    0.057      100    0.000    0.001    0.001    0.001    0.000     2.18     2.23        .
  check                    0.001      100    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.546      100    0.024    0.025    0.025    0.036    0.002    97.18    99.76        .
  total                    2.620      100    0.025    0.026    0.026    0.037    0.002   100.00   102.66    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.128       10    0.187    0.213    0.213    0.239    0.013    84.88    83.78        .
  base                     2.540       10    0.246    0.254    0.253    0.264    0.006   101.32   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  parse                    0.004       10    0.000    0.000    0.000    0.001    0.001     0.16     0.16        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.501       10    0.244    0.250    0.249    0.258    0.004    99.76    98.46        .
  total                    2.507       10    0.245    0.251    0.250    0.259    0.004   100.00    98.70   -0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.333        1    3.333    3.333    3.333    3.333        .   127.36   132.47        .
  base                     2.516        1    2.516    2.516    2.516    2.516        .    96.14   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.616        1    2.616    2.616    2.616    2.616        .    99.96   103.97        .
  total                    2.617        1    2.617    2.617    2.617    2.617        .   100.00   104.01    0.101
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.559     1000    0.000    0.001    0.001    0.002    0.000    57.33   193.43        .
  base                     0.289     1000    0.000    0.000    0.000    0.002    0.000    29.64   100.00        .
  init                     0.084     1000    0.000    0.000    0.000    0.001    0.000     8.62    29.07        .
  parse                    0.516     1000    0.000    0.001    0.001    0.001    0.000    52.92   178.55        .
  check                    0.002     1000    0.000    0.000    0.000    0.001    0.000     0.21     0.69        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.344     1000    0.000    0.000    0.000    0.001    0.000    35.28   119.03        .
  total                    0.975     1000    0.000    0.001    0.001    0.002    0.000   100.00   337.37    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.125     1000    0.001    0.002    0.002    0.005    0.000    59.11    75.43        .
  base                     2.817     1000    0.002    0.003    0.003    0.006    0.001    78.36   100.00        .
  init                     0.090     1000    0.000    0.000    0.000    0.001    0.000     2.50     3.19        .
  parse                    0.480     1000    0.000    0.000    0.000    0.001    0.000    13.35    17.04        .
  check                    0.005     1000    0.000    0.000    0.000    0.001    0.000     0.14     0.18        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.987     1000    0.002    0.003    0.003    0.006    0.001    83.09   106.03        .
  total                    3.595     1000    0.003    0.004    0.004    0.008    0.001   100.00   127.62    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.747      100    0.015    0.017    0.017    0.023    0.002    26.42    26.94        .
  base                     6.485      100    0.061    0.065    0.064    0.075    0.003    98.06   100.00        .
  init                     0.012      100    0.000    0.000    0.000    0.001    0.000     0.18     0.19        .
  parse                    0.059      100    0.000    0.001    0.001    0.001    0.000     0.89     0.91        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     6.541      100    0.061    0.065    0.065    0.073    0.002    98.91   100.86        .
  total                    6.613      100    0.062    0.066    0.065    0.074    0.002   100.00   101.97    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.160       10    0.194    0.216    0.220    0.231    0.013    80.84    79.68        .
  base                     2.711       10    0.254    0.271    0.269    0.296    0.013   101.46   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  parse                    0.004       10    0.000    0.000    0.000    0.001    0.001     0.15     0.15        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.667       10    0.257    0.267    0.261    0.293    0.012    99.81    98.38        .
  total                    2.672       10    0.257    0.267    0.262    0.294    0.012   100.00    98.56   -0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.226        1    3.226    3.226    3.226    3.226        .   121.01   120.06        .
  base                     2.687        1    2.687    2.687    2.687    2.687        .   100.79   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.664        1    2.664    2.664    2.664    2.664        .    99.92    99.14        .
  total                    2.666        1    2.666    2.666    2.666    2.666        .   100.00    99.22   -0.021
-------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.058     1000    0.000    0.001    0.001    0.002    0.000   135.99   460.00        .
  base                     0.230     1000    0.000    0.000    0.000    0.004    0.000    29.56   100.00        .
  init                     0.086     1000    0.000    0.000    0.000    0.001    0.000    11.05    37.39        .
  parse                    0.426     1000    0.000    0.000    0.000    0.001    0.000    54.76   185.22        .
  check                    0.008     1000    0.000    0.000    0.000    0.001    0.000     1.03     3.48        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.233     1000    0.000    0.000    0.000    0.001    0.000    29.95   101.30        .
  total                    0.778     1000    0.000    0.001    0.001    0.002    0.000   100.00   338.26    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.230     1000    0.006    0.007    0.007    0.014    0.001   331.65   462.28        .
  base                     1.564     1000    0.001    0.002    0.002    0.004    0.001    71.74   100.00        .
  init                     0.113     1000    0.000    0.000    0.000    0.001    0.000     5.18     7.23        .
  parse                    0.425     1000    0.000    0.000    0.000    0.001    0.000    19.50    27.17        .
  check                    0.009     1000    0.000    0.000    0.000    0.001    0.000     0.41     0.58        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.599     1000    0.001    0.002    0.002    0.004    0.001    73.35   102.24        .
  total                    2.180     1000    0.002    0.002    0.002    0.004    0.000   100.00   139.39    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.145      100    0.060    0.061    0.061    0.068    0.001   394.67   418.60        .
  base                     1.468      100    0.014    0.015    0.015    0.018    0.001    94.28   100.00        .
  init                     0.012      100    0.000    0.000    0.000    0.001    0.000     0.77     0.82        .
  parse                    0.041      100    0.000    0.000    0.000    0.001    0.000     2.63     2.79        .
  check                    0.001      100    0.000    0.000    0.000    0.001    0.000     0.06     0.07        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.497      100    0.014    0.015    0.015    0.018    0.001    96.15   101.98        .
  total                    1.557      100    0.015    0.016    0.015    0.019    0.001   100.00   106.06    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.872       10    0.679    0.687    0.686    0.699    0.006   457.22   468.12        .
  base                     1.468       10    0.145    0.147    0.146    0.150    0.002    97.67   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.07     0.07        .
  parse                    0.003       10    0.000    0.000    0.000    0.001    0.000     0.20     0.20        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.499       10    0.148    0.150    0.150    0.152    0.002    99.73   102.11        .
  total                    1.503       10    0.148    0.150    0.150    0.153    0.002   100.00   102.38    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.142        1    8.142    8.142    8.142    8.142        .   555.39   554.25        .
  base                     1.469        1    1.469    1.469    1.469    1.469        .   100.20   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.07        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.465        1    1.465    1.465    1.465    1.465        .    99.93    99.73        .
  total                    1.466        1    1.466    1.466    1.466    1.466        .   100.00    99.80   -0.003
-------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  25 Feb 2025, 13:00:32
----------------------------------------------------------------------------------------------------------------------------------------------------------
