---------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  28 Aug 2024, 16:49:50

. 
. dis "`c(current_date)'"
28 Aug 2024

. dis "`c(current_time)'"
16:49:50

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. profile_obs_integer, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.197     1000    0.000    0.000    0.000    0.003    0.000     4.82   100.00        .
        init          0.264     1000    0.000    0.000    0.000    0.002    0.000     6.45   134.01        .
       parse          0.518     1000    0.000    0.001    0.001    0.001    0.000    12.66   262.94        .
       check          3.069     1000    0.002    0.003    0.003    0.008    0.000    75.02  1557.87        .
        eval          0.211     1000    0.000    0.000    0.000    0.001    0.000     5.16   107.11        .
       total          4.091     1000    0.003    0.004    0.004    0.009    0.000   100.00  2076.65    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.633     1000    0.001    0.002    0.002    0.004    0.001    23.59   100.00        .
        init          1.502     1000    0.001    0.002    0.001    0.004    0.001    21.70    91.98        .
       parse          0.553     1000    0.000    0.001    0.001    0.003    0.001     7.99    33.86        .
       check          3.055     1000    0.002    0.003    0.003    0.006    0.000    44.13   187.08        .
        eval          1.777     1000    0.001    0.002    0.002    0.004    0.000    25.67   108.82        .
       total          6.923     1000    0.006    0.007    0.007    0.010    0.000   100.00   423.94    0.005
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.603      100    0.015    0.016    0.016    0.020    0.001    45.08   100.00        .
        init          1.526      100    0.014    0.015    0.015    0.018    0.001    42.91    95.20        .
       parse          0.047      100    0.000    0.000    0.000    0.001    0.001     1.32     2.93        .
       check          0.306      100    0.003    0.003    0.003    0.004    0.000     8.61    19.09        .
        eval          1.671      100    0.016    0.017    0.016    0.021    0.001    46.99   104.24        .
       total          3.556      100    0.034    0.036    0.035    0.041    0.001   100.00   221.83    0.020
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.425       10    0.139    0.143    0.141    0.152    0.004    50.26   100.00        .
        init          1.341       10    0.130    0.134    0.132    0.145    0.005    47.30    94.11        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.25     0.49        .
       check          0.032       10    0.003    0.003    0.003    0.005    0.001     1.13     2.25        .
        eval          1.455       10    0.142    0.145    0.145    0.148    0.002    51.32   102.11        .
       total          2.835       10    0.280    0.283    0.281    0.295    0.005   100.00   198.95    0.141
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.454        1    1.454    1.454    1.454    1.454        .    52.02   100.00        .
        init          1.314        1    1.314    1.314    1.314    1.314        .    47.01    90.37        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.003        1    0.003    0.003    0.003    0.003        .     0.11     0.21        .
        eval          1.478        1    1.478    1.478    1.478    1.478        .    52.88   101.65        .
       total          2.795        1    2.795    2.795    2.795    2.795        .   100.00   192.23    1.341
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.196     1000    0.000    0.000    0.000    0.002    0.000     5.33   100.00        .
        init          0.122     1000    0.000    0.000    0.000    0.001    0.000     3.32    62.24        .
       parse          0.455     1000    0.000    0.000    0.000    0.001    0.000    12.37   232.14        .
       check          2.850     1000    0.002    0.003    0.003    0.005    0.000    77.51  1454.08        .
        eval          0.221     1000    0.000    0.000    0.000    0.001    0.000     6.01   112.76        .
       total          3.677     1000    0.003    0.004    0.004    0.007    0.001   100.00  1876.02    0.003
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.134     1000    0.001    0.002    0.002    0.008    0.001    32.64   100.00        .
        init          0.270     1000    0.000    0.000    0.000    0.002    0.000     4.13    12.65        .
       parse          0.598     1000    0.000    0.001    0.001    0.003    0.001     9.15    28.02        .
       check          3.326     1000    0.002    0.003    0.003    0.018    0.001    50.87   155.86        .
        eval          2.315     1000    0.001    0.002    0.002    0.014    0.001    35.41   108.48        .
       total          6.538     1000    0.005    0.007    0.006    0.023    0.002   100.00   306.37    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.877      100    0.031    0.039    0.037    0.065    0.006    83.83   100.00        .
        init          0.327      100    0.002    0.003    0.003    0.014    0.002     7.07     8.43        .
       parse          0.067      100    0.000    0.001    0.001    0.003    0.001     1.45     1.73        .
       check          0.345      100    0.002    0.003    0.003    0.011    0.001     7.46     8.90        .
        eval          3.878      100    0.030    0.039    0.038    0.061    0.005    83.85   100.03        .
       total          4.625      100    0.036    0.046    0.045    0.074    0.007   100.00   119.29    0.007
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.736       10    0.150    0.174    0.162    0.218    0.023    88.30   100.00        .
        init          0.062       10    0.005    0.006    0.006    0.012    0.002     3.15     3.57        .
       parse          0.008       10    0.000    0.001    0.001    0.002    0.001     0.41     0.46        .
       check          0.031       10    0.002    0.003    0.003    0.005    0.001     1.58     1.79        .
        eval          1.865       10    0.160    0.186    0.177    0.242    0.026    94.86   107.43        .
       total          1.966       10    0.169    0.197    0.187    0.255    0.027   100.00   113.25    0.023
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.075        1    2.075    2.075    2.075    2.075        .   113.76   100.00        .
        init          0.061        1    0.061    0.061    0.061    0.061        .     3.34     2.94        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.05     0.05        .
       check          0.004        1    0.004    0.004    0.004    0.004        .     0.22     0.19        .
        eval          1.758        1    1.758    1.758    1.758    1.758        .    96.38    84.72        .
       total          1.824        1    1.824    1.824    1.824    1.824        .   100.00    87.90   -0.251
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.252     1000    0.000    0.000    0.000    0.001    0.000     6.53   100.00        .
        init          0.693     1000    0.000    0.001    0.001    0.008    0.001    17.96   275.00        .
       parse          0.599     1000    0.000    0.001    0.001    0.004    0.001    15.53   237.70        .
       check          2.264     1000    0.001    0.002    0.002    0.011    0.001    58.68   898.41        .
        eval          0.259     1000    0.000    0.000    0.000    0.001    0.000     6.71   102.78        .
       total          3.858     1000    0.002    0.004    0.003    0.013    0.001   100.00  1530.95    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.157     1000    0.001    0.002    0.002    0.007    0.001    20.61   100.00        .
        init          6.161     1000    0.004    0.006    0.006    0.013    0.002    58.86   285.63        .
       parse          0.567     1000    0.000    0.001    0.001    0.002    0.001     5.42    26.29        .
       check          2.071     1000    0.001    0.002    0.002    0.008    0.001    19.78    96.01        .
        eval          1.638     1000    0.001    0.002    0.002    0.005    0.001    15.65    75.94        .
       total         10.468     1000    0.007    0.010    0.010    0.021    0.002   100.00   485.30    0.008
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.494      100    0.012    0.015    0.014    0.033    0.003    18.25   100.00        .
        init          6.388      100    0.053    0.064    0.064    0.096    0.008    78.03   427.58        .
       parse          0.053      100    0.000    0.001    0.001    0.001    0.001     0.65     3.55        .
       check          0.194      100    0.001    0.002    0.002    0.004    0.001     2.37    12.99        .
        eval          1.548      100    0.013    0.015    0.014    0.033    0.003    18.91   103.61        .
       total          8.187      100    0.069    0.082    0.082    0.111    0.008   100.00   547.99    0.067
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.554       10    0.133    0.155    0.150    0.184    0.017    10.79   100.00        .
        init         12.772       10    1.157    1.277    1.218    1.738    0.171    88.69   821.88        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.04     0.39        .
       check          0.020       10    0.001    0.002    0.002    0.004    0.001     0.14     1.29        .
        eval          1.602       10    0.139    0.160    0.154    0.184    0.013    11.13   103.09        .
       total         14.400       10    1.312    1.440    1.374    1.894    0.171   100.00   926.64    1.285
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.568        1    1.568    1.568    1.568    1.568        .     5.12   100.00        .
        init         29.068        1   29.068   29.068   29.068   29.068        .    94.91  1853.83        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.13        .
        eval          1.557        1    1.557    1.557    1.557    1.557        .     5.08    99.30        .
       total         30.627        1   30.627   30.627   30.627   30.627        .   100.00  1953.25   29.059
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.272     1000    0.000    0.000    0.000    0.003    0.000    27.12   100.00        .
        init          0.109     1000    0.000    0.000    0.000    0.001    0.000    10.87    40.07        .
       parse          0.571     1000    0.000    0.001    0.001    0.004    0.001    56.93   209.93        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.40     1.47        .
        eval          0.296     1000    0.000    0.000    0.000    0.001    0.000    29.51   108.82        .
       total          1.003     1000    0.000    0.001    0.001    0.005    0.001   100.00   368.75    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.127     1000    0.001    0.002    0.002    0.009    0.001    70.29   100.00        .
        init          0.118     1000    0.000    0.000    0.000    0.001    0.000     3.90     5.55        .
       parse          0.676     1000    0.000    0.001    0.001    0.002    0.001    22.34    31.78        .
       check          0.002     1000    0.000    0.000    0.000    0.001    0.000     0.07     0.09        .
        eval          2.192     1000    0.001    0.002    0.002    0.005    0.001    72.44   103.06        .
       total          3.026     1000    0.002    0.003    0.003    0.007    0.001   100.00   142.27    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.043      100    0.014    0.020    0.020    0.033    0.004    89.45   100.00        .
        init          0.011      100    0.000    0.000    0.000    0.001    0.000     0.48     0.54        .
       parse          0.079      100    0.000    0.001    0.001    0.004    0.001     3.46     3.87        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.190      100    0.014    0.022    0.020    0.046    0.006    95.88   107.20        .
       total          2.284      100    0.015    0.023    0.021    0.047    0.006   100.00   111.80    0.002
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.805       10    0.143    0.180    0.183    0.199    0.016    98.90   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.05     0.06        .
       parse          0.009       10    0.000    0.001    0.001    0.001    0.000     0.49     0.50        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.815       10    0.153    0.181    0.174    0.235    0.026    99.45   100.55        .
       total          1.825       10    0.154    0.182    0.175    0.236    0.026   100.00   101.11    0.002
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.573        1    1.573    1.573    1.573    1.573        .    97.88   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.06        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.606        1    1.606    1.606    1.606    1.606        .    99.94   102.10        .
       total          1.607        1    1.607    1.607    1.607    1.607        .   100.00   102.16    0.034
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.235     1000    0.000    0.000    0.000    0.001    0.000    22.49   100.00        .
        init          0.101     1000    0.000    0.000    0.000    0.003    0.000     9.67    42.98        .
       parse          0.592     1000    0.000    0.001    0.001    0.003    0.001    56.65   251.91        .
       check          0.003     1000    0.000    0.000    0.000    0.001    0.000     0.29     1.28        .
        eval          0.321     1000    0.000    0.000    0.000    0.001    0.000    30.72   136.60        .
       total          1.045     1000    0.000    0.001    0.001    0.004    0.001   100.00   444.68    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.243     1000    0.001    0.003    0.003    0.008    0.001    71.80   100.00        .
        init          0.158     1000    0.000    0.000    0.000    0.007    0.000     3.50     4.87        .
       parse          0.861     1000    0.000    0.001    0.001    0.005    0.001    19.06    26.55        .
       check          0.013     1000    0.000    0.000    0.000    0.001    0.000     0.29     0.40        .
        eval          3.418     1000    0.001    0.003    0.003    0.011    0.001    75.67   105.40        .
       total          4.517     1000    0.002    0.005    0.004    0.014    0.002   100.00   139.28    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.487      100    0.030    0.035    0.033    0.051    0.005    97.16   100.00        .
        init          0.010      100    0.000    0.000    0.000    0.001    0.000     0.28     0.29        .
       parse          0.059      100    0.000    0.001    0.001    0.002    0.001     1.64     1.69        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          3.518      100    0.030    0.035    0.033    0.049    0.005    98.02   100.89        .
       total          3.589      100    0.031    0.036    0.033    0.050    0.005   100.00   102.93    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.614       10    0.143    0.161    0.158    0.177    0.011    96.19   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.009       10    0.000    0.001    0.001    0.002    0.001     0.54     0.56        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.669       10    0.156    0.167    0.167    0.179    0.006    99.46   103.41        .
       total          1.678       10    0.158    0.168    0.167    0.180    0.006   100.00   103.97    0.006
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.605        1    1.605    1.605    1.605    1.605        .    96.86   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.002        1    0.002    0.002    0.002    0.002        .     0.12     0.12        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.655        1    1.655    1.655    1.655    1.655        .    99.88   103.12        .
       total          1.657        1    1.657    1.657    1.657    1.657        .   100.00   103.24    0.052
---------------------------------------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.202     1000    0.000    0.000    0.000    0.002    0.000    22.75   100.00        .
        init          0.095     1000    0.000    0.000    0.000    0.001    0.000    10.70    47.03        .
       parse          0.515     1000    0.000    0.001    0.001    0.002    0.001    58.00   254.95        .
       check          0.001     1000    0.000    0.000    0.000    0.001    0.000     0.11     0.50        .
        eval          0.254     1000    0.000    0.000    0.000    0.004    0.000    28.60   125.74        .
       total          0.888     1000    0.000    0.001    0.001    0.005    0.001   100.00   439.60    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.561     1000    0.001    0.003    0.002    0.012    0.001    80.69   100.00        .
        init          0.146     1000    0.000    0.000    0.000    0.001    0.000     4.60     5.70        .
       parse          0.673     1000    0.000    0.001    0.001    0.005    0.001    21.20    26.28        .
       check          0.007     1000    0.000    0.000    0.000    0.001    0.000     0.22     0.27        .
        eval          2.313     1000    0.001    0.002    0.002    0.006    0.001    72.87    90.32        .
       total          3.174     1000    0.001    0.003    0.003    0.007    0.001   100.00   123.94    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.422      100    0.012    0.014    0.013    0.027    0.003    91.39   100.00        .
        init          0.007      100    0.000    0.000    0.000    0.001    0.000     0.45     0.49        .
       parse          0.049      100    0.000    0.000    0.000    0.002    0.001     3.15     3.45        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.500      100    0.013    0.015    0.014    0.027    0.003    96.40   105.49        .
       total          1.556      100    0.013    0.016    0.014    0.027    0.003   100.00   109.42    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.526       10    0.137    0.153    0.151    0.164    0.009    96.70   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.06     0.07        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.44     0.46        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.570       10    0.141    0.157    0.150    0.184    0.017    99.49   102.88        .
       total          1.578       10    0.142    0.158    0.150    0.184    0.017   100.00   103.41    0.005
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.570        1    1.570    1.570    1.570    1.570        .   102.48   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.06        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.531        1    1.531    1.531    1.531    1.531        .    99.93    97.52        .
       total          1.532        1    1.532    1.532    1.532    1.532        .   100.00    97.58   -0.038
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  28 Aug 2024, 16:53:40
---------------------------------------------------------------------------------------------------------------------------------------------------
