----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_levelsof.log
  log type:  text
 opened on:  21 Sep 2024, 15:07:15

. 
. bench_all, n_obs(1000)     n_levels(10)   n_rep(1000)
Number of observations (_N) was 0, now 1,000.
100 / 1000
200 / 1000
300 / 1000
400 / 1000
500 / 1000
600 / 1000
700 / 1000
800 / 1000
900 / 1000
1000 / 1000
  10:      3.21 /     1000 =       0.0032
  11:      0.51 /     1000 =       0.0005
  12:      0.42 /     1000 =       0.0004
  13:      0.26 /     1000 =       0.0003
  14:      0.77 /     1000 =       0.0008
  15:      0.44 /     1000 =       0.0004
  16:      0.17 /     1000 =       0.0002
  19:      0.20 /     1000 =       0.0002
  20:      3.39 /     1000 =       0.0034
  21:      0.50 /     1000 =       0.0005
  22:      0.46 /     1000 =       0.0005
  23:      0.33 /     1000 =       0.0003
  24:      0.64 /     1000 =       0.0006
  25:      0.45 /     1000 =       0.0005
  26:      0.18 /     1000 =       0.0002
  29:      0.28 /     1000 =       0.0003
  30:      3.58 /     1000 =       0.0036
  31:      0.80 /     1000 =       0.0008
  32:      0.76 /     1000 =       0.0008
  33:      0.56 /     1000 =       0.0006
  34:      0.52 /     1000 =       0.0005
  35:      0.83 /     1000 =       0.0008
  36:      0.65 /     1000 =       0.0007
  39:      0.52 /     1000 =       0.0005
  40:      3.37 /     1000 =       0.0034
  41:      0.49 /     1000 =       0.0005
  42:      0.44 /     1000 =       0.0004

. bench_all, n_obs(10000)    n_levels(10)   n_rep(100)
Number of observations (_N) was 0, now 10,000.
10 / 100
20 / 100
30 / 100
40 / 100
50 / 100
60 / 100
70 / 100
80 / 100
90 / 100
100 / 100
  10:      0.28 /      100 =       0.0028
  11:      0.31 /      100 =       0.0031
  12:      0.15 /      100 =       0.0015
  13:      0.17 /      100 =       0.0017
  14:      0.57 /      100 =       0.0057
  15:      0.35 /      100 =       0.0035
  16:      0.07 /      100 =       0.0007
  19:      0.09 /      100 =       0.0009
  20:      0.28 /      100 =       0.0028
  21:      0.34 /      100 =       0.0034
  22:      0.32 /      100 =       0.0032
  23:      0.31 /      100 =       0.0031
  24:      0.54 /      100 =       0.0054
  25:      0.35 /      100 =       0.0035
  26:      0.09 /      100 =       0.0009
  29:      0.09 /      100 =       0.0009
  30:      0.66 /      100 =       0.0066
  31:      0.54 /      100 =       0.0054
  32:      0.51 /      100 =       0.0051
  33:      0.50 /      100 =       0.0050
  34:      0.53 /      100 =       0.0053
  35:      0.69 /      100 =       0.0069
  36:      0.52 /      100 =       0.0052
  39:      0.51 /      100 =       0.0051
  40:      0.33 /      100 =       0.0033
  41:      0.32 /      100 =       0.0032
  42:      0.16 /      100 =       0.0016

. bench_all, n_obs(100000)   n_levels(10)   n_rep(10)
Number of observations (_N) was 0, now 100,000.
1 / 10
2 / 10
3 / 10
4 / 10
5 / 10
6 / 10
7 / 10
8 / 10
9 / 10
10 / 10
  10:      0.13 /       10 =       0.0127
  11:      0.16 /       10 =       0.0164
  12:      0.16 /       10 =       0.0156
  13:      0.16 /       10 =       0.0158
  14:      0.63 /       10 =       0.0625
  15:      0.36 /       10 =       0.0364
  16:      0.06 /       10 =       0.0059
  19:      0.06 /       10 =       0.0063
  20:      0.13 /       10 =       0.0128
  21:      0.57 /       10 =       0.0566
  22:      0.53 /       10 =       0.0532
  23:      0.55 /       10 =       0.0554
  24:      0.55 /       10 =       0.0547
  25:      0.36 /       10 =       0.0357
  26:      0.05 /       10 =       0.0054
  29:      0.06 /       10 =       0.0057
  30:      1.00 /       10 =       0.1000
  31:      0.84 /       10 =       0.0845
  32:      0.82 /       10 =       0.0817
  33:      0.85 /       10 =       0.0855
  34:      0.88 /       10 =       0.0881
  35:      0.70 /       10 =       0.0704
  36:      0.54 /       10 =       0.0539
  39:      0.87 /       10 =       0.0869
  40:      0.14 /       10 =       0.0137
  41:      0.16 /       10 =       0.0160
  42:      0.14 /       10 =       0.0143

. bench_all, n_obs(1000000)  n_levels(10)   n_rep(1)
Number of observations (_N) was 0, now 1,000,000.
1 / 1
  10:      0.07 /        1 =       0.0750
  11:      0.13 /        1 =       0.1330
  12:      0.12 /        1 =       0.1220
  13:      0.13 /        1 =       0.1260
  14:      0.54 /        1 =       0.5360
  15:      0.32 /        1 =       0.3230
  16:      0.05 /        1 =       0.0480
  19:      0.05 /        1 =       0.0490
  20:      0.07 /        1 =       0.0700
  21:      0.86 /        1 =       0.8640
  22:      0.91 /        1 =       0.9130
  23:      0.89 /        1 =       0.8870
  24:      0.48 /        1 =       0.4850
  25:      0.31 /        1 =       0.3110
  26:      0.05 /        1 =       0.0500
  29:      0.05 /        1 =       0.0510
  30:      1.81 /        1 =       1.8140
  31:      1.14 /        1 =       1.1430
  32:      1.21 /        1 =       1.2060
  33:      1.18 /        1 =       1.1770
  34:      1.16 /        1 =       1.1600
  35:      0.67 /        1 =       0.6650
  36:      0.51 /        1 =       0.5070
  39:      0.50 /        1 =       0.5000
  40:      0.07 /        1 =       0.0680
  41:      0.14 /        1 =       0.1350
  42:      0.12 /        1 =       0.1220

. bench_all, n_obs(10000000) n_levels(10)   n_rep(1)
Number of observations (_N) was 0, now 10,000,000.
1 / 1
  10:      0.65 /        1 =       0.6460
  11:      1.32 /        1 =       1.3220
  12:      1.33 /        1 =       1.3300
  13:      1.23 /        1 =       1.2290
  14:      5.57 /        1 =       5.5730
  15:      3.20 /        1 =       3.2000
  16:      0.48 /        1 =       0.4770
  19:      0.48 /        1 =       0.4770
  20:      0.67 /        1 =       0.6690
  21:     19.02 /        1 =      19.0150
  22:     19.65 /        1 =      19.6490
  23:     19.13 /        1 =      19.1260
  24:      4.82 /        1 =       4.8210
  25:      3.00 /        1 =       2.9990
  26:      0.47 /        1 =       0.4720
  29:      0.48 /        1 =       0.4790
  30:     35.93 /        1 =      35.9310
  31:     22.51 /        1 =      22.5060
  32:     23.18 /        1 =      23.1810
  33:     23.06 /        1 =      23.0560
  34:     23.14 /        1 =      23.1430
  35:      6.65 /        1 =       6.6530
  36:      4.89 /        1 =       4.8910
  39:      4.76 /        1 =       4.7570
  40:      0.63 /        1 =       0.6300
  41:      1.38 /        1 =       1.3830
  42:      1.29 /        1 =       1.2880

. 
. bench_all, n_obs(1000)     n_levels(100)  n_rep(1000)
Number of observations (_N) was 0, now 1,000.
100 / 1000
200 / 1000
300 / 1000
400 / 1000
500 / 1000
600 / 1000
700 / 1000
800 / 1000
900 / 1000
1000 / 1000
  10:     22.32 /     1000 =       0.0223
  11:      0.60 /     1000 =       0.0006
  12:      0.30 /     1000 =       0.0003
  13:      0.27 /     1000 =       0.0003
  14:      1.04 /     1000 =       0.0010
  15:      0.59 /     1000 =       0.0006
  16:      0.40 /     1000 =       0.0004
  19:      0.25 /     1000 =       0.0002
  20:     23.24 /     1000 =       0.0232
  21:      0.61 /     1000 =       0.0006
  22:      0.44 /     1000 =       0.0004
  23:      0.34 /     1000 =       0.0003
  24:      0.99 /     1000 =       0.0010
  25:      0.62 /     1000 =       0.0006
  26:      0.41 /     1000 =       0.0004
  29:      0.35 /     1000 =       0.0003
  30:     22.63 /     1000 =       0.0226
  31:      0.94 /     1000 =       0.0009
  32:      0.70 /     1000 =       0.0007
  33:      0.61 /     1000 =       0.0006
  34:      0.62 /     1000 =       0.0006
  35:      1.25 /     1000 =       0.0012
  36:      0.90 /     1000 =       0.0009
  39:      0.61 /     1000 =       0.0006
  40:     22.46 /     1000 =       0.0225
  41:      0.60 /     1000 =       0.0006
  42:      0.32 /     1000 =       0.0003

. bench_all, n_obs(10000)    n_levels(100)  n_rep(100)
Number of observations (_N) was 0, now 10,000.
10 / 100
20 / 100
30 / 100
40 / 100
50 / 100
60 / 100
70 / 100
80 / 100
90 / 100
100 / 100
  10:      0.52 /      100 =       0.0052
  11:      0.42 /      100 =       0.0042
  12:      0.19 /      100 =       0.0019
  13:      0.17 /      100 =       0.0017
  14:      0.80 /      100 =       0.0080
  15:      0.43 /      100 =       0.0043
  16:      0.24 /      100 =       0.0024
  19:      0.19 /      100 =       0.0019
  20:      0.86 /      100 =       0.0086
  21:      0.44 /      100 =       0.0044
  22:      0.43 /      100 =       0.0043
  23:      0.40 /      100 =       0.0040
  24:      0.79 /      100 =       0.0079
  25:      0.44 /      100 =       0.0044
  26:      0.25 /      100 =       0.0025
  29:      0.42 /      100 =       0.0042
  30:      0.98 /      100 =       0.0098
  31:      0.66 /      100 =       0.0066
  32:      0.65 /      100 =       0.0065
  33:      0.63 /      100 =       0.0063
  34:      0.63 /      100 =       0.0063
  35:      1.03 /      100 =       0.0103
  36:      0.65 /      100 =       0.0065
  39:      0.64 /      100 =       0.0064
  40:      0.55 /      100 =       0.0055
  41:      0.39 /      100 =       0.0039
  42:      0.20 /      100 =       0.0020

. bench_all, n_obs(100000)   n_levels(100)  n_rep(10)
Number of observations (_N) was 0, now 100,000.
1 / 10
2 / 10
3 / 10
4 / 10
5 / 10
6 / 10
7 / 10
8 / 10
9 / 10
10 / 10
  10:      0.22 /       10 =       0.0216
  11:      0.18 /       10 =       0.0183
  12:      0.18 /       10 =       0.0179
  13:      0.20 /       10 =       0.0195
  14:      0.76 /       10 =       0.0760
  15:      0.40 /       10 =       0.0398
  16:      0.22 /       10 =       0.0217
  19:      0.17 /       10 =       0.0165
  20:      0.87 /       10 =       0.0869
  21:      0.72 /       10 =       0.0722
  22:      0.66 /       10 =       0.0658
  23:      0.71 /       10 =       0.0710
  24:      0.80 /       10 =       0.0799
  25:      0.38 /       10 =       0.0383
  26:      0.20 /       10 =       0.0197
  29:      0.66 /       10 =       0.0658
  30:      1.17 /       10 =       0.1174
  31:      1.08 /       10 =       0.1085
  32:      1.10 /       10 =       0.1102
  33:      1.04 /       10 =       0.1037
  34:      1.06 /       10 =       0.1059
  35:      0.94 /       10 =       0.0939
  36:      0.60 /       10 =       0.0598
  39:      1.02 /       10 =       0.1019
  40:      0.24 /       10 =       0.0238
  41:      0.18 /       10 =       0.0178
  42:      0.15 /       10 =       0.0151

. bench_all, n_obs(1000000)  n_levels(100)  n_rep(1)
Number of observations (_N) was 0, now 1,000,000.
1 / 1
  10:      0.17 /        1 =       0.1740
  11:      0.16 /        1 =       0.1590
  12:      0.12 /        1 =       0.1220
  13:      0.14 /        1 =       0.1370
  14:      0.76 /        1 =       0.7600
  15:      0.36 /        1 =       0.3570
  16:      0.17 /        1 =       0.1730
  19:      0.12 /        1 =       0.1220
  20:      1.75 /        1 =       1.7510
  21:      1.05 /        1 =       1.0550
  22:      1.12 /        1 =       1.1230
  23:      1.13 /        1 =       1.1290
  24:      0.74 /        1 =       0.7370
  25:      0.39 /        1 =       0.3850
  26:      0.17 /        1 =       0.1700
  29:      0.33 /        1 =       0.3270
  30:      2.28 /        1 =       2.2830
  31:      1.48 /        1 =       1.4790
  32:      1.40 /        1 =       1.3990
  33:      1.73 /        1 =       1.7260
  34:      1.87 /        1 =       1.8660
  35:      1.06 /        1 =       1.0600
  36:      0.61 /        1 =       0.6060
  39:      0.58 /        1 =       0.5790
  40:      0.15 /        1 =       0.1490
  41:      0.18 /        1 =       0.1800
  42:      0.13 /        1 =       0.1300

. bench_all, n_obs(10000000) n_levels(100)  n_rep(1)
Number of observations (_N) was 0, now 10,000,000.
1 / 1
  10:      1.33 /        1 =       1.3320
  11:      1.28 /        1 =       1.2770
  12:      1.26 /        1 =       1.2610
  13:      1.26 /        1 =       1.2590
  14:      7.26 /        1 =       7.2640
  15:      3.61 /        1 =       3.6090
  16:      1.59 /        1 =       1.5930
  19:      1.34 /        1 =       1.3360
  20:     34.78 /        1 =      34.7840
  21:     22.55 /        1 =      22.5510
  22:     21.49 /        1 =      21.4930
  23:     21.18 /        1 =      21.1780
  24:      6.47 /        1 =       6.4710
  25:      3.36 /        1 =       3.3640
  26:      1.74 /        1 =       1.7350
  29:      3.23 /        1 =       3.2300
  30:     39.86 /        1 =      39.8570
  31:     27.41 /        1 =      27.4110
  32:     26.96 /        1 =      26.9610
  33:     26.00 /        1 =      26.0000
  34:     25.81 /        1 =      25.8060
  35:      8.44 /        1 =       8.4350
  36:      5.03 /        1 =       5.0300
  39:      5.02 /        1 =       5.0180
  40:      1.28 /        1 =       1.2830
  41:      1.28 /        1 =       1.2820
  42:      1.35 /        1 =       1.3500

. 
. bench_all, n_obs(1000)     n_levels(1000) n_rep(1000)
Number of observations (_N) was 0, now 1,000.
100 / 1000
200 / 1000
300 / 1000
400 / 1000
500 / 1000
600 / 1000
700 / 1000
800 / 1000
900 / 1000
1000 / 1000
  10:    277.02 /     1000 =       0.2770
  11:      1.06 /     1000 =       0.0011
  12:      0.55 /     1000 =       0.0005
  13:      0.44 /     1000 =       0.0004
  14:     11.49 /     1000 =       0.0115
  15:      3.08 /     1000 =       0.0031
  16:     10.63 /     1000 =       0.0106
  19:      0.59 /     1000 =       0.0006
  20:    327.03 /     1000 =       0.3270
  21:      1.14 /     1000 =       0.0011
  22:      0.75 /     1000 =       0.0007
  23:      0.64 /     1000 =       0.0006
  24:     11.52 /     1000 =       0.0115
  25:      3.15 /     1000 =       0.0032
  26:     10.67 /     1000 =       0.0107
  29:      0.77 /     1000 =       0.0008
  30:    277.46 /     1000 =       0.2775
  31:      1.82 /     1000 =       0.0018
  32:      1.80 /     1000 =       0.0018
  33:      1.78 /     1000 =       0.0018
  34:      1.73 /     1000 =       0.0017
  35:     14.16 /     1000 =       0.0142
  36:      5.00 /     1000 =       0.0050
  39:      1.71 /     1000 =       0.0017
  40:    278.05 /     1000 =       0.2781
  41:      1.08 /     1000 =       0.0011
  42:      0.55 /     1000 =       0.0005

. bench_all, n_obs(10000)    n_levels(1000) n_rep(100)
Number of observations (_N) was 0, now 10,000.
10 / 100
20 / 100
30 / 100
40 / 100
50 / 100
60 / 100
70 / 100
80 / 100
90 / 100
100 / 100
  10:      4.80 /      100 =       0.0480
  11:      1.26 /      100 =       0.0126
  12:      0.56 /      100 =       0.0056
  13:      0.50 /      100 =       0.0050
  14:      4.41 /      100 =       0.0441
  15:      1.73 /      100 =       0.0173
  16:      6.29 /      100 =       0.0629
  19:      0.64 /      100 =       0.0064
  20:     15.18 /      100 =       0.1518
  21:      1.28 /      100 =       0.0128
  22:      1.21 /      100 =       0.0121
  23:      1.18 /      100 =       0.0118
  24:      4.39 /      100 =       0.0439
  25:      1.72 /      100 =       0.0172
  26:      6.53 /      100 =       0.0653
  29:      1.30 /      100 =       0.0130
  30:      6.12 /      100 =       0.0612
  31:      2.04 /      100 =       0.0204
  32:      2.01 /      100 =       0.0201
  33:      1.97 /      100 =       0.0197
  34:      1.98 /      100 =       0.0198
  35:      5.40 /      100 =       0.0540
  36:      2.48 /      100 =       0.0248
  39:      1.99 /      100 =       0.0199
  40:      4.79 /      100 =       0.0479
  41:      1.23 /      100 =       0.0123
  42:      0.53 /      100 =       0.0053

. bench_all, n_obs(100000)   n_levels(1000) n_rep(10)
Number of observations (_N) was 0, now 100,000.
1 / 10
2 / 10
3 / 10
4 / 10
5 / 10
6 / 10
7 / 10
8 / 10
9 / 10
10 / 10
  10:      0.63 /       10 =       0.0629
  11:      0.50 /       10 =       0.0505
  12:      0.48 /       10 =       0.0479
  13:      0.45 /       10 =       0.0450
  14:      2.39 /       10 =       0.2386
  15:      1.18 /       10 =       0.1180
  16:      4.63 /       10 =       0.4629
  19:      0.49 /       10 =       0.0492
  20:      3.28 /       10 =       0.3285
  21:      1.76 /       10 =       0.1760
  22:      1.82 /       10 =       0.1823
  23:      1.90 /       10 =       0.1896
  24:      2.39 /       10 =       0.2395
  25:      1.18 /       10 =       0.1183
  26:      4.87 /       10 =       0.4869
  29:      1.78 /       10 =       0.1782
  30:      3.15 /       10 =       0.3147
  31:      2.69 /       10 =       0.2690
  32:      2.75 /       10 =       0.2754
  33:      2.67 /       10 =       0.2668
  34:      2.70 /       10 =       0.2699
  35:      3.03 /       10 =       0.3032
  36:      1.76 /       10 =       0.1760
  39:      2.73 /       10 =       0.2726
  40:      0.58 /       10 =       0.0582
  41:      0.47 /       10 =       0.0472
  42:      0.46 /       10 =       0.0461

. bench_all, n_obs(1000000)  n_levels(1000) n_rep(1)
Number of observations (_N) was 0, now 1,000,000.
1 / 1
  10:      0.43 /        1 =       0.4340
  11:      0.37 /        1 =       0.3700
  12:      0.42 /        1 =       0.4230
  13:      0.37 /        1 =       0.3740
  14:      2.11 /        1 =       2.1130
  15:      1.02 /        1 =       1.0250
  16:      4.04 /        1 =       4.0380
  19:      0.39 /        1 =       0.3900
  20:      4.29 /        1 =       4.2950
  21:      2.74 /        1 =       2.7420
  22:      2.67 /        1 =       2.6740
  23:      2.68 /        1 =       2.6830
  24:      2.17 /        1 =       2.1690
  25:      1.01 /        1 =       1.0060
  26:      4.33 /        1 =       4.3260
  29:      1.03 /        1 =       1.0280
  30:      5.87 /        1 =       5.8710
  31:      3.98 /        1 =       3.9800
  32:      3.67 /        1 =       3.6700
  33:      3.67 /        1 =       3.6690
  34:      4.04 /        1 =       4.0390
  35:      2.75 /        1 =       2.7500
  36:      1.61 /        1 =       1.6080
  39:      1.65 /        1 =       1.6530
  40:      0.43 /        1 =       0.4320
  41:      0.41 /        1 =       0.4110
  42:      0.39 /        1 =       0.3940

. bench_all, n_obs(10000000) n_levels(1000) n_rep(1)
Number of observations (_N) was 0, now 10,000,000.
1 / 1
  10:      4.12 /        1 =       4.1230
  11:      3.98 /        1 =       3.9820
  12:      3.78 /        1 =       3.7780
  13:      3.85 /        1 =       3.8470
  14:     20.92 /        1 =      20.9200
  15:      9.89 /        1 =       9.8910
  16:     41.82 /        1 =      41.8240
  19:      3.92 /        1 =       3.9240
  20:     90.67 /        1 =      90.6690
  21:     52.33 /        1 =      52.3330
  22:     48.18 /        1 =      48.1790
  23:     51.42 /        1 =      51.4190
  24:     20.97 /        1 =      20.9680
  25:     10.44 /        1 =      10.4430
  26:     42.25 /        1 =      42.2470
  29:     10.17 /        1 =      10.1690
  30:     87.76 /        1 =      87.7620
  31:     59.63 /        1 =      59.6320
  32:     61.42 /        1 =      61.4200
  33:     60.87 /        1 =      60.8680
  34:     60.96 /        1 =      60.9580
  35:     27.19 /        1 =      27.1880
  36:     16.30 /        1 =      16.2990
  39:     16.93 /        1 =      16.9300
  40:      4.04 /        1 =       4.0360
  41:      3.96 /        1 =       3.9570
  42:      3.78 /        1 =       3.7770

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_levelsof.log
  log type:  text
 closed on:  21 Sep 2024, 15:58:35
----------------------------------------------------------------------------------------------------------------------------------------
