------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_levelsof.log
  log type:  text
 opened on:  19 Sep 2024, 13:31:39

. 
. bench_all, n_obs(1000)     n_levels(10)   n_rep(1000)
Number of observations (_N) was 0, now 1,000.
100 / 1000
200 / 1000
300 / 1000
400 / 1000
500 / 1000
600 / 1000
700 / 1000
800 / 1000
900 / 1000
1000 / 1000
  10:      0.30 /     1000 =       0.0003
  11:      0.26 /     1000 =       0.0003
  12:      0.16 /     1000 =       0.0002
  13:      0.18 /     1000 =       0.0002
  14:      0.65 /     1000 =       0.0006
  15:      0.35 /     1000 =       0.0004
  20:      0.42 /     1000 =       0.0004
  21:      0.27 /     1000 =       0.0003
  22:      0.23 /     1000 =       0.0002
  23:      0.25 /     1000 =       0.0002
  24:      0.58 /     1000 =       0.0006
  25:      0.35 /     1000 =       0.0004
  30:      0.61 /     1000 =       0.0006
  31:      0.50 /     1000 =       0.0005
  32:      0.53 /     1000 =       0.0005
  33:      0.52 /     1000 =       0.0005
  34:      0.50 /     1000 =       0.0005
  35:      0.74 /     1000 =       0.0007
  36:      0.55 /     1000 =       0.0005
  40:      0.30 /     1000 =       0.0003
  41:      0.23 /     1000 =       0.0002
  42:      0.17 /     1000 =       0.0002

. bench_all, n_obs(10000)    n_levels(10)   n_rep(100)
Number of observations (_N) was 0, now 10,000.
10 / 100
20 / 100
30 / 100
40 / 100
50 / 100
60 / 100
70 / 100
80 / 100
90 / 100
100 / 100
  10:      0.17 /      100 =       0.0017
  11:      0.26 /      100 =       0.0026
  12:      0.14 /      100 =       0.0014
  13:      0.13 /      100 =       0.0013
  14:      0.56 /      100 =       0.0056
  15:      0.33 /      100 =       0.0033
  20:      0.16 /      100 =       0.0016
  21:      0.29 /      100 =       0.0029
  22:      0.27 /      100 =       0.0027
  23:      0.27 /      100 =       0.0027
  24:      0.49 /      100 =       0.0049
  25:      0.32 /      100 =       0.0032
  30:      0.58 /      100 =       0.0058
  31:      0.50 /      100 =       0.0050
  32:      0.49 /      100 =       0.0049
  33:      0.49 /      100 =       0.0049
  34:      0.48 /      100 =       0.0048
  35:      0.66 /      100 =       0.0066
  36:      0.50 /      100 =       0.0050
  40:      0.16 /      100 =       0.0016
  41:      0.26 /      100 =       0.0026
  42:      0.13 /      100 =       0.0013

. bench_all, n_obs(100000)   n_levels(10)   n_rep(10)
Number of observations (_N) was 0, now 100,000.
1 / 10
2 / 10
3 / 10
4 / 10
5 / 10
6 / 10
7 / 10
8 / 10
9 / 10
10 / 10
  10:      0.11 /       10 =       0.0110
  11:      0.17 /       10 =       0.0175
  12:      0.14 /       10 =       0.0144
  13:      0.15 /       10 =       0.0150
  14:      0.57 /       10 =       0.0573
  15:      0.33 /       10 =       0.0333
  20:      0.11 /       10 =       0.0107
  21:      0.53 /       10 =       0.0525
  22:      0.49 /       10 =       0.0494
  23:      0.49 /       10 =       0.0487
  24:      0.52 /       10 =       0.0520
  25:      0.34 /       10 =       0.0343
  30:      0.94 /       10 =       0.0942
  31:      0.84 /       10 =       0.0836
  32:      0.83 /       10 =       0.0833
  33:      0.83 /       10 =       0.0827
  34:      0.84 /       10 =       0.0839
  35:      0.70 /       10 =       0.0697
  36:      0.51 /       10 =       0.0510
  40:      0.11 /       10 =       0.0114
  41:      0.16 /       10 =       0.0163
  42:      0.14 /       10 =       0.0140

. bench_all, n_obs(1000000)  n_levels(10)   n_rep(1)
Number of observations (_N) was 0, now 1,000,000.
1 / 1
  10:      0.08 /        1 =       0.0760
  11:      0.14 /        1 =       0.1370
  12:      0.13 /        1 =       0.1280
  13:      0.12 /        1 =       0.1200
  14:      0.54 /        1 =       0.5370
  15:      0.31 /        1 =       0.3110
  20:      0.07 /        1 =       0.0750
  21:      0.82 /        1 =       0.8190
  22:      0.79 /        1 =       0.7880
  23:      0.81 /        1 =       0.8060
  24:      0.47 /        1 =       0.4700
  25:      0.30 /        1 =       0.3020
  30:      1.76 /        1 =       1.7640
  31:      1.14 /        1 =       1.1360
  32:      1.37 /        1 =       1.3660
  33:      1.30 /        1 =       1.2990
  34:      1.50 /        1 =       1.5040
  35:      0.66 /        1 =       0.6580
  36:      0.48 /        1 =       0.4820
  40:      0.07 /        1 =       0.0750
  41:      0.14 /        1 =       0.1390
  42:      0.12 /        1 =       0.1200

. bench_all, n_obs(10000000) n_levels(10)   n_rep(1)
Number of observations (_N) was 0, now 10,000,000.
1 / 1
  10:      0.71 /        1 =       0.7140
  11:      1.37 /        1 =       1.3720
  12:      1.23 /        1 =       1.2340
  13:      1.23 /        1 =       1.2290
  14:      5.32 /        1 =       5.3170
  15:      3.07 /        1 =       3.0720
  20:      0.71 /        1 =       0.7120
  21:     13.65 /        1 =      13.6460
  22:     11.86 /        1 =      11.8580
  23:     12.67 /        1 =      12.6700
  24:      4.63 /        1 =       4.6350
  25:      3.01 /        1 =       3.0140
  30:     23.63 /        1 =      23.6300
  31:     23.87 /        1 =      23.8740
  32:     36.92 /        1 =      36.9220
  33:     36.18 /        1 =      36.1830
  34:     29.83 /        1 =      29.8260
  35:     10.17 /        1 =      10.1660
  36:      8.23 /        1 =       8.2280
  40:      1.02 /        1 =       1.0250
  41:      2.36 /        1 =       2.3600
  42:      2.29 /        1 =       2.2910

. 
. bench_all, n_obs(1000)     n_levels(100)  n_rep(1000)
Number of observations (_N) was 0, now 1,000.
100 / 1000
200 / 1000
300 / 1000
400 / 1000
500 / 1000
600 / 1000
700 / 1000
800 / 1000
900 / 1000
1000 / 1000
  10:      0.60 /     1000 =       0.0006
  11:      0.38 /     1000 =       0.0004
  12:      0.31 /     1000 =       0.0003
  13:      0.27 /     1000 =       0.0003
  14:      1.52 /     1000 =       0.0015
  15:      0.86 /     1000 =       0.0009
  20:      1.74 /     1000 =       0.0017
  21:      0.41 /     1000 =       0.0004
  22:      0.37 /     1000 =       0.0004
  23:      0.36 /     1000 =       0.0004
  24:      1.49 /     1000 =       0.0015
  25:      0.86 /     1000 =       0.0009
  30:      1.06 /     1000 =       0.0011
  31:      0.85 /     1000 =       0.0008
  32:      0.84 /     1000 =       0.0008
  33:      0.81 /     1000 =       0.0008
  34:      0.83 /     1000 =       0.0008
  35:      1.97 /     1000 =       0.0020
  36:      1.36 /     1000 =       0.0014
  40:      0.64 /     1000 =       0.0006
  41:      0.35 /     1000 =       0.0004
  42:      0.27 /     1000 =       0.0003

. bench_all, n_obs(10000)    n_levels(100)  n_rep(100)
Number of observations (_N) was 0, now 10,000.
10 / 100
20 / 100
30 / 100
40 / 100
50 / 100
60 / 100
70 / 100
80 / 100
90 / 100
100 / 100
  10:      0.40 /      100 =       0.0040
  11:      0.50 /      100 =       0.0050
  12:      0.23 /      100 =       0.0023
  13:      0.25 /      100 =       0.0025
  14:      1.20 /      100 =       0.0120
  15:      0.60 /      100 =       0.0060
  20:      0.79 /      100 =       0.0079
  21:      0.53 /      100 =       0.0053
  22:      0.49 /      100 =       0.0049
  23:      0.48 /      100 =       0.0048
  24:      1.14 /      100 =       0.0114
  25:      0.60 /      100 =       0.0060
  30:      1.00 /      100 =       0.0100
  31:      0.83 /      100 =       0.0083
  32:      0.82 /      100 =       0.0082
  33:      0.83 /      100 =       0.0083
  34:      0.85 /      100 =       0.0085
  35:      1.62 /      100 =       0.0162
  36:      0.97 /      100 =       0.0097
  40:      0.46 /      100 =       0.0046
  41:      0.54 /      100 =       0.0054
  42:      0.24 /      100 =       0.0024

. bench_all, n_obs(100000)   n_levels(100)  n_rep(10)
Number of observations (_N) was 0, now 100,000.
1 / 10
2 / 10
3 / 10
4 / 10
5 / 10
6 / 10
7 / 10
8 / 10
9 / 10
10 / 10
  10:      0.41 /       10 =       0.0407
  11:      0.33 /       10 =       0.0334
  12:      0.32 /       10 =       0.0318
  13:      0.33 /       10 =       0.0326
  14:      1.29 /       10 =       0.1294
  15:      0.66 /       10 =       0.0656
  20:      1.28 /       10 =       0.1283
  21:      1.01 /       10 =       0.1008
  22:      1.05 /       10 =       0.1048
  23:      1.03 /       10 =       0.1028
  24:      1.33 /       10 =       0.1335
  25:      0.71 /       10 =       0.0708
  30:      1.85 /       10 =       0.1851
  31:      1.54 /       10 =       0.1538
  32:      1.54 /       10 =       0.1536
  33:      1.51 /       10 =       0.1508
  34:      1.58 /       10 =       0.1577
  35:      9.76 /       10 =       0.9760
  36:      1.02 /       10 =       0.1021
  40:      0.38 /       10 =       0.0381
  41:      0.34 /       10 =       0.0336
  42:      0.31 /       10 =       0.0311

. bench_all, n_obs(1000000)  n_levels(100)  n_rep(1)
Number of observations (_N) was 0, now 1,000,000.
1 / 1
  10:      0.20 /        1 =       0.2000
  11:      0.21 /        1 =       0.2140
  12:      0.21 /        1 =       0.2120
  13:      0.25 /        1 =       0.2490
  14:      1.20 /        1 =       1.1950
  15:      0.52 /        1 =       0.5180
  20:      2.51 /        1 =       2.5100
  21:      2.05 /        1 =       2.0470
  22:      1.91 /        1 =       1.9080
  23:      1.86 /        1 =       1.8650
  24:      0.88 /        1 =       0.8750
  25:      0.52 /        1 =       0.5170
  30:      3.65 /        1 =       3.6550
  31:      2.34 /        1 =       2.3360
  32:      2.37 /        1 =       2.3700
  33:      2.28 /        1 =       2.2770
  34:      2.44 /        1 =       2.4430
  35:      1.52 /        1 =       1.5240
  36:      0.91 /        1 =       0.9140
  40:      0.27 /        1 =       0.2660
  41:      0.24 /        1 =       0.2380
  42:      0.19 /        1 =       0.1880

. bench_all, n_obs(10000000) n_levels(100)  n_rep(1)
Number of observations (_N) was 0, now 10,000,000.
1 / 1
  10:      2.57 /        1 =       2.5680
  11:      2.36 /        1 =       2.3570
  12:      2.49 /        1 =       2.4860
  13:      2.36 /        1 =       2.3590
  14:     11.65 /        1 =      11.6540
  15:      5.83 /        1 =       5.8280
  20:     55.91 /        1 =      55.9120
  21:     36.74 /        1 =      36.7420
  22:     37.05 /        1 =      37.0450
  23:     35.46 /        1 =      35.4560
  24:     10.72 /        1 =      10.7200
  25:      5.56 /        1 =       5.5580
  30:     64.78 /        1 =      64.7840
  31:     42.85 /        1 =      42.8540
  32:     40.67 /        1 =      40.6670
  33:     42.02 /        1 =      42.0230
  34:     42.21 /        1 =      42.2070
  35:     13.16 /        1 =      13.1560
  36:      5.60 /        1 =       5.5990
  40:      1.35 /        1 =       1.3480
  41:      1.45 /        1 =       1.4540
  42:      1.27 /        1 =       1.2740

. 
. bench_all, n_obs(1000)     n_levels(1000) n_rep(1000)
Number of observations (_N) was 0, now 1,000.
100 / 1000
200 / 1000
300 / 1000
400 / 1000
500 / 1000
600 / 1000
700 / 1000
800 / 1000
900 / 1000
1000 / 1000
  10:      1.32 /     1000 =       0.0013
  11:      0.36 /     1000 =       0.0004
  12:      0.23 /     1000 =       0.0002
  13:      0.17 /     1000 =       0.0002
  14:      7.94 /     1000 =       0.0079
  15:      2.11 /     1000 =       0.0021
  20:     37.72 /     1000 =       0.0377
  21:      0.47 /     1000 =       0.0005
  22:      0.39 /     1000 =       0.0004
  23:      0.35 /     1000 =       0.0004
  24:      8.04 /     1000 =       0.0080
  25:      2.15 /     1000 =       0.0022
  30:      1.34 /     1000 =       0.0013
  31:      0.64 /     1000 =       0.0006
  32:      0.57 /     1000 =       0.0006
  33:      0.67 /     1000 =       0.0007
  34:      0.64 /     1000 =       0.0006
  35:      9.25 /     1000 =       0.0092
  36:      2.92 /     1000 =       0.0029
  40:      1.40 /     1000 =       0.0014
  41:      0.33 /     1000 =       0.0003
  42:      0.22 /     1000 =       0.0002

. bench_all, n_obs(10000)    n_levels(1000) n_rep(100)
Number of observations (_N) was 0, now 10,000.
10 / 100
20 / 100
30 / 100
40 / 100
50 / 100
60 / 100
70 / 100
80 / 100
90 / 100
100 / 100
  10:      0.43 /      100 =       0.0043
  11:      0.43 /      100 =       0.0043
  12:      0.19 /      100 =       0.0019
  13:      0.17 /      100 =       0.0017
  14:      1.50 /      100 =       0.0150
  15:      0.58 /      100 =       0.0058
  20:      4.40 /      100 =       0.0440
  21:      0.43 /      100 =       0.0043
  22:      0.54 /      100 =       0.0054
  23:      0.54 /      100 =       0.0054
  24:      1.61 /      100 =       0.0161
  25:      0.57 /      100 =       0.0057
  30:      0.94 /      100 =       0.0094
  31:      0.65 /      100 =       0.0065
  32:      0.64 /      100 =       0.0064
  33:      0.68 /      100 =       0.0068
  34:      0.69 /      100 =       0.0069
  35:      1.78 /      100 =       0.0178
  36:      0.82 /      100 =       0.0082
  40:      0.42 /      100 =       0.0042
  41:      0.44 /      100 =       0.0044
  42:      0.20 /      100 =       0.0020

. bench_all, n_obs(100000)   n_levels(1000) n_rep(10)
Number of observations (_N) was 0, now 100,000.
1 / 10
2 / 10
3 / 10
4 / 10
5 / 10
6 / 10
7 / 10
8 / 10
9 / 10
10 / 10
  10:      0.23 /       10 =       0.0231
  11:      0.21 /       10 =       0.0213
  12:      0.19 /       10 =       0.0189
  13:      0.18 /       10 =       0.0178
  14:      0.81 /       10 =       0.0810
  15:      0.39 /       10 =       0.0389
  20:      1.21 /       10 =       0.1208
  21:      0.72 /       10 =       0.0720
  22:      0.69 /       10 =       0.0694
  23:      0.70 /       10 =       0.0705
  24:      0.90 /       10 =       0.0896
  25:      0.39 /       10 =       0.0391
  30:      1.15 /       10 =       0.1149
  31:      0.97 /       10 =       0.0973
  32:      0.97 /       10 =       0.0968
  33:      0.96 /       10 =       0.0964
  34:      0.97 /       10 =       0.0975
  35:      1.00 /       10 =       0.0996
  36:      0.59 /       10 =       0.0588
  40:      0.22 /       10 =       0.0223
  41:      0.19 /       10 =       0.0191
  42:      0.15 /       10 =       0.0147

. bench_all, n_obs(1000000)  n_levels(1000) n_rep(1)
Number of observations (_N) was 0, now 1,000,000.
1 / 1
  10:      0.16 /        1 =       0.1580
  11:      0.14 /        1 =       0.1440
  12:      0.15 /        1 =       0.1460
  13:      0.13 /        1 =       0.1270
  14:      0.69 /        1 =       0.6940
  15:      0.33 /        1 =       0.3310
  20:      1.78 /        1 =       1.7810
  21:      1.06 /        1 =       1.0560
  22:      1.16 /        1 =       1.1610
  23:      1.01 /        1 =       1.0130
  24:      0.71 /        1 =       0.7150
  25:      0.34 /        1 =       0.3370
  30:      2.29 /        1 =       2.2880
  31:      1.40 /        1 =       1.3970
  32:      1.39 /        1 =       1.3860
  33:      1.45 /        1 =       1.4540
  34:      1.41 /        1 =       1.4130
  35:      0.93 /        1 =       0.9330
  36:      0.54 /        1 =       0.5420
  40:      0.15 /        1 =       0.1540
  41:      0.16 /        1 =       0.1560
  42:      0.13 /        1 =       0.1250

. bench_all, n_obs(10000000) n_levels(1000) n_rep(1)
Number of observations (_N) was 0, now 10,000,000.
1 / 1
  10:      1.35 /        1 =       1.3550
  11:      1.40 /        1 =       1.4040
  12:      1.35 /        1 =       1.3540
  13:      1.23 /        1 =       1.2300
  14:      7.14 /        1 =       7.1440
  15:      3.35 /        1 =       3.3480
  20:     43.14 /        1 =      43.1360
  21:     36.11 /        1 =      36.1120
  22:     25.15 /        1 =      25.1530
  23:     23.99 /        1 =      23.9860
  24:      7.16 /        1 =       7.1580
  25:      3.48 /        1 =       3.4810
  30:     34.27 /        1 =      34.2650
  31:     21.59 /        1 =      21.5850
  32:     20.95 /        1 =      20.9460
  33:     20.25 /        1 =      20.2450
  34:     20.38 /        1 =      20.3790
  35:      9.10 /        1 =       9.1020
  36:      5.43 /        1 =       5.4330
  40:      1.39 /        1 =       1.3870
  41:      1.41 /        1 =       1.4090
  42:      1.34 /        1 =       1.3380

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_levelsof.log
  log type:  text
 closed on:  19 Sep 2024, 13:53:20
------------------------------------------------------------------------------------------------------------------------------------------------
