--------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  17 Sep 2024, 22:21:23

. 
. dis "`c(current_date)'"
17 Sep 2024

. dis "`c(current_time)'"
22:21:23

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. profile_obs_integer, obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.661     1000    0.000    0.001    0.001    0.016    0.001     4.77   100.00        .
        init          0.842     1000    0.000    0.001    0.001    0.007    0.001     6.08   127.38        .
       parse          1.753     1000    0.001    0.002    0.002    0.009    0.001    12.66   265.20        .
       check         10.313     1000    0.008    0.010    0.010    0.025    0.002    74.47  1560.21        .
        eval          0.851     1000    0.000    0.001    0.001    0.008    0.001     6.14   128.74        .
       total         13.849     1000    0.010    0.014    0.013    0.028    0.003   100.00  2095.16    0.013
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          6.055     1000    0.004    0.006    0.006    0.016    0.001    25.73   100.00        .
        init          4.954     1000    0.003    0.005    0.005    0.014    0.001    21.05    81.82        .
       parse          1.751     1000    0.001    0.002    0.002    0.008    0.001     7.44    28.92        .
       check          9.791     1000    0.008    0.010    0.009    0.027    0.002    41.60   161.70        .
        eval          6.947     1000    0.005    0.007    0.007    0.035    0.002    29.52   114.73        .
       total         23.535     1000    0.019    0.024    0.022    0.050    0.004   100.00   388.69    0.017
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          5.551      100    0.047    0.056    0.053    0.082    0.007    47.97   100.00        .
        init          4.699      100    0.040    0.047    0.045    0.074    0.007    40.61    84.65        .
       parse          0.183      100    0.001    0.002    0.002    0.007    0.001     1.58     3.30        .
       check          0.982      100    0.008    0.010    0.010    0.014    0.001     8.49    17.69        .
        eval          5.699      100    0.050    0.057    0.055    0.085    0.007    49.25   102.67        .
       total         11.571      100    0.103    0.116    0.111    0.150    0.012   100.00   208.45    0.060
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.879       10    0.455    0.488    0.479    0.538    0.027    52.65   100.00        .
        init          4.031       10    0.377    0.403    0.394    0.472    0.029    43.50    82.62        .
       parse          0.017       10    0.001    0.002    0.002    0.002    0.000     0.18     0.35        .
       check          0.107       10    0.009    0.011    0.010    0.015    0.002     1.15     2.19        .
        eval          5.112       10    0.481    0.511    0.502    0.557    0.026    55.16   104.78        .
       total          9.267       10    0.879    0.927    0.927    0.966    0.029   100.00   189.94    0.439
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          5.085        1    5.085    5.085    5.085    5.085        .    54.22   100.00        .
        init          4.226        1    4.226    4.226    4.226    4.226        .    45.06    83.11        .
       parse          0.002        1    0.002    0.002    0.002    0.002        .     0.02     0.04        .
       check          0.009        1    0.009    0.009    0.009    0.009        .     0.10     0.18        .
        eval          5.142        1    5.142    5.142    5.142    5.142        .    54.82   101.12        .
       total          9.379        1    9.379    9.379    9.379    9.379        .   100.00   184.44    4.294
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.660     1000    0.000    0.001    0.001    0.007    0.001     5.63   100.00        .
        init          0.394     1000    0.000    0.000    0.000    0.006    0.001     3.36    59.70        .
       parse          1.442     1000    0.001    0.001    0.001    0.007    0.001    12.30   218.48        .
       check          9.002     1000    0.007    0.009    0.009    0.019    0.001    76.78  1363.94        .
        eval          0.815     1000    0.000    0.001    0.001    0.010    0.001     6.95   123.48        .
       total         11.724     1000    0.010    0.012    0.011    0.028    0.002   100.00  1776.36    0.011
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          6.336     1000    0.005    0.006    0.006    0.014    0.001    33.96   100.00        .
        init          0.697     1000    0.000    0.001    0.001    0.006    0.001     3.74    11.00        .
       parse          1.500     1000    0.001    0.002    0.001    0.005    0.001     8.04    23.67        .
       check          9.217     1000    0.007    0.009    0.009    0.019    0.002    49.40   145.47        .
        eval          7.157     1000    0.005    0.007    0.007    0.023    0.002    38.36   112.96        .
       total         18.658     1000    0.015    0.019    0.018    0.039    0.003   100.00   294.48    0.012
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          6.604      100    0.025    0.066    0.080    0.184    0.031    83.25   100.00        .
        init          0.417      100    0.002    0.004    0.004    0.009    0.002     5.26     6.31        .
       parse          0.152      100    0.000    0.002    0.001    0.004    0.001     1.92     2.30        .
       check          0.809      100    0.004    0.008    0.008    0.016    0.003    10.20    12.25        .
        eval          6.541      100    0.026    0.065    0.082    0.158    0.030    82.45    99.05        .
       total          7.933      100    0.033    0.079    0.097    0.185    0.034   100.00   120.12    0.013
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.473       10    0.234    0.247    0.243    0.286    0.015    86.17   100.00        .
        init          0.067       10    0.006    0.007    0.006    0.008    0.001     2.33     2.71        .
       parse          0.011       10    0.001    0.001    0.001    0.002    0.000     0.38     0.44        .
       check          0.046       10    0.004    0.005    0.004    0.006    0.001     1.60     1.86        .
        eval          2.746       10    0.238    0.275    0.251    0.341    0.040    95.68   111.04        .
       total          2.870       10    0.251    0.287    0.262    0.353    0.040   100.00   116.05    0.040
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.691        1    2.691    2.691    2.691    2.691        .    97.39   100.00        .
        init          0.075        1    0.075    0.075    0.075    0.075        .     2.71     2.79        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
       check          0.005        1    0.005    0.005    0.005    0.005        .     0.18     0.19        .
        eval          2.682        1    2.682    2.682    2.682    2.682        .    97.07    99.67        .
       total          2.763        1    2.763    2.763    2.763    2.763        .   100.00   102.68    0.072
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.370     1000    0.000    0.000    0.000    0.003    0.000     7.12   100.00        .
        init          0.989     1000    0.000    0.001    0.001    0.003    0.000    19.03   267.30        .
       parse          0.738     1000    0.000    0.001    0.001    0.003    0.001    14.20   199.46        .
       check          3.093     1000    0.002    0.003    0.003    0.014    0.001    59.53   835.95        .
        eval          0.339     1000    0.000    0.000    0.000    0.002    0.000     6.52    91.62        .
       total          5.196     1000    0.004    0.005    0.005    0.017    0.002   100.00  1404.32    0.005
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.561     1000    0.001    0.003    0.002    0.012    0.001    17.38   100.00        .
        init          8.298     1000    0.006    0.008    0.008    0.019    0.002    56.30   324.01        .
       parse          0.757     1000    0.000    0.001    0.001    0.003    0.001     5.14    29.56        .
       check          3.030     1000    0.002    0.003    0.003    0.011    0.001    20.56   118.31        .
        eval          2.595     1000    0.002    0.003    0.002    0.011    0.001    17.61   101.33        .
       total         14.738     1000    0.011    0.015    0.014    0.032    0.003   100.00   575.48    0.012
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.469      100    0.020    0.025    0.023    0.046    0.006    19.48   100.00        .
        init          9.800      100    0.082    0.098    0.091    0.175    0.018    77.31   396.92        .
       parse          0.079      100    0.000    0.001    0.001    0.002    0.001     0.62     3.20        .
       check          0.306      100    0.002    0.003    0.003    0.006    0.001     2.41    12.39        .
        eval          2.486      100    0.020    0.025    0.023    0.050    0.006    19.61   100.69        .
       total         12.677      100    0.107    0.127    0.118    0.207    0.023   100.00   513.45    0.102
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.399       10    0.214    0.240    0.226    0.325    0.034    11.27   100.00        .
        init         18.728       10    1.685    1.873    1.854    2.040    0.102    88.00   780.66        .
       parse          0.008       10    0.000    0.001    0.001    0.001    0.000     0.04     0.33        .
       check          0.029       10    0.002    0.003    0.003    0.004    0.001     0.14     1.21        .
        eval          2.514       10    0.217    0.251    0.235    0.327    0.041    11.81   104.79        .
       total         21.281       10    1.929    2.128    2.114    2.288    0.103   100.00   887.08    1.888
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.443        1    2.443    2.443    2.443    2.443        .     5.87   100.00        .
        init         39.122        1   39.122   39.122   39.122   39.122        .    94.00  1601.39        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.04        .
       check          0.004        1    0.004    0.004    0.004    0.004        .     0.01     0.16        .
        eval          2.493        1    2.493    2.493    2.493    2.493        .     5.99   102.05        .
       total         41.621        1   41.621   41.621   41.621   41.621        .   100.00  1703.68   39.178
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.393     1000    0.000    0.000    0.000    0.002    0.000    25.69   100.00        .
        init          0.151     1000    0.000    0.000    0.000    0.004    0.000     9.87    38.42        .
       parse          0.866     1000    0.000    0.001    0.001    0.005    0.001    56.60   220.36        .
       check          0.009     1000    0.000    0.000    0.000    0.001    0.000     0.59     2.29        .
        eval          0.464     1000    0.000    0.000    0.000    0.002    0.001    30.33   118.07        .
       total          1.530     1000    0.001    0.002    0.001    0.006    0.001   100.00   389.31    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.832     1000    0.002    0.003    0.003    0.008    0.001    75.06   100.00        .
        init          0.136     1000    0.000    0.000    0.000    0.002    0.000     3.60     4.80        .
       parse          0.782     1000    0.000    0.001    0.001    0.005    0.001    20.73    27.61        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.11     0.14        .
        eval          2.804     1000    0.002    0.003    0.003    0.010    0.001    74.32    99.01        .
       total          3.773     1000    0.002    0.004    0.003    0.014    0.001   100.00   133.23    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.573      100    0.020    0.026    0.024    0.046    0.006    93.84   100.00        .
        init          0.017      100    0.000    0.000    0.000    0.001    0.000     0.62     0.66        .
       parse          0.084      100    0.000    0.001    0.001    0.002    0.001     3.06     3.26        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.636      100    0.021    0.026    0.024    0.050    0.006    96.13   102.45        .
       total          2.742      100    0.022    0.027    0.025    0.051    0.006   100.00   106.57    0.002
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.765       10    0.227    0.277    0.242    0.360    0.051   108.52   100.00        .
        init          0.003       10    0.000    0.000    0.000    0.001    0.000     0.12     0.11        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.20     0.18        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.539       10    0.236    0.254    0.251    0.273    0.012    99.65    91.83        .
       total          2.548       10    0.237    0.255    0.252    0.274    0.012   100.00    92.15   -0.022
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.439        1    2.439    2.439    2.439    2.439        .    91.55   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          2.663        1    2.663    2.663    2.663    2.663        .    99.96   109.18        .
       total          2.664        1    2.664    2.664    2.664    2.664        .   100.00   109.23    0.225
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.441     1000    0.000    0.000    0.000    0.003    0.001    29.38   100.00        .
        init          0.137     1000    0.000    0.000    0.000    0.001    0.000     9.13    31.07        .
       parse          0.824     1000    0.000    0.001    0.001    0.004    0.001    54.90   186.85        .
       check          0.005     1000    0.000    0.000    0.000    0.001    0.000     0.33     1.13        .
        eval          0.484     1000    0.000    0.000    0.000    0.003    0.001    32.25   109.75        .
       total          1.501     1000    0.001    0.002    0.001    0.005    0.001   100.00   340.36    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.246     1000    0.002    0.003    0.003    0.012    0.001    72.94   100.00        .
        init          0.137     1000    0.000    0.000    0.000    0.001    0.000     3.08     4.22        .
       parse          0.757     1000    0.000    0.001    0.001    0.005    0.001    17.01    23.32        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.09     0.12        .
        eval          3.515     1000    0.002    0.004    0.003    0.012    0.001    78.99   108.29        .
       total          4.450     1000    0.003    0.004    0.004    0.015    0.002   100.00   137.09    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.847      100    0.040    0.048    0.044    0.081    0.010    96.86   100.00        .
        init          0.019      100    0.000    0.000    0.000    0.001    0.000     0.38     0.39        .
       parse          0.083      100    0.000    0.001    0.001    0.003    0.001     1.66     1.71        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          4.890      100    0.041    0.049    0.045    0.089    0.009    97.72   100.89        .
       total          5.004      100    0.042    0.050    0.046    0.090    0.010   100.00   103.24    0.002
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.745       10    0.235    0.275    0.254    0.335    0.036   103.12   100.00        .
        init          0.002       10    0.000    0.000    0.000    0.001    0.000     0.08     0.07        .
       parse          0.009       10    0.000    0.001    0.001    0.001    0.000     0.34     0.33        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.649       10    0.241    0.265    0.250    0.321    0.025    99.51    96.50        .
       total          2.662       10    0.243    0.266    0.251    0.323    0.026   100.00    96.98   -0.008
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.697        1    2.697    2.697    2.697    2.697        .    99.78   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          2.702        1    2.702    2.702    2.702    2.702        .    99.96   100.19        .
       total          2.703        1    2.703    2.703    2.703    2.703        .   100.00   100.22    0.006
--------------------------------------------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.378     1000    0.000    0.000    0.000    0.004    0.001    30.26   100.00        .
        init          0.142     1000    0.000    0.000    0.000    0.001    0.000    11.37    37.57        .
       parse          0.674     1000    0.000    0.001    0.001    0.005    0.001    53.96   178.31        .
       check          0.017     1000    0.000    0.000    0.000    0.001    0.000     1.36     4.50        .
        eval          0.367     1000    0.000    0.000    0.000    0.002    0.000    29.38    97.09        .
       total          1.249     1000    0.000    0.001    0.001    0.006    0.001   100.00   330.42    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.520     1000    0.001    0.003    0.002    0.012    0.001    73.43   100.00        .
        init          0.109     1000    0.000    0.000    0.000    0.001    0.000     3.18     4.33        .
       parse          0.701     1000    0.000    0.001    0.001    0.005    0.001    20.43    27.82        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.17     0.24        .
        eval          2.571     1000    0.002    0.003    0.002    0.007    0.001    74.91   102.02        .
       total          3.432     1000    0.002    0.003    0.003    0.009    0.001   100.00   136.19    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.365      100    0.020    0.024    0.022    0.049    0.005    95.40   100.00        .
        init          0.017      100    0.000    0.000    0.000    0.001    0.000     0.69     0.72        .
       parse          0.071      100    0.000    0.001    0.001    0.002    0.001     2.86     3.00        .
       check          0.001      100    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
        eval          2.383      100    0.020    0.024    0.022    0.043    0.004    96.13   100.76        .
       total          2.479      100    0.021    0.025    0.023    0.044    0.005   100.00   104.82    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.483       10    0.214    0.248    0.225    0.312    0.038    97.60   100.00        .
        init          0.002       10    0.000    0.000    0.000    0.001    0.000     0.08     0.08        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.24     0.24        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.536       10    0.218    0.254    0.223    0.327    0.045    99.69   102.13        .
       total          2.544       10    0.219    0.254    0.224    0.327    0.044   100.00   102.46    0.006
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.273        1    2.273    2.273    2.273    2.273        .    96.35   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          2.359        1    2.359    2.359    2.359    2.359        .   100.00   103.78        .
       total          2.359        1    2.359    2.359    2.359    2.359        .   100.00   103.78    0.086
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  17 Sep 2024, 22:28:13
--------------------------------------------------------------------------------------------------------------------------------------------------------
