---------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  18 Sep 2024, 16:35:36

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. profile_obs_integer, obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.229     1000    0.000    0.000    0.000    0.003    0.000     4.55   100.00        .
        init          0.344     1000    0.000    0.000    0.000    0.003    0.000     6.83   150.22        .
       parse          0.684     1000    0.000    0.001    0.001    0.005    0.001    13.59   298.69        .
       check          3.566     1000    0.002    0.004    0.003    0.011    0.001    70.85  1557.21        .
        eval          0.412     1000    0.000    0.000    0.000    0.005    0.001     8.19   179.91        .
       total          5.033     1000    0.003    0.005    0.005    0.011    0.001   100.00  2197.82    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.230     1000    0.001    0.002    0.002    0.015    0.001    23.48   100.00        .
        init          2.040     1000    0.001    0.002    0.002    0.008    0.001    21.48    91.48        .
       parse          0.690     1000    0.000    0.001    0.001    0.004    0.001     7.27    30.94        .
       check          3.661     1000    0.002    0.004    0.003    0.010    0.001    38.55   164.17        .
        eval          3.070     1000    0.001    0.003    0.002    0.013    0.002    32.33   137.67        .
       total          9.497     1000    0.006    0.009    0.009    0.023    0.002   100.00   425.87    0.007
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.078      100    0.025    0.031    0.029    0.054    0.004    52.92   100.00        .
        init          2.144      100    0.016    0.021    0.021    0.032    0.003    36.86    69.66        .
       parse          0.080      100    0.000    0.001    0.001    0.005    0.001     1.38     2.60        .
       check          0.350      100    0.002    0.004    0.003    0.007    0.001     6.02    11.37        .
        eval          3.237      100    0.027    0.032    0.031    0.046    0.004    55.66   105.17        .
       total          5.816      100    0.051    0.058    0.057    0.079    0.005   100.00   188.95    0.027
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.638       10    0.157    0.164    0.163    0.170    0.004    51.90   100.00        .
        init          1.460       10    0.139    0.146    0.141    0.159    0.007    46.26    89.13        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.16     0.31        .
       check          0.041       10    0.002    0.004    0.004    0.007    0.002     1.30     2.50        .
        eval          1.648       10    0.160    0.165    0.164    0.173    0.004    52.22   100.61        .
       total          3.156       10    0.305    0.316    0.312    0.330    0.009   100.00   192.67    0.152
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.612        1    1.612    1.612    1.612    1.612        .    53.40   100.00        .
        init          1.383        1    1.383    1.383    1.383    1.383        .    45.81    85.79        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.005        1    0.005    0.005    0.005    0.005        .     0.17     0.31        .
        eval          1.631        1    1.631    1.631    1.631    1.631        .    54.02   101.18        .
       total          3.019        1    3.019    3.019    3.019    3.019        .   100.00   187.28    1.407
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.238     1000    0.000    0.000    0.000    0.002    0.000     5.11   100.00        .
        init          0.182     1000    0.000    0.000    0.000    0.002    0.000     3.91    76.47        .
       parse          0.562     1000    0.000    0.001    0.001    0.002    0.001    12.06   236.13        .
       check          3.417     1000    0.002    0.003    0.003    0.009    0.001    73.33  1435.71        .
        eval          0.467     1000    0.000    0.000    0.000    0.004    0.001    10.02   196.22        .
       total          4.660     1000    0.003    0.005    0.004    0.011    0.001   100.00  1957.98    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.481     1000    0.001    0.002    0.002    0.012    0.001    32.43   100.00        .
        init          0.417     1000    0.000    0.000    0.000    0.008    0.001     5.45    16.81        .
       parse          0.595     1000    0.000    0.001    0.001    0.004    0.001     7.78    23.98        .
       check          3.337     1000    0.002    0.003    0.003    0.012    0.001    43.62   134.50        .
        eval          3.265     1000    0.001    0.003    0.003    0.012    0.002    42.68   131.60        .
       total          7.650     1000    0.005    0.008    0.007    0.018    0.002   100.00   308.34    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.078      100    0.035    0.041    0.040    0.050    0.004    82.22   100.00        .
        init          0.363      100    0.002    0.004    0.003    0.009    0.002     7.32     8.90        .
       parse          0.068      100    0.000    0.001    0.001    0.004    0.001     1.37     1.67        .
       check          0.339      100    0.002    0.003    0.003    0.011    0.001     6.83     8.31        .
        eval          4.186      100    0.036    0.042    0.042    0.057    0.003    84.40   102.65        .
       total          4.960      100    0.043    0.050    0.049    0.067    0.004   100.00   121.63    0.009
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.652       10    0.160    0.165    0.164    0.173    0.004    92.29   100.00        .
        init          0.070       10    0.005    0.007    0.007    0.008    0.001     3.91     4.24        .
       parse          0.007       10    0.000    0.001    0.001    0.002    0.001     0.39     0.42        .
       check          0.033       10    0.002    0.003    0.003    0.007    0.001     1.84     2.00        .
        eval          1.680       10    0.164    0.168    0.168    0.173    0.003    93.85   101.69        .
       total          1.790       10    0.173    0.179    0.178    0.185    0.003   100.00   108.35    0.014
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.650        1    1.650    1.650    1.650    1.650        .    97.06   100.00        .
        init          0.048        1    0.048    0.048    0.048    0.048        .     2.82     2.91        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.06        .
       check          0.003        1    0.003    0.003    0.003    0.003        .     0.18     0.18        .
        eval          1.648        1    1.648    1.648    1.648    1.648        .    96.94    99.88        .
       total          1.700        1    1.700    1.700    1.700    1.700        .   100.00   103.03    0.050
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.229     1000    0.000    0.000    0.000    0.002    0.000     6.23   100.00        .
        init          0.639     1000    0.000    0.001    0.001    0.003    0.001    17.39   279.04        .
       parse          0.594     1000    0.000    0.001    0.001    0.008    0.001    16.17   259.39        .
       check          2.067     1000    0.001    0.002    0.002    0.007    0.001    56.26   902.62        .
        eval          0.342     1000    0.000    0.000    0.000    0.002    0.000     9.31   149.34        .
       total          3.674     1000    0.002    0.004    0.003    0.010    0.001   100.00  1604.37    0.003
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.653     1000    0.001    0.002    0.002    0.008    0.001    16.21   100.00        .
        init          5.816     1000    0.004    0.006    0.005    0.015    0.001    57.03   351.85        .
       parse          0.615     1000    0.000    0.001    0.001    0.006    0.001     6.03    37.21        .
       check          2.045     1000    0.001    0.002    0.002    0.007    0.001    20.05   123.71        .
        eval          1.691     1000    0.001    0.002    0.002    0.007    0.001    16.58   102.30        .
       total         10.199     1000    0.008    0.010    0.010    0.022    0.002   100.00   617.00    0.009
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.565      100    0.012    0.016    0.015    0.029    0.003    15.84   100.00        .
        init          8.046      100    0.054    0.080    0.073    0.310    0.031    81.46   514.12        .
       parse          0.051      100    0.000    0.001    0.000    0.002    0.001     0.52     3.26        .
       check          0.219      100    0.001    0.002    0.002    0.008    0.001     2.22    13.99        .
        eval          1.553      100    0.012    0.016    0.015    0.027    0.003    15.72    99.23        .
       total          9.877      100    0.069    0.099    0.092    0.326    0.032   100.00   631.12    0.083
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.477       10    0.144    0.148    0.146    0.156    0.004     7.16   100.00        .
        init         19.103       10    1.734    1.910    1.968    2.126    0.153    92.63  1293.36        .
       parse          0.012       10    0.000    0.001    0.001    0.003    0.001     0.06     0.81        .
       check          0.017       10    0.001    0.002    0.002    0.002    0.000     0.08     1.15        .
        eval          1.487       10    0.143    0.149    0.149    0.154    0.004     7.21   100.68        .
       total         20.622       10    1.885    2.062    2.114    2.273    0.153   100.00  1396.21    1.914
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.500        1    1.500    1.500    1.500    1.500        .     4.20   100.00        .
        init         34.127        1   34.127   34.127   34.127   34.127        .    95.54  2275.13        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.07        .
       check          0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.13        .
        eval          1.590        1    1.590    1.590    1.590    1.590        .     4.45   106.00        .
       total         35.720        1   35.720   35.720   35.720   35.720        .   100.00  2381.33   34.220
--------------------------------------------------------------------------------------------------------------

. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.224     1000    0.000    0.000    0.000    0.002    0.000    21.98   100.00        .
        init          0.096     1000    0.000    0.000    0.000    0.001    0.000     9.42    42.86        .
       parse          0.584     1000    0.000    0.001    0.001    0.003    0.001    57.31   260.71        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.59     2.68        .
        eval          0.307     1000    0.000    0.000    0.000    0.003    0.000    30.13   137.05        .
       total          1.019     1000    0.000    0.001    0.001    0.004    0.001   100.00   454.91    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.631     1000    0.001    0.002    0.002    0.005    0.001    66.71   100.00        .
        init          0.086     1000    0.000    0.000    0.000    0.001    0.000     3.52     5.27        .
       parse          0.567     1000    0.000    0.001    0.001    0.002    0.001    23.19    34.76        .
       check          0.007     1000    0.000    0.000    0.000    0.001    0.000     0.29     0.43        .
        eval          1.754     1000    0.001    0.002    0.002    0.007    0.001    71.74   107.54        .
       total          2.445     1000    0.001    0.002    0.002    0.009    0.001   100.00   149.91    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.576      100    0.013    0.016    0.015    0.027    0.002    92.00   100.00        .
        init          0.014      100    0.000    0.000    0.000    0.001    0.000     0.82     0.89        .
       parse          0.064      100    0.000    0.001    0.001    0.005    0.001     3.74     4.06        .
       check          0.001      100    0.000    0.000    0.000    0.001    0.000     0.06     0.06        .
        eval          1.629      100    0.014    0.016    0.016    0.025    0.002    95.10   103.36        .
       total          1.713      100    0.015    0.017    0.017    0.027    0.002   100.00   108.69    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.569       10    0.152    0.157    0.156    0.161    0.003    97.70   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.06     0.06        .
       parse          0.009       10    0.000    0.001    0.001    0.002    0.001     0.56     0.57        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.596       10    0.156    0.160    0.159    0.165    0.003    99.38   101.72        .
       total          1.606       10    0.157    0.161    0.160    0.166    0.003   100.00   102.36    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.567        1    1.567    1.567    1.567    1.567        .    98.93   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.584        1    1.584    1.584    1.584    1.584        .   100.00   101.08        .
       total          1.584        1    1.584    1.584    1.584    1.584        .   100.00   101.08    0.017
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.270     1000    0.000    0.000    0.000    0.006    0.000    23.81   100.00        .
        init          0.100     1000    0.000    0.000    0.000    0.001    0.000     8.82    37.04        .
       parse          0.619     1000    0.000    0.001    0.001    0.005    0.001    54.59   229.26        .
       check          0.005     1000    0.000    0.000    0.000    0.001    0.000     0.44     1.85        .
        eval          0.371     1000    0.000    0.000    0.000    0.002    0.001    32.72   137.41        .
       total          1.134     1000    0.000    0.001    0.001    0.006    0.001   100.00   420.00    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.337     1000    0.001    0.002    0.002    0.008    0.001    65.13   100.00        .
        init          0.103     1000    0.000    0.000    0.000    0.001    0.000     2.87     4.41        .
       parse          0.561     1000    0.000    0.001    0.001    0.005    0.001    15.64    24.01        .
       check          0.007     1000    0.000    0.000    0.000    0.001    0.000     0.20     0.30        .
        eval          2.881     1000    0.001    0.003    0.002    0.013    0.002    80.30   123.28        .
       total          3.588     1000    0.002    0.004    0.003    0.013    0.002   100.00   153.53    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.098      100    0.036    0.041    0.040    0.056    0.004    96.04   100.00        .
        init          0.012      100    0.000    0.000    0.000    0.001    0.000     0.28     0.29        .
       parse          0.062      100    0.000    0.001    0.001    0.002    0.001     1.45     1.51        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          4.190      100    0.036    0.042    0.041    0.059    0.004    98.20   102.24        .
       total          4.267      100    0.036    0.043    0.042    0.060    0.004   100.00   104.12    0.002
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.775       10    0.162    0.177    0.173    0.202    0.013   103.02   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.007       10    0.000    0.001    0.000    0.002    0.001     0.41     0.39        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.716       10    0.167    0.172    0.170    0.180    0.004    99.59    96.68        .
       total          1.723       10    0.167    0.172    0.171    0.181    0.005   100.00    97.07   -0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.634        1    1.634    1.634    1.634    1.634        .   100.00   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.634        1    1.634    1.634    1.634    1.634        .   100.00   100.00        .
       total          1.634        1    1.634    1.634    1.634    1.634        .   100.00   100.00    0.000
--------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.208     1000    0.000    0.000    0.000    0.006    0.000    23.69   100.00        .
        init          0.101     1000    0.000    0.000    0.000    0.001    0.000    11.50    48.56        .
       parse          0.486     1000    0.000    0.000    0.000    0.004    0.001    55.35   233.65        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.46     1.92        .
        eval          0.248     1000    0.000    0.000    0.000    0.005    0.000    28.25   119.23        .
       total          0.878     1000    0.000    0.001    0.001    0.006    0.001   100.00   422.12    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.584     1000    0.001    0.002    0.002    0.005    0.001    70.28   100.00        .
        init          0.115     1000    0.000    0.000    0.000    0.001    0.000     5.10     7.26        .
       parse          0.501     1000    0.000    0.001    0.000    0.002    0.001    22.23    31.63        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.27     0.38        .
        eval          1.599     1000    0.001    0.002    0.002    0.007    0.001    70.94   100.95        .
       total          2.254     1000    0.001    0.002    0.002    0.007    0.001   100.00   142.30    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.506      100    0.012    0.015    0.015    0.020    0.001    94.96   100.00        .
        init          0.013      100    0.000    0.000    0.000    0.001    0.000     0.82     0.86        .
       parse          0.050      100    0.000    0.001    0.000    0.001    0.001     3.15     3.32        .
       check          0.003      100    0.000    0.000    0.000    0.001    0.000     0.19     0.20        .
        eval          1.516      100    0.013    0.015    0.015    0.021    0.002    95.59   100.66        .
       total          1.586      100    0.013    0.016    0.016    0.022    0.002   100.00   105.31    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.495       10    0.143    0.149    0.146    0.165    0.007    96.95   100.00        .
        init          0.002       10    0.000    0.000    0.000    0.001    0.000     0.13     0.13        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.45     0.47        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.532       10    0.144    0.153    0.154    0.165    0.006    99.35   102.47        .
       total          1.542       10    0.145    0.154    0.155    0.166    0.006   100.00   103.14    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.554        1    1.554    1.554    1.554    1.554        .    94.76   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.640        1    1.640    1.640    1.640    1.640        .   100.00   105.53        .
       total          1.640        1    1.640    1.640    1.640    1.640        .   100.00   105.53    0.086
--------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  18 Sep 2024, 16:39:44
---------------------------------------------------------------------------------------------------------------------------------------------------------------
