--------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  11 Sep 2024, 19:49:36

. 
. dis "`c(current_date)'"
11 Sep 2024

. dis "`c(current_time)'"
19:49:36

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. profile_obs_integer, obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.236     1000    0.000    0.000    0.000    0.002    0.000     4.08   100.00        .
        init          0.331     1000    0.000    0.000    0.000    0.003    0.000     5.73   140.25        .
       parse          0.733     1000    0.000    0.001    0.001    0.005    0.001    12.69   310.59        .
       check          4.338     1000    0.002    0.004    0.004    0.011    0.002    75.08  1838.14        .
        eval          0.339     1000    0.000    0.000    0.000    0.003    0.000     5.87   143.64        .
       total          5.778     1000    0.003    0.006    0.005    0.014    0.002   100.00  2448.31    0.006
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.851     1000    0.001    0.002    0.002    0.009    0.001    23.68   100.00        .
        init          1.688     1000    0.001    0.002    0.002    0.007    0.001    21.59    91.19        .
       parse          0.682     1000    0.000    0.001    0.001    0.011    0.001     8.72    36.84        .
       check          3.478     1000    0.002    0.003    0.003    0.010    0.001    44.49   187.90        .
        eval          1.930     1000    0.001    0.002    0.002    0.012    0.001    24.69   104.27        .
       total          7.818     1000    0.006    0.008    0.007    0.022    0.002   100.00   422.37    0.006
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.170      100    0.020    0.022    0.021    0.039    0.002    52.42   100.00        .
        init          1.553      100    0.014    0.016    0.015    0.023    0.001    37.51    71.57        .
       parse          0.055      100    0.000    0.001    0.001    0.001    0.000     1.33     2.53        .
       check          0.300      100    0.002    0.003    0.003    0.006    0.000     7.25    13.82        .
        eval          2.228      100    0.021    0.022    0.022    0.033    0.002    53.82   102.67        .
       total          4.140      100    0.039    0.041    0.040    0.059    0.003   100.00   190.78    0.020
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.355       10    0.132    0.136    0.134    0.141    0.003    51.50   100.00        .
        init          1.209       10    0.117    0.121    0.120    0.128    0.003    45.95    89.23        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.23     0.44        .
       check          0.034       10    0.003    0.003    0.003    0.007    0.001     1.29     2.51        .
        eval          1.382       10    0.135    0.138    0.136    0.151    0.005    52.53   101.99        .
       total          2.631       10    0.258    0.263    0.260    0.275    0.006   100.00   194.17    0.128
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.372        1    1.372    1.372    1.372    1.372        .    53.64   100.00        .
        init          1.161        1    1.161    1.161    1.161    1.161        .    45.39    84.62        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.07        .
       check          0.003        1    0.003    0.003    0.003    0.003        .     0.12     0.22        .
        eval          1.393        1    1.393    1.393    1.393    1.393        .    54.46   101.53        .
       total          2.558        1    2.558    2.558    2.558    2.558        .   100.00   186.44    1.186
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.184     1000    0.000    0.000    0.000    0.001    0.000     4.97   100.00        .
        init          0.117     1000    0.000    0.000    0.000    0.001    0.000     3.16    63.59        .
       parse          0.458     1000    0.000    0.000    0.000    0.002    0.001    12.37   248.91        .
       check          2.876     1000    0.002    0.003    0.003    0.005    0.000    77.69  1563.04        .
        eval          0.222     1000    0.000    0.000    0.000    0.001    0.000     6.00   120.65        .
       total          3.702     1000    0.003    0.004    0.004    0.007    0.001   100.00  2011.96    0.004
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.621     1000    0.001    0.002    0.002    0.004    0.001    30.17   100.00        .
        init          0.187     1000    0.000    0.000    0.000    0.001    0.000     3.48    11.54        .
       parse          0.500     1000    0.000    0.001    0.000    0.001    0.001     9.31    30.85        .
       check          2.896     1000    0.002    0.003    0.003    0.007    0.000    53.90   178.66        .
        eval          1.762     1000    0.001    0.002    0.002    0.004    0.000    32.79   108.70        .
       total          5.373     1000    0.005    0.005    0.005    0.011    0.001   100.00   331.46    0.004
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.944      100    0.028    0.029    0.029    0.036    0.001    81.98   100.00        .
        init          0.249      100    0.002    0.002    0.002    0.010    0.001     6.93     8.46        .
       parse          0.054      100    0.000    0.001    0.001    0.001    0.001     1.50     1.83        .
       check          0.292      100    0.002    0.003    0.003    0.004    0.000     8.13     9.92        .
        eval          2.992      100    0.028    0.030    0.029    0.034    0.001    83.32   101.63        .
       total          3.591      100    0.034    0.036    0.035    0.047    0.002   100.00   121.98    0.006
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.404       10    0.136    0.140    0.139    0.152    0.005    94.29   100.00        .
        init          0.053       10    0.005    0.005    0.005    0.006    0.000     3.56     3.77        .
       parse          0.009       10    0.000    0.001    0.001    0.003    0.001     0.60     0.64        .
       check          0.026       10    0.002    0.003    0.003    0.003    0.001     1.75     1.85        .
        eval          1.400       10    0.138    0.140    0.139    0.145    0.002    94.02    99.72        .
       total          1.489       10    0.146    0.149    0.148    0.155    0.003   100.00   106.05    0.008
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.387        1    1.387    1.387    1.387    1.387        .    96.93   100.00        .
        init          0.047        1    0.047    0.047    0.047    0.047        .     3.28     3.39        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.07        .
       check          0.003        1    0.003    0.003    0.003    0.003        .     0.21     0.22        .
        eval          1.380        1    1.380    1.380    1.380    1.380        .    96.44    99.50        .
       total          1.431        1    1.431    1.431    1.431    1.431        .   100.00   103.17    0.044
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.161     1000    0.000    0.000    0.000    0.002    0.000     5.52   100.00        .
        init          0.559     1000    0.000    0.001    0.001    0.001    0.000    19.16   347.20        .
       parse          0.428     1000    0.000    0.000    0.000    0.004    0.001    14.67   265.84        .
       check          1.709     1000    0.001    0.002    0.002    0.004    0.000    58.57  1061.49        .
        eval          0.192     1000    0.000    0.000    0.000    0.002    0.000     6.58   119.25        .
       total          2.918     1000    0.002    0.003    0.003    0.007    0.000   100.00  1812.42    0.003
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.349     1000    0.001    0.001    0.001    0.003    0.000    16.56   100.00        .
        init          4.577     1000    0.004    0.005    0.005    0.008    0.001    56.19   339.29        .
       parse          0.483     1000    0.000    0.000    0.000    0.003    0.001     5.93    35.80        .
       check          1.707     1000    0.001    0.002    0.002    0.004    0.000    20.96   126.54        .
        eval          1.353     1000    0.001    0.001    0.001    0.003    0.000    16.61   100.30        .
       total          8.146     1000    0.007    0.008    0.008    0.015    0.001   100.00   603.85    0.007
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.278      100    0.012    0.013    0.013    0.015    0.001    18.25   100.00        .
        init          5.475      100    0.052    0.055    0.054    0.068    0.003    78.19   428.40        .
       parse          0.062      100    0.000    0.001    0.001    0.001    0.000     0.89     4.85        .
       check          0.172      100    0.001    0.002    0.002    0.003    0.000     2.46    13.46        .
        eval          1.291      100    0.012    0.013    0.013    0.016    0.001    18.44   101.02        .
       total          7.002      100    0.067    0.070    0.069    0.087    0.003   100.00   547.89    0.057
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.281       10    0.125    0.128    0.127    0.136    0.003    11.68   100.00        .
        init          9.631       10    0.901    0.963    0.968    1.007    0.030    87.82   751.83        .
       parse          0.002       10    0.000    0.000    0.000    0.001    0.000     0.02     0.16        .
       check          0.020       10    0.002    0.002    0.002    0.002    0.000     0.18     1.56        .
        eval          1.312       10    0.127    0.131    0.130    0.144    0.005    11.96   102.42        .
       total         10.967       10    1.033    1.097    1.097    1.137    0.029   100.00   856.13    0.969
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.307        1    1.307    1.307    1.307    1.307        .     6.13   100.00        .
        init         19.972        1   19.972   19.972   19.972   19.972        .    93.62  1528.08        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.08        .
       check          0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.15        .
        eval          1.359        1    1.359    1.359    1.359    1.359        .     6.37   103.98        .
       total         21.334        1   21.334   21.334   21.334   21.334        .   100.00  1632.29   20.027
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.165     1000    0.000    0.000    0.000    0.001    0.000    21.40   100.00        .
        init          0.065     1000    0.000    0.000    0.000    0.001    0.000     8.43    39.39        .
       parse          0.440     1000    0.000    0.000    0.000    0.001    0.000    57.07   266.67        .
       check          0.005     1000    0.000    0.000    0.000    0.001    0.000     0.65     3.03        .
        eval          0.239     1000    0.000    0.000    0.000    0.003    0.000    31.00   144.85        .
       total          0.771     1000    0.000    0.001    0.001    0.004    0.000   100.00   467.27    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.386     1000    0.001    0.001    0.001    0.004    0.000    68.24   100.00        .
        init          0.079     1000    0.000    0.000    0.000    0.001    0.000     3.89     5.70        .
       parse          0.468     1000    0.000    0.000    0.000    0.002    0.001    23.04    33.77        .
       check          0.007     1000    0.000    0.000    0.000    0.001    0.000     0.34     0.51        .
        eval          1.448     1000    0.001    0.001    0.001    0.004    0.001    71.29   104.47        .
       total          2.031     1000    0.001    0.002    0.002    0.005    0.000   100.00   146.54    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.353      100    0.013    0.014    0.013    0.017    0.001    94.88   100.00        .
        init          0.008      100    0.000    0.000    0.000    0.001    0.000     0.56     0.59        .
       parse          0.044      100    0.000    0.000    0.000    0.001    0.000     3.09     3.25        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.372      100    0.013    0.014    0.014    0.016    0.001    96.21   101.40        .
       total          1.426      100    0.013    0.014    0.014    0.017    0.001   100.00   105.40    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.373       10    0.132    0.137    0.135    0.147    0.005    98.71   100.00        .
        init          0.002       10    0.000    0.000    0.000    0.001    0.000     0.14     0.15        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.36     0.36        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.384       10    0.136    0.138    0.138    0.143    0.002    99.50   100.80        .
       total          1.391       10    0.137    0.139    0.138    0.144    0.002   100.00   101.31    0.002
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.352        1    1.352    1.352    1.352    1.352        .    99.63   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.07        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.356        1    1.356    1.356    1.356    1.356        .    99.93   100.30        .
       total          1.357        1    1.357    1.357    1.357    1.357        .   100.00   100.37    0.005
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.172     1000    0.000    0.000    0.000    0.001    0.000    22.45   100.00        .
        init          0.069     1000    0.000    0.000    0.000    0.001    0.000     9.01    40.12        .
       parse          0.444     1000    0.000    0.000    0.000    0.002    0.001    57.96   258.14        .
       check          0.001     1000    0.000    0.000    0.000    0.001    0.000     0.13     0.58        .
        eval          0.232     1000    0.000    0.000    0.000    0.001    0.000    30.29   134.88        .
       total          0.766     1000    0.000    0.001    0.001    0.003    0.000   100.00   445.35    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.619     1000    0.001    0.002    0.002    0.004    0.001    68.89   100.00        .
        init          0.080     1000    0.000    0.000    0.000    0.001    0.000     3.40     4.94        .
       parse          0.489     1000    0.000    0.000    0.000    0.002    0.001    20.81    30.20        .
       check          0.008     1000    0.000    0.000    0.000    0.001    0.000     0.34     0.49        .
        eval          1.754     1000    0.001    0.002    0.002    0.005    0.000    74.64   108.34        .
       total          2.350     1000    0.002    0.002    0.002    0.006    0.001   100.00   145.15    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.947      100    0.028    0.029    0.029    0.034    0.001    96.59   100.00        .
        init          0.006      100    0.000    0.000    0.000    0.001    0.000     0.20     0.20        .
       parse          0.051      100    0.000    0.001    0.001    0.001    0.001     1.67     1.73        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.991      100    0.028    0.030    0.030    0.037    0.001    98.03   101.49        .
       total          3.051      100    0.029    0.031    0.030    0.038    0.001   100.00   103.53    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.401       10    0.136    0.140    0.139    0.145    0.004    97.97   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.42     0.43        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.423       10    0.138    0.142    0.140    0.153    0.005    99.51   101.57        .
       total          1.430       10    0.139    0.143    0.140    0.154    0.005   100.00   102.07    0.003
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.436        1    1.436    1.436    1.436    1.436        .   103.31   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.07        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.389        1    1.389    1.389    1.389    1.389        .    99.93    96.73        .
       total          1.390        1    1.390    1.390    1.390    1.390        .   100.00    96.80   -0.046
--------------------------------------------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.179     1000    0.000    0.000    0.000    0.001    0.000    26.32   100.00        .
        init          0.069     1000    0.000    0.000    0.000    0.001    0.000    10.15    38.55        .
       parse          0.379     1000    0.000    0.000    0.000    0.001    0.000    55.74   211.73        .
       check          0.005     1000    0.000    0.000    0.000    0.001    0.000     0.74     2.79        .
        eval          0.199     1000    0.000    0.000    0.000    0.002    0.000    29.26   111.17        .
       total          0.680     1000    0.000    0.001    0.001    0.003    0.000   100.00   379.89    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.340     1000    0.001    0.001    0.001    0.003    0.000    69.61   100.00        .
        init          0.065     1000    0.000    0.000    0.000    0.001    0.000     3.38     4.85        .
       parse          0.449     1000    0.000    0.000    0.000    0.002    0.001    23.32    33.51        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.21     0.30        .
        eval          1.378     1000    0.001    0.001    0.001    0.004    0.000    71.58   102.84        .
       total          1.925     1000    0.001    0.002    0.002    0.004    0.000   100.00   143.66    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.321      100    0.012    0.013    0.013    0.018    0.001    96.07   100.00        .
        init          0.008      100    0.000    0.000    0.000    0.001    0.000     0.58     0.61        .
       parse          0.039      100    0.000    0.000    0.000    0.001    0.000     2.84     2.95        .
       check          0.002      100    0.000    0.000    0.000    0.001    0.000     0.15     0.15        .
        eval          1.321      100    0.012    0.013    0.013    0.016    0.001    96.07   100.00        .
       total          1.375      100    0.013    0.014    0.014    0.017    0.001   100.00   104.09    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.304       10    0.128    0.130    0.130    0.134    0.002    97.68   100.00        .
        init          0.002       10    0.000    0.000    0.000    0.001    0.000     0.15     0.15        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.30     0.31        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.329       10    0.130    0.133    0.132    0.140    0.003    99.55   101.92        .
       total          1.335       10    0.130    0.134    0.133    0.140    0.003   100.00   102.38    0.003
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.296        1    1.296    1.296    1.296    1.296        .    97.81   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.325        1    1.325    1.325    1.325    1.325        .   100.00   102.24        .
       total          1.325        1    1.325    1.325    1.325    1.325        .   100.00   102.24    0.029
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  11 Sep 2024, 19:52:41
--------------------------------------------------------------------------------------------------------------------------------------------------------
