------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  20 Sep 2024, 21:47:17

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. profile_obs_integer, obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.228     1000    0.000    0.000    0.000    0.003    0.000     5.40   100.00        .
        init          0.246     1000    0.000    0.000    0.000    0.003    0.000     5.83   107.89        .
       parse          0.555     1000    0.000    0.001    0.001    0.004    0.001    13.14   243.42        .
       check          3.185     1000    0.002    0.003    0.003    0.010    0.001    75.42  1396.93        .
        eval          0.213     1000    0.000    0.000    0.000    0.002    0.000     5.04    93.42        .
       total          4.223     1000    0.003    0.004    0.004    0.013    0.001   100.00  1852.19    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.848     1000    0.001    0.002    0.002    0.006    0.001    26.15   100.00        .
        init          1.470     1000    0.001    0.001    0.001    0.007    0.001    20.80    79.55        .
       parse          0.559     1000    0.000    0.001    0.001    0.003    0.001     7.91    30.25        .
       check          3.088     1000    0.002    0.003    0.003    0.015    0.001    43.70   167.10        .
        eval          1.923     1000    0.001    0.002    0.002    0.008    0.001    27.21   104.06        .
       total          7.066     1000    0.006    0.007    0.007    0.029    0.001   100.00   382.36    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.445      100    0.022    0.024    0.024    0.039    0.002    54.94   100.00        .
        init          1.656      100    0.014    0.017    0.016    0.026    0.002    37.21    67.73        .
       parse          0.057      100    0.000    0.001    0.001    0.001    0.000     1.28     2.33        .
       check          0.313      100    0.002    0.003    0.003    0.010    0.001     7.03    12.80        .
        eval          2.423      100    0.022    0.024    0.024    0.029    0.002    54.45    99.10        .
       total          4.450      100    0.041    0.045    0.044    0.058    0.003   100.00   182.00    0.020
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.617       10    0.154    0.162    0.159    0.182    0.008    55.55   100.00        .
        init          1.253       10    0.119    0.125    0.122    0.140    0.006    43.04    77.49        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.24     0.43        .
       check          0.032       10    0.003    0.003    0.003    0.004    0.000     1.10     1.98        .
        eval          1.619       10    0.153    0.162    0.156    0.196    0.013    55.62   100.12        .
       total          2.911       10    0.278    0.291    0.287    0.321    0.013   100.00   180.02    0.129
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.596        1    1.596    1.596    1.596    1.596        .    56.88   100.00        .
        init          1.226        1    1.226    1.226    1.226    1.226        .    43.69    76.82        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.06        .
       check          0.003        1    0.003    0.003    0.003    0.003        .     0.11     0.19        .
        eval          1.576        1    1.576    1.576    1.576    1.576        .    56.17    98.75        .
       total          2.806        1    2.806    2.806    2.806    2.806        .   100.00   175.81    1.210
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.207     1000    0.000    0.000    0.000    0.001    0.000    11.83   100.00        .
        init          0.333     1000    0.000    0.000    0.000    0.002    0.000    19.03   160.87        .
       parse          0.461     1000    0.000    0.000    0.000    0.001    0.000    26.34   222.71        .
       check          0.693     1000    0.000    0.001    0.001    0.003    0.000    39.60   334.78        .
        eval          0.237     1000    0.000    0.000    0.000    0.001    0.000    13.54   114.49        .
       total          1.750     1000    0.001    0.002    0.002    0.006    0.001   100.00   845.41    0.002
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.929     1000    0.001    0.002    0.002    0.008    0.001    29.66   100.00        .
        init          3.214     1000    0.002    0.003    0.003    0.009    0.001    49.42   166.61        .
       parse          0.502     1000    0.000    0.001    0.000    0.004    0.001     7.72    26.02        .
       check          0.733     1000    0.000    0.001    0.001    0.002    0.000    11.27    38.00        .
        eval          2.020     1000    0.001    0.002    0.002    0.006    0.001    31.06   104.72        .
       total          6.504     1000    0.005    0.007    0.006    0.015    0.001   100.00   337.17    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.366      100    0.031    0.034    0.033    0.043    0.002    34.89   100.00        .
        init          6.167      100    0.055    0.062    0.060    0.081    0.005    63.93   183.21        .
       parse          0.053      100    0.000    0.001    0.001    0.002    0.001     0.55     1.57        .
       check          0.071      100    0.000    0.001    0.001    0.002    0.000     0.74     2.11        .
        eval          3.354      100    0.031    0.034    0.033    0.041    0.002    34.77    99.64        .
       total          9.647      100    0.088    0.096    0.095    0.116    0.006   100.00   286.60    0.063
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.677       10    0.159    0.168    0.165    0.185    0.007    14.80   100.00        .
        init          9.721       10    0.924    0.972    0.964    1.036    0.032    85.78   579.67        .
       parse          0.008       10    0.000    0.001    0.001    0.001    0.000     0.07     0.48        .
       check          0.004       10    0.000    0.000    0.000    0.001    0.001     0.04     0.24        .
        eval          1.598       10    0.155    0.160    0.159    0.166    0.003    14.10    95.29        .
       total         11.332       10    1.084    1.133    1.124    1.198    0.033   100.00   675.73    0.966
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.608        1    1.608    1.608    1.608    1.608        .     7.93   100.00        .
        init         18.639        1   18.639   18.639   18.639   18.639        .    91.96  1159.14        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.06        .
       check          0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.06        .
        eval          1.628        1    1.628    1.628    1.628    1.628        .     8.03   101.24        .
       total         20.269        1   20.269   20.269   20.269   20.269        .   100.00  1260.51   18.661
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.187     1000    0.000    0.000    0.000    0.001    0.000     6.12   100.00        .
        init          0.545     1000    0.000    0.001    0.001    0.003    0.001    17.83   291.44        .
       parse          0.452     1000    0.000    0.000    0.000    0.004    0.001    14.79   241.71        .
       check          1.836     1000    0.001    0.002    0.002    0.020    0.001    60.08   981.82        .
        eval          0.204     1000    0.000    0.000    0.000    0.004    0.000     6.68   109.09        .
       total          3.056     1000    0.002    0.003    0.003    0.024    0.001   100.00  1634.22    0.003
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.663     1000    0.001    0.002    0.002    0.005    0.001    18.31   100.00        .
        init          4.989     1000    0.004    0.005    0.005    0.009    0.001    54.92   300.00        .
       parse          0.503     1000    0.000    0.001    0.000    0.003    0.001     5.54    30.25        .
       check          1.742     1000    0.001    0.002    0.002    0.005    0.001    19.18   104.75        .
        eval          1.812     1000    0.001    0.002    0.002    0.008    0.001    19.95   108.96        .
       total          9.084     1000    0.008    0.009    0.009    0.018    0.001   100.00   546.24    0.007
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.105      100    0.019    0.021    0.021    0.027    0.001    19.15   100.00        .
        init          8.634      100    0.079    0.086    0.085    0.111    0.006    78.54   410.17        .
       parse          0.046      100    0.000    0.000    0.000    0.001    0.001     0.42     2.19        .
       check          0.178      100    0.001    0.002    0.002    0.003    0.000     1.62     8.46        .
        eval          2.131      100    0.020    0.021    0.021    0.030    0.002    19.39   101.24        .
       total         10.993      100    0.101    0.110    0.108    0.142    0.007   100.00   522.23    0.089
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.460       10    0.142    0.146    0.144    0.155    0.004    10.51   100.00        .
        init         12.405       10    1.201    1.241    1.239    1.297    0.034    89.34   849.66        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.05     0.48        .
       check          0.017       10    0.001    0.002    0.002    0.002    0.000     0.12     1.16        .
        eval          1.456       10    0.140    0.146    0.143    0.155    0.005    10.49    99.73        .
       total         13.885       10    1.347    1.389    1.388    1.440    0.034   100.00   951.03    1.243
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.512        1    1.512    1.512    1.512    1.512        .     6.62   100.00        .
        init         21.371        1   21.371   21.371   21.371   21.371        .    93.63  1413.43        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.07        .
       check          0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.13        .
        eval          1.450        1    1.450    1.450    1.450    1.450        .     6.35    95.90        .
       total         22.825        1   22.825   22.825   22.825   22.825        .   100.00  1509.59   21.313
--------------------------------------------------------------------------------------------------------------

. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.205     1000    0.000    0.000    0.000    0.002    0.000    25.75   100.00        .
        init          0.071     1000    0.000    0.000    0.000    0.001    0.000     8.92    34.63        .
       parse          0.459     1000    0.000    0.000    0.000    0.002    0.001    57.66   223.90        .
       check          0.009     1000    0.000    0.000    0.000    0.001    0.000     1.13     4.39        .
        eval          0.235     1000    0.000    0.000    0.000    0.001    0.000    29.52   114.63        .
       total          0.796     1000    0.000    0.001    0.001    0.003    0.000   100.00   388.29    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.594     1000    0.001    0.002    0.002    0.006    0.001    73.76   100.00        .
        init          0.076     1000    0.000    0.000    0.000    0.002    0.000     3.52     4.77        .
       parse          0.435     1000    0.000    0.000    0.000    0.002    0.001    20.13    27.29        .
       check          0.005     1000    0.000    0.000    0.000    0.001    0.000     0.23     0.31        .
        eval          1.625     1000    0.001    0.002    0.002    0.007    0.001    75.20   101.94        .
       total          2.161     1000    0.002    0.002    0.002    0.008    0.000   100.00   135.57    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.583      100    0.014    0.016    0.015    0.021    0.002   100.13   100.00        .
        init          0.005      100    0.000    0.000    0.000    0.001    0.000     0.32     0.32        .
       parse          0.047      100    0.000    0.000    0.000    0.002    0.001     2.97     2.97        .
       check          0.001      100    0.000    0.000    0.000    0.001    0.000     0.06     0.06        .
        eval          1.525      100    0.014    0.015    0.015    0.022    0.001    96.46    96.34        .
       total          1.581      100    0.015    0.016    0.015    0.023    0.001   100.00    99.87   -0.000
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.622       10    0.150    0.162    0.158    0.177    0.008   104.31   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.003       10    0.000    0.000    0.000    0.001    0.000     0.19     0.18        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.552       10    0.147    0.155    0.152    0.171    0.008    99.81    95.68        .
       total          1.555       10    0.147    0.155    0.153    0.171    0.008   100.00    95.87   -0.007
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.561        1    1.561    1.561    1.561    1.561        .    99.74   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.06        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.564        1    1.564    1.564    1.564    1.564        .    99.94   100.19        .
       total          1.565        1    1.565    1.565    1.565    1.565        .   100.00   100.26    0.004
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.204     1000    0.000    0.000    0.000    0.001    0.000    25.76   100.00        .
        init          0.065     1000    0.000    0.000    0.000    0.001    0.000     8.21    31.86        .
       parse          0.451     1000    0.000    0.000    0.000    0.002    0.001    56.94   221.08        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.51     1.96        .
        eval          0.246     1000    0.000    0.000    0.000    0.002    0.000    31.06   120.59        .
       total          0.792     1000    0.000    0.001    0.001    0.002    0.000   100.00   388.24    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.928     1000    0.001    0.002    0.002    0.007    0.001    73.84   100.00        .
        init          0.091     1000    0.000    0.000    0.000    0.001    0.000     3.49     4.72        .
       parse          0.495     1000    0.000    0.000    0.000    0.002    0.001    18.96    25.67        .
       check          0.002     1000    0.000    0.000    0.000    0.001    0.000     0.08     0.10        .
        eval          2.003     1000    0.001    0.002    0.002    0.004    0.000    76.71   103.89        .
       total          2.611     1000    0.002    0.003    0.003    0.006    0.001   100.00   135.43    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.440      100    0.032    0.034    0.033    0.045    0.003    99.51   100.00        .
        init          0.013      100    0.000    0.000    0.000    0.001    0.000     0.38     0.38        .
       parse          0.052      100    0.000    0.001    0.001    0.001    0.001     1.50     1.51        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          3.389      100    0.031    0.034    0.034    0.040    0.002    98.03    98.52        .
       total          3.457      100    0.032    0.035    0.034    0.041    0.002   100.00   100.49    0.000
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.639       10    0.160    0.164    0.162    0.172    0.004    99.15   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.30     0.31        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.648       10    0.155    0.165    0.160    0.208    0.015    99.70   100.55        .
       total          1.653       10    0.156    0.165    0.161    0.208    0.015   100.00   100.85    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.595        1    1.595    1.595    1.595    1.595        .   101.98   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.564        1    1.564    1.564    1.564    1.564        .   100.00    98.06        .
       total          1.564        1    1.564    1.564    1.564    1.564        .   100.00    98.06   -0.031
--------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.197     1000    0.000    0.000    0.000    0.006    0.000    27.94   100.00        .
        init          0.061     1000    0.000    0.000    0.000    0.001    0.000     8.65    30.96        .
       parse          0.402     1000    0.000    0.000    0.000    0.003    0.001    57.02   204.06        .
       check          0.003     1000    0.000    0.000    0.000    0.001    0.000     0.43     1.52        .
        eval          0.213     1000    0.000    0.000    0.000    0.001    0.000    30.21   108.12        .
       total          0.705     1000    0.000    0.001    0.001    0.003    0.000   100.00   357.87    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.512     1000    0.001    0.002    0.001    0.006    0.001    77.14   100.00        .
        init          0.070     1000    0.000    0.000    0.000    0.001    0.000     3.57     4.63        .
       parse          0.391     1000    0.000    0.000    0.000    0.001    0.000    19.95    25.86        .
       check          0.002     1000    0.000    0.000    0.000    0.001    0.000     0.10     0.13        .
        eval          1.474     1000    0.001    0.001    0.001    0.004    0.001    75.20    97.49        .
       total          1.960     1000    0.001    0.002    0.002    0.005    0.000   100.00   129.63    0.000
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.450      100    0.013    0.014    0.014    0.029    0.002    98.51   100.00        .
        init          0.007      100    0.000    0.000    0.000    0.001    0.000     0.48     0.48        .
       parse          0.042      100    0.000    0.000    0.000    0.002    0.001     2.85     2.90        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.420      100    0.013    0.014    0.014    0.026    0.002    96.47    97.93        .
       total          1.472      100    0.013    0.015    0.014    0.026    0.002   100.00   101.52    0.000
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.431       10    0.139    0.143    0.143    0.149    0.003   103.02   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.07     0.07        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.43     0.42        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.382       10    0.134    0.138    0.136    0.145    0.004    99.50    96.58        .
       total          1.389       10    0.135    0.139    0.137    0.145    0.003   100.00    97.06   -0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.486        1    1.486    1.486    1.486    1.486        .    98.54   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.508        1    1.508    1.508    1.508    1.508        .   100.00   101.48        .
       total          1.508        1    1.508    1.508    1.508    1.508        .   100.00   101.48    0.022
--------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  20 Sep 2024, 21:51:18
------------------------------------------------------------------------------------------------------------------------------------------
