---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  19 Aug 2024, 16:09:42

. 
. dis "`c(current_date)'"
19 Aug 2024

. dis "`c(current_time)'"
16:09:42

. 
. profile_obs_integer, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.214     1000    0.000    0.000    0.000    0.001    0.000     4.16   100.00        .
        init          0.188     1000    0.000    0.000    0.000    0.001    0.000     3.66    87.85        .
       parse          0.686     1000    0.000    0.001    0.001    0.003    0.000    13.34   320.56        .
       check          3.654     1000    0.002    0.004    0.003    0.013    0.001    71.05  1707.48        .
        eval          0.454     1000    0.000    0.000    0.000    0.006    0.001     8.83   212.15        .
       total          5.143     1000    0.003    0.005    0.005    0.015    0.001   100.00  2403.27    0.005
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.934     1000    0.001    0.005    0.005    0.016    0.002    21.98   100.00        .
        init          4.022     1000    0.001    0.004    0.004    0.013    0.002    17.92    81.52        .
       parse          1.528     1000    0.000    0.002    0.002    0.008    0.001     6.81    30.97        .
       check          8.473     1000    0.002    0.008    0.008    0.021    0.003    37.75   171.73        .
        eval          8.038     1000    0.002    0.008    0.008    0.020    0.003    35.81   162.91        .
       total         22.444     1000    0.007    0.022    0.022    0.057    0.008   100.00   454.88    0.018
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          6.066      100    0.043    0.061    0.057    0.096    0.011    42.18   100.00        .
        init          5.099      100    0.039    0.051    0.046    0.132    0.013    35.46    84.06        .
       parse          0.163      100    0.001    0.002    0.002    0.004    0.001     1.13     2.69        .
       check          0.929      100    0.006    0.009    0.009    0.018    0.002     6.46    15.31        .
        eval          8.144      100    0.064    0.081    0.080    0.132    0.010    56.63   134.26        .
       total         14.380      100    0.116    0.144    0.137    0.233    0.020   100.00   237.06    0.083
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.219       10    0.410    0.422    0.416    0.456    0.014    42.82   100.00        .
        init          3.595       10    0.347    0.359    0.361    0.372    0.008    36.49    85.21        .
       parse          0.016       10    0.001    0.002    0.002    0.002    0.001     0.16     0.38        .
       check          0.085       10    0.008    0.009    0.008    0.010    0.001     0.86     2.01        .
        eval          6.151       10    0.606    0.615    0.614    0.629    0.007    62.43   145.79        .
       total          9.853       10    0.974    0.985    0.986    0.996    0.007   100.00   233.54    0.563
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         41.299       10    3.983    4.130    4.122    4.215    0.071    42.50   100.00        .
        init         35.782       10    3.498    3.578    3.534    3.709    0.080    36.82    86.64        .
       parse          0.013       10    0.001    0.001    0.001    0.002    0.000     0.01     0.03        .
       check          0.095       10    0.008    0.009    0.009    0.015    0.002     0.10     0.23        .
        eval         61.288       10    6.055    6.129    6.118    6.195    0.039    63.06   148.40        .
       total         97.183       10    9.603    9.718    9.712    9.833    0.085   100.00   235.32    5.588
---------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.584     1000    0.000    0.001    0.001    0.004    0.001     5.09   100.00        .
        init          0.175     1000    0.000    0.000    0.000    0.001    0.000     1.53    29.97        .
       parse          1.308     1000    0.000    0.001    0.001    0.004    0.000    11.41   223.97        .
       check          8.369     1000    0.005    0.008    0.008    0.016    0.001    73.00  1433.05        .
        eval          1.242     1000    0.000    0.001    0.001    0.004    0.000    10.83   212.67        .
       total         11.464     1000    0.006    0.011    0.011    0.021    0.001   100.00  1963.01    0.011
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          5.064     1000    0.002    0.005    0.005    0.015    0.001    24.57   100.00        .
        init          0.639     1000    0.000    0.001    0.001    0.004    0.001     3.10    12.62        .
       parse          1.352     1000    0.001    0.001    0.001    0.003    0.000     6.56    26.70        .
       check          8.190     1000    0.006    0.008    0.008    0.014    0.001    39.74   161.73        .
        eval         10.010     1000    0.007    0.010    0.010    0.016    0.001    48.57   197.67        .
       total         20.611     1000    0.016    0.021    0.021    0.032    0.001   100.00   407.01    0.016
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          5.715      100    0.044    0.057    0.057    0.085    0.006    49.73   100.00        .
        init          0.973      100    0.005    0.010    0.010    0.016    0.002     8.47    17.03        .
       parse          0.142      100    0.001    0.001    0.001    0.002    0.000     1.24     2.48        .
       check          0.836      100    0.007    0.008    0.008    0.013    0.001     7.27    14.63        .
        eval          9.492      100    0.079    0.095    0.094    0.147    0.009    82.60   166.09        .
       total         11.492      100    0.095    0.115    0.115    0.167    0.010   100.00   201.08    0.058
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.233       10    0.412    0.423    0.419    0.434    0.008    50.69   100.00        .
        init          0.410       10    0.038    0.041    0.040    0.044    0.002     4.91     9.69        .
       parse          0.013       10    0.001    0.001    0.001    0.002    0.000     0.16     0.31        .
       check          0.082       10    0.007    0.008    0.008    0.009    0.001     0.98     1.94        .
        eval          7.838       10    0.758    0.784    0.771    0.904    0.043    93.87   185.16        .
       total          8.350       10    0.808    0.835    0.820    0.958    0.044   100.00   197.26    0.412
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         42.392       10    4.130    4.239    4.205    4.371    0.081    52.61   100.00        .
        init          4.027       10    0.389    0.403    0.402    0.414    0.008     5.00     9.50        .
       parse          0.015       10    0.001    0.002    0.001    0.003    0.001     0.02     0.04        .
       check          0.082       10    0.007    0.008    0.008    0.010    0.001     0.10     0.19        .
        eval         76.458       10    7.578    7.646    7.625    7.785    0.058    94.88   180.36        .
       total         80.583       10    7.997    8.058    8.044    8.201    0.058   100.00   190.09    3.819
---------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.503     1000    0.000    0.001    0.001    0.002    0.001     5.55   100.00        .
        init          1.339     1000    0.000    0.001    0.001    0.009    0.001    14.78   266.20        .
       parse          1.227     1000    0.000    0.001    0.001    0.005    0.000    13.55   243.94        .
       check          5.041     1000    0.003    0.005    0.005    0.013    0.001    55.65  1002.19        .
        eval          1.092     1000    0.000    0.001    0.001    0.004    0.000    12.06   217.10        .
       total          9.058     1000    0.005    0.009    0.009    0.018    0.001   100.00  1800.80    0.009
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.539     1000    0.003    0.005    0.004    0.009    0.001    15.35   100.00        .
        init         13.603     1000    0.010    0.014    0.013    0.028    0.001    46.01   299.69        .
       parse          1.279     1000    0.001    0.001    0.001    0.004    0.000     4.33    28.18        .
       check          4.955     1000    0.003    0.005    0.005    0.010    0.001    16.76   109.17        .
        eval          9.294     1000    0.007    0.009    0.009    0.018    0.001    31.44   204.76        .
       total         29.563     1000    0.026    0.030    0.029    0.047    0.002   100.00   651.31    0.025
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.189      100    0.014    0.042    0.042    0.065    0.009    14.74   100.00        .
        init         20.320      100    0.078    0.203    0.211    0.239    0.036    71.52   485.08        .
       parse          0.129      100    0.000    0.001    0.001    0.005    0.001     0.45     3.08        .
       check          0.456      100    0.001    0.005    0.005    0.007    0.001     1.60    10.89        .
        eval          7.465      100    0.027    0.075    0.077    0.092    0.015    26.27   178.20        .
       total         28.413      100    0.107    0.284    0.296    0.332    0.052   100.00   678.28    0.242
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.312       10    0.128    0.131    0.130    0.142    0.004     9.54   100.00        .
        init         11.275       10    1.085    1.127    1.112    1.201    0.035    81.95   859.37        .
       parse          0.006       10    0.000    0.001    0.000    0.002    0.001     0.04     0.46        .
       check          0.017       10    0.001    0.002    0.002    0.002    0.000     0.12     1.30        .
        eval          2.457       10    0.243    0.246    0.245    0.249    0.002    17.86   187.27        .
       total         13.758       10    1.332    1.376    1.362    1.454    0.036   100.00  1048.63    1.245
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         13.531       10    1.288    1.353    1.319    1.630    0.102     5.56   100.00        .
        init        217.438       10   19.355   21.744   19.672   36.411    5.216    89.36  1606.96        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.00     0.04        .
       check          0.020       10    0.001    0.002    0.002    0.003    0.000     0.01     0.15        .
        eval         25.853       10    2.440    2.585    2.447    3.800    0.427    10.63   191.06        .
       total        243.319       10   21.813   24.332   22.122   40.215    5.638   100.00  1798.23   22.979
---------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  19 Aug 2024, 16:24:02
---------------------------------------------------------------------------------------------------------------------------------------
