----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:   4 Oct 2024, 11:40:25

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.452     1000    0.000    0.001    0.001    0.007    0.001    27.28   381.10        .
  base                     0.381     1000    0.000    0.000    0.000    0.003    0.001     7.16   100.00        .
  init                     0.622     1000    0.000    0.001    0.001    0.003    0.000    11.69   163.25        .
  parse                    0.809     1000    0.000    0.001    0.001    0.002    0.000    15.20   212.34        .
  check                    3.472     1000    0.003    0.003    0.003    0.011    0.001    65.24   911.29        .
  - usefulness             1.585     1000    0.001    0.002    0.002    0.006    0.001    29.78   416.01        .
    - is_useful() 1        1.465     1000    0.000    0.001    0.001    0.005    0.001    27.53   384.51        .
  - combine                0.057     1000    0.000    0.000    0.000    0.001    0.000     1.07    14.96        .
  - exhaustiveness         1.739     1000    0.001    0.002    0.002    0.006    0.001    32.68   456.43        .
    - is_useful() 2        1.663     1000    0.001    0.002    0.002    0.005    0.001    31.25   436.48        .
  - compress               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.11     1.57        .
  - print                  0.032     1000    0.000    0.000    0.000    0.001    0.000     0.60     8.40        .
  + Overlap()              1.339     1000    0.000    0.001    0.001    0.004    0.001    25.16   351.44        .
  + Difference()           0.859     1000    0.000    0.001    0.001    0.003    0.001    16.14   225.46        .
  + Compress()             0.417     1000    0.000    0.000    0.000    0.003    0.001     7.84   109.45        .
  eval                     0.398     1000    0.000    0.000    0.000    0.007    0.001     7.48   104.46        .
  total                    5.322     1000    0.004    0.005    0.005    0.015    0.001   100.00  1396.85    0.005
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.597     1000    0.002    0.006    0.006    0.012    0.001    22.08    56.80        .
  base                     9.854     1000    0.002    0.010    0.010    0.024    0.003    38.87   100.00        .
  init                     2.796     1000    0.000    0.003    0.003    0.008    0.001    11.03    28.37        .
  parse                    2.161     1000    0.000    0.002    0.002    0.008    0.001     8.52    21.93        .
  check                    9.645     1000    0.003    0.010    0.010    0.024    0.003    38.04    97.88        .
  - usefulness             4.354     1000    0.001    0.004    0.004    0.011    0.001    17.17    44.19        .
    - is_useful() 1        4.020     1000    0.000    0.004    0.004    0.011    0.001    15.86    40.80        .
  - combine                0.152     1000    0.000    0.000    0.000    0.004    0.000     0.60     1.54        .
  - exhaustiveness         4.890     1000    0.001    0.005    0.005    0.012    0.001    19.29    49.62        .
    - is_useful() 2        4.668     1000    0.001    0.005    0.005    0.012    0.001    18.41    47.37        .
  - compress               0.016     1000    0.000    0.000    0.000    0.001    0.000     0.06     0.16        .
  - print                  0.078     1000    0.000    0.000    0.000    0.001    0.000     0.31     0.79        .
  + Overlap()              3.769     1000    0.000    0.004    0.004    0.012    0.002    14.87    38.25        .
  + Difference()           2.309     1000    0.000    0.002    0.002    0.009    0.001     9.11    23.43        .
  + Compress()             1.094     1000    0.000    0.001    0.001    0.005    0.001     4.32    11.10        .
  eval                    10.649     1000    0.002    0.011    0.011    0.023    0.003    42.00   108.07        .
  total                   25.353     1000    0.007    0.025    0.026    0.051    0.006   100.00   257.29    0.015
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.993      100    0.033    0.040    0.039    0.056    0.005    31.57    40.56        .
  base                     9.845      100    0.087    0.098    0.096    0.136    0.009    77.84   100.00        .
  init                     1.826      100    0.010    0.018    0.018    0.025    0.002    14.44    18.55        .
  parse                    0.231      100    0.001    0.002    0.002    0.004    0.001     1.83     2.35        .
  check                    1.010      100    0.007    0.010    0.010    0.017    0.001     7.99    10.26        .
  - usefulness             0.469      100    0.002    0.005    0.005    0.009    0.001     3.71     4.76        .
    - is_useful() 1        0.426      100    0.002    0.004    0.004    0.008    0.001     3.37     4.33        .
  - combine                0.010      100    0.000    0.000    0.000    0.001    0.000     0.08     0.10        .
  - exhaustiveness         0.507      100    0.003    0.005    0.005    0.009    0.001     4.01     5.15        .
    - is_useful() 2        0.488      100    0.003    0.005    0.005    0.008    0.001     3.86     4.96        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.008      100    0.000    0.000    0.000    0.001    0.000     0.06     0.08        .
  + Overlap()              0.369      100    0.001    0.004    0.003    0.008    0.001     2.92     3.75        .
  + Difference()           0.263      100    0.001    0.003    0.003    0.005    0.001     2.08     2.67        .
  + Compress()             0.130      100    0.000    0.001    0.001    0.004    0.001     1.03     1.32        .
  eval                     9.573      100    0.080    0.096    0.093    0.123    0.007    75.69    97.24        .
  total                   12.648      100    0.110    0.126    0.125    0.154    0.007   100.00   128.47    0.028
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               4.474       10    0.418    0.447    0.447    0.476    0.019    43.71    51.88        .
  base                     8.623       10    0.801    0.862    0.855    0.950    0.042    84.24   100.00        .
  init                     1.524       10    0.129    0.152    0.152    0.171    0.010    14.89    17.67        .
  parse                    0.020       10    0.001    0.002    0.002    0.003    0.000     0.20     0.23        .
  check                    0.104       10    0.009    0.010    0.010    0.013    0.001     1.02     1.21        .
  - usefulness             0.047       10    0.004    0.005    0.004    0.008    0.001     0.46     0.55        .
    - is_useful() 1        0.042       10    0.003    0.004    0.004    0.007    0.001     0.41     0.49        .
  - combine                0.002       10    0.000    0.000    0.000    0.001    0.000     0.02     0.02        .
  - exhaustiveness         0.054       10    0.005    0.005    0.005    0.007    0.001     0.53     0.63        .
    - is_useful() 2        0.049       10    0.004    0.005    0.005    0.006    0.001     0.48     0.57        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.040       10    0.001    0.004    0.004    0.008    0.002     0.39     0.46        .
  + Difference()           0.025       10    0.000    0.003    0.002    0.005    0.002     0.24     0.29        .
  + Compress()             0.011       10    0.000    0.001    0.001    0.002    0.001     0.11     0.13        .
  eval                     8.588       10    0.812    0.859    0.845    0.962    0.041    83.90    99.59        .
  total                   10.236       10    0.990    1.024    1.006    1.126    0.040   100.00   118.71    0.161
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.333        1    6.333    6.333    6.333    6.333        .    63.65    75.52        .
  base                     8.386        1    8.386    8.386    8.386    8.386        .    84.28   100.00        .
  init                     1.480        1    1.480    1.480    1.480    1.480        .    14.87    17.65        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.02     0.02        .
  check                    0.009        1    0.009    0.009    0.009    0.009        .     0.09     0.11        .
  - usefulness             0.004        1    0.004    0.004    0.004    0.004        .     0.04     0.05        .
    - is_useful() 1        0.003        1    0.003    0.003    0.003    0.003        .     0.03     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.005        1    0.005    0.005    0.005    0.005        .     0.05     0.06        .
    - is_useful() 2        0.004        1    0.004    0.004    0.004    0.004        .     0.04     0.05        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.003        1    0.003    0.003    0.003    0.003        .     0.03     0.04        .
  + Difference()           0.002        1    0.002    0.002    0.002    0.002        .     0.02     0.02        .
  + Compress()             0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  eval                     8.458        1    8.458    8.458    8.458    8.458        .    85.01   100.86        .
  total                    9.950        1    9.950    9.950    9.950    9.950        .   100.00   118.65    1.564
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.723     1000    0.000    0.002    0.002    0.006    0.001    10.85   160.73        .
  base                     1.072     1000    0.000    0.001    0.001    0.003    0.000     6.75   100.00        .
  init                     2.523     1000    0.001    0.003    0.002    0.006    0.001    15.88   235.35        .
  parse                    2.182     1000    0.001    0.002    0.002    0.007    0.000    13.74   203.54        .
  check                    9.839     1000    0.006    0.010    0.010    0.018    0.001    61.94   917.82        .
  - usefulness             4.492     1000    0.002    0.004    0.004    0.009    0.001    28.28   419.03        .
    - is_useful() 1        4.148     1000    0.002    0.004    0.004    0.009    0.001    26.11   386.94        .
  - combine                0.172     1000    0.000    0.000    0.000    0.001    0.000     1.08    16.04        .
  - exhaustiveness         4.944     1000    0.002    0.005    0.005    0.010    0.001    31.12   461.19        .
    - is_useful() 2        4.743     1000    0.002    0.005    0.005    0.010    0.001    29.86   442.44        .
  - compress               0.023     1000    0.000    0.000    0.000    0.001    0.000     0.14     2.15        .
  - print                  0.059     1000    0.000    0.000    0.000    0.001    0.000     0.37     5.50        .
  + Overlap()              3.855     1000    0.001    0.004    0.004    0.009    0.001    24.27   359.61        .
  + Difference()           2.379     1000    0.000    0.002    0.002    0.007    0.001    14.98   221.92        .
  + Compress()             1.131     1000    0.000    0.001    0.001    0.005    0.001     7.12   105.50        .
  eval                     1.244     1000    0.000    0.001    0.001    0.007    0.001     7.83   116.04        .
  total                   15.885     1000    0.010    0.016    0.015    0.029    0.002   100.00  1481.81    0.015
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.901     1000    0.003    0.006    0.006    0.010    0.001    16.57    56.06        .
  base                    10.526     1000    0.007    0.011    0.010    0.021    0.002    29.56   100.00        .
  init                    11.754     1000    0.006    0.012    0.011    0.026    0.002    33.01   111.67        .
  parse                    2.296     1000    0.001    0.002    0.002    0.007    0.001     6.45    21.81        .
  check                   10.125     1000    0.005    0.010    0.010    0.023    0.002    28.43    96.19        .
  - usefulness             4.569     1000    0.002    0.005    0.004    0.015    0.001    12.83    43.41        .
    - is_useful() 1        4.222     1000    0.002    0.004    0.004    0.015    0.001    11.86    40.11        .
  - combine                0.162     1000    0.000    0.000    0.000    0.003    0.000     0.45     1.54        .
  - exhaustiveness         5.136     1000    0.002    0.005    0.005    0.017    0.001    14.42    48.79        .
    - is_useful() 2        4.904     1000    0.002    0.005    0.005    0.016    0.001    13.77    46.59        .
  - compress               0.015     1000    0.000    0.000    0.000    0.001    0.000     0.04     0.14        .
  - print                  0.077     1000    0.000    0.000    0.000    0.001    0.000     0.22     0.73        .
  + Overlap()              3.947     1000    0.000    0.004    0.004    0.014    0.001    11.08    37.50        .
  + Difference()           2.470     1000    0.000    0.002    0.003    0.011    0.001     6.94    23.47        .
  + Compress()             1.163     1000    0.000    0.001    0.001    0.010    0.001     3.27    11.05        .
  eval                    11.340     1000    0.005    0.011    0.011    0.021    0.002    31.84   107.73        .
  total                   35.612     1000    0.022    0.036    0.034    0.057    0.004   100.00   338.32    0.025
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.139      100    0.014    0.021    0.018    0.201    0.019    17.89    52.53        .
  base                     4.072      100    0.031    0.041    0.035    0.186    0.020    34.05   100.00        .
  init                     7.461      100    0.053    0.075    0.067    0.243    0.026    62.39   183.23        .
  parse                    0.092      100    0.000    0.001    0.001    0.002    0.000     0.77     2.26        .
  check                    0.385      100    0.003    0.004    0.004    0.010    0.001     3.22     9.45        .
  - usefulness             0.178      100    0.001    0.002    0.002    0.005    0.001     1.49     4.37        .
    - is_useful() 1        0.168      100    0.001    0.002    0.002    0.005    0.001     1.40     4.13        .
  - combine                0.005      100    0.000    0.000    0.000    0.001    0.000     0.04     0.12        .
  - exhaustiveness         0.192      100    0.001    0.002    0.002    0.005    0.001     1.61     4.72        .
    - is_useful() 2        0.180      100    0.001    0.002    0.002    0.005    0.001     1.51     4.42        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.003      100    0.000    0.000    0.000    0.001    0.000     0.03     0.07        .
  + Overlap()              0.165      100    0.000    0.002    0.002    0.004    0.001     1.38     4.05        .
  + Difference()           0.094      100    0.000    0.001    0.001    0.004    0.001     0.79     2.31        .
  + Compress()             0.037      100    0.000    0.000    0.000    0.003    0.001     0.31     0.91        .
  eval                     4.016      100    0.032    0.040    0.036    0.166    0.016    33.58    98.62        .
  total                   11.958      100    0.090    0.120    0.110    0.375    0.037   100.00   293.66    0.079
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.978       10    0.185    0.198    0.197    0.213    0.010    28.19    71.59        .
  base                     2.763       10    0.270    0.276    0.272    0.293    0.007    39.38   100.00        .
  init                     3.924       10    0.367    0.392    0.395    0.429    0.019    55.93   142.02        .
  parse                    0.005       10    0.000    0.001    0.000    0.001    0.001     0.07     0.18        .
  check                    0.036       10    0.003    0.004    0.003    0.005    0.001     0.51     1.30        .
  - usefulness             0.017       10    0.001    0.002    0.002    0.002    0.000     0.24     0.62        .
    - is_useful() 1        0.016       10    0.001    0.002    0.002    0.002    0.001     0.23     0.58        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.018       10    0.001    0.002    0.002    0.003    0.001     0.26     0.65        .
    - is_useful() 2        0.018       10    0.001    0.002    0.002    0.003    0.001     0.26     0.65        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.009       10    0.000    0.001    0.001    0.002    0.001     0.13     0.33        .
  + Difference()           0.014       10    0.000    0.001    0.001    0.003    0.001     0.20     0.51        .
  + Compress()             0.003       10    0.000    0.000    0.000    0.001    0.000     0.04     0.11        .
  eval                     3.050       10    0.266    0.305    0.297    0.348    0.029    43.47   110.39        .
  total                    7.016       10    0.668    0.702    0.707    0.732    0.024   100.00   253.93    0.425
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.479        1    3.479    3.479    3.479    3.479        .    51.40   121.77        .
  base                     2.857        1    2.857    2.857    2.857    2.857        .    42.21   100.00        .
  init                     3.892        1    3.892    3.892    3.892    3.892        .    57.51   136.23        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.04        .
  check                    0.003        1    0.003    0.003    0.003    0.003        .     0.04     0.11        .
  - usefulness             0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.07        .
    - is_useful() 1        0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.07        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.04        .
    - is_useful() 2        0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.04        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()             0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.04        .
  eval                     2.872        1    2.872    2.872    2.872    2.872        .    42.43   100.53        .
  total                    6.768        1    6.768    6.768    6.768    6.768        .   100.00   236.89    3.911
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.016     1000    0.001    0.002    0.002    0.014    0.001    56.97   800.00        .
  base                     0.252     1000    0.000    0.000    0.000    0.004    0.000     7.12   100.00        .
  init                     0.623     1000    0.000    0.001    0.001    0.007    0.001    17.60   247.22        .
  parse                    0.516     1000    0.000    0.001    0.001    0.002    0.001    14.58   204.76        .
  check                    2.133     1000    0.001    0.002    0.002    0.050    0.002    60.27   846.43        .
  - usefulness             0.573     1000    0.000    0.001    0.001    0.002    0.001    16.19   227.38        .
    - is_useful() 1        0.536     1000    0.000    0.001    0.001    0.002    0.001    15.15   212.70        .
  - combine                0.020     1000    0.000    0.000    0.000    0.001    0.000     0.57     7.94        .
  - exhaustiveness         1.456     1000    0.001    0.001    0.001    0.049    0.002    41.14   577.78        .
    - is_useful() 2        1.377     1000    0.001    0.001    0.001    0.049    0.002    38.91   546.43        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.14     1.98        .
  - print                  0.022     1000    0.000    0.000    0.000    0.001    0.000     0.62     8.73        .
  + Overlap()              0.695     1000    0.000    0.001    0.001    0.049    0.002    19.64   275.79        .
  + Difference()           0.756     1000    0.000    0.001    0.001    0.005    0.001    21.36   300.00        .
  + Compress()             0.259     1000    0.000    0.000    0.000    0.002    0.000     7.32   102.78        .
  eval                     0.245     1000    0.000    0.000    0.000    0.001    0.000     6.92    97.22        .
  total                    3.539     1000    0.002    0.004    0.003    0.052    0.002   100.00  1404.37    0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              20.558     1000    0.007    0.021    0.022    0.040    0.006    85.12   432.80        .
  base                     4.750     1000    0.001    0.005    0.005    0.011    0.002    19.67   100.00        .
  init                    13.121     1000    0.004    0.013    0.014    0.025    0.004    54.33   276.23        .
  parse                    1.272     1000    0.000    0.001    0.001    0.004    0.001     5.27    26.78        .
  check                    5.017     1000    0.001    0.005    0.005    0.012    0.002    20.77   105.62        .
  - usefulness             1.405     1000    0.000    0.001    0.001    0.005    0.001     5.82    29.58        .
    - is_useful() 1        1.276     1000    0.000    0.001    0.001    0.005    0.001     5.28    26.86        .
  - combine                0.055     1000    0.000    0.000    0.000    0.001    0.000     0.23     1.16        .
  - exhaustiveness         3.363     1000    0.001    0.003    0.004    0.008    0.001    13.92    70.80        .
    - is_useful() 2        3.188     1000    0.001    0.003    0.003    0.008    0.001    13.20    67.12        .
  - compress               0.013     1000    0.000    0.000    0.000    0.001    0.000     0.05     0.27        .
  - print                  0.061     1000    0.000    0.000    0.000    0.002    0.000     0.25     1.28        .
  + Overlap()              1.574     1000    0.000    0.002    0.002    0.005    0.001     6.52    33.14        .
  + Difference()           1.809     1000    0.000    0.002    0.002    0.005    0.001     7.49    38.08        .
  + Compress()             0.617     1000    0.000    0.001    0.001    0.003    0.001     2.55    12.99        .
  eval                     4.651     1000    0.001    0.005    0.005    0.012    0.002    19.26    97.92        .
  total                   24.152     1000    0.008    0.024    0.026    0.047    0.007   100.00   508.46    0.019
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              11.046      100    0.066    0.110    0.080    0.245    0.057    85.41   411.86        .
  base                     2.682      100    0.015    0.027    0.019    0.073    0.015    20.74   100.00        .
  init                     9.927      100    0.059    0.099    0.074    0.207    0.050    76.76   370.13        .
  parse                    0.072      100    0.000    0.001    0.001    0.002    0.001     0.56     2.68        .
  check                    0.291      100    0.001    0.003    0.002    0.008    0.002     2.25    10.85        .
  - usefulness             0.092      100    0.000    0.001    0.001    0.003    0.001     0.71     3.43        .
    - is_useful() 1        0.085      100    0.000    0.001    0.001    0.002    0.001     0.66     3.17        .
  - combine                0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     0.11        .
  - exhaustiveness         0.188      100    0.001    0.002    0.001    0.005    0.001     1.45     7.01        .
    - is_useful() 2        0.177      100    0.001    0.002    0.001    0.004    0.001     1.37     6.60        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.04        .
  + Overlap()              0.088      100    0.000    0.001    0.001    0.003    0.001     0.68     3.28        .
  + Difference()           0.112      100    0.000    0.001    0.001    0.003    0.001     0.87     4.18        .
  + Compress()             0.030      100    0.000    0.000    0.000    0.002    0.000     0.23     1.12        .
  eval                     2.629      100    0.015    0.026    0.019    0.060    0.014    20.33    98.02        .
  total                   12.933      100    0.076    0.129    0.095    0.265    0.066   100.00   482.21    0.103
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              14.965       10    0.760    1.496    0.847    2.255    0.739   107.03   422.38        .
  base                     3.543       10    0.170    0.354    0.264    0.534    0.167    25.34   100.00        .
  init                    10.638       10    0.489    1.064    1.259    1.494    0.477    76.08   300.25        .
  parse                    0.009       10    0.000    0.001    0.001    0.002    0.001     0.06     0.25        .
  check                    0.042       10    0.002    0.004    0.003    0.007    0.002     0.30     1.19        .
  - usefulness             0.013       10    0.000    0.001    0.001    0.002    0.001     0.09     0.37        .
    - is_useful() 1        0.013       10    0.000    0.001    0.001    0.002    0.001     0.09     0.37        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.025       10    0.001    0.003    0.002    0.004    0.001     0.18     0.71        .
    - is_useful() 2        0.024       10    0.001    0.002    0.002    0.004    0.001     0.17     0.68        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.002       10    0.000    0.000    0.000    0.001    0.000     0.01     0.06        .
  + Overlap()              0.009       10    0.000    0.001    0.001    0.002    0.001     0.06     0.25        .
  + Difference()           0.017       10    0.000    0.002    0.001    0.003    0.001     0.12     0.48        .
  + Compress()             0.006       10    0.000    0.001    0.001    0.001    0.001     0.04     0.17        .
  eval                     3.292       10    0.157    0.329    0.169    0.521    0.176    23.54    92.92        .
  total                   13.982       10    0.649    1.398    1.420    2.023    0.640   100.00   394.64    1.044
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              23.593        1   23.593   23.593   23.593   23.593        .   161.70   482.08        .
  base                     4.894        1    4.894    4.894    4.894    4.894        .    33.54   100.00        .
  init                    12.848        1   12.848   12.848   12.848   12.848        .    88.05   262.53        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.02        .
  check                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.06        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.02        .
    - is_useful() 1        0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.02        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.04        .
    - is_useful() 2        0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.02        .
  + Difference()           0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.02        .
  + Compress()             0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.02        .
  eval                     1.739        1    1.739    1.739    1.739    1.739        .    11.92    35.53        .
  total                   14.591        1   14.591   14.591   14.591   14.591        .   100.00   298.14    9.697
-------------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.164      100    0.000    0.002    0.002    0.003    0.001     0.45    47.67        .
  base                     0.344      100    0.001    0.003    0.004    0.007    0.001     0.94   100.00        .
  init                     0.167      100    0.000    0.002    0.002    0.005    0.001     0.46    48.55        .
  parse                    0.845      100    0.003    0.008    0.010    0.017    0.003     2.31   245.64        .
  check                   35.171      100    0.138    0.352    0.414    0.471    0.122    96.12 10224.13        .
  - usefulness            15.435      100    0.060    0.154    0.182    0.224    0.055    42.18  4486.92        .
    - is_useful() 1       15.053      100    0.056    0.151    0.178    0.220    0.053    41.14  4375.87        .
  - combine                0.218      100    0.000    0.002    0.002    0.004    0.001     0.60    63.37        .
  - exhaustiveness        19.433      100    0.075    0.194    0.226    0.274    0.067    53.11  5649.13        .
    - is_useful() 2       19.288      100    0.074    0.193    0.225    0.271    0.067    52.72  5606.98        .
  - compress               0.004      100    0.000    0.000    0.000    0.001    0.000     0.01     1.16        .
  - print                  0.024      100    0.000    0.000    0.000    0.001    0.000     0.07     6.98        .
  + Overlap()             14.555      100    0.051    0.146    0.170    0.205    0.051    39.78  4231.10        .
  + Difference()          13.060      100    0.047    0.131    0.151    0.184    0.045    35.69  3796.51        .
  + Compress()             2.270      100    0.006    0.023    0.025    0.036    0.009     6.20   659.88        .
  eval                     0.396      100    0.001    0.004    0.004    0.006    0.001     1.08   115.12        .
  total                   36.589      100    0.145    0.366    0.430    0.487    0.126   100.00 10636.34    0.362
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.541      100    0.004    0.005    0.005    0.009    0.001     1.13    14.97        .
  base                     3.615      100    0.029    0.036    0.035    0.050    0.003     7.57   100.00        .
  init                     0.505      100    0.004    0.005    0.005    0.008    0.001     1.06    13.97        .
  parse                    1.025      100    0.007    0.010    0.010    0.016    0.001     2.15    28.35        .
  check                   42.485      100    0.398    0.425    0.420    0.492    0.019    88.99  1175.24        .
  - usefulness            18.701      100    0.173    0.187    0.184    0.226    0.009    39.17   517.32        .
    - is_useful() 1       18.211      100    0.168    0.182    0.180    0.219    0.009    38.14   503.76        .
  - combine                0.259      100    0.001    0.003    0.003    0.005    0.001     0.54     7.16        .
  - exhaustiveness        23.434      100    0.217    0.234    0.230    0.279    0.014    49.08   648.24        .
    - is_useful() 2       23.266      100    0.215    0.233    0.228    0.276    0.014    48.73   643.60        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.00     0.06        .
  - print                  0.027      100    0.000    0.000    0.000    0.001    0.000     0.06     0.75        .
  + Overlap()             17.511      100    0.151    0.175    0.174    0.211    0.011    36.68   484.40        .
  + Difference()          15.886      100    0.143    0.159    0.156    0.191    0.010    33.27   439.45        .
  + Compress()             2.781      100    0.017    0.028    0.028    0.038    0.004     5.82    76.93        .
  eval                     3.713      100    0.027    0.037    0.036    0.052    0.004     7.78   102.71        .
  total                   47.744      100    0.445    0.477    0.472    0.541    0.019   100.00  1320.72    0.441
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.321       10    0.027    0.032    0.031    0.044    0.005     3.84     9.33        .
  base                     3.442       10    0.337    0.344    0.343    0.351    0.005    41.16   100.00        .
  init                     0.409       10    0.038    0.041    0.039    0.047    0.003     4.89    11.88        .
  parse                    0.103       10    0.009    0.010    0.010    0.011    0.001     1.23     2.99        .
  check                    4.161       10    0.406    0.416    0.414    0.426    0.006    49.75   120.89        .
  - usefulness             1.811       10    0.178    0.181    0.180    0.187    0.003    21.65    52.61        .
    - is_useful() 1        1.777       10    0.174    0.178    0.179    0.181    0.003    21.25    51.63        .
  - combine                0.025       10    0.002    0.003    0.002    0.003    0.001     0.30     0.73        .
  - exhaustiveness         2.318       10    0.224    0.232    0.229    0.243    0.007    27.72    67.34        .
    - is_useful() 2        2.298       10    0.222    0.230    0.228    0.241    0.007    27.48    66.76        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.002       10    0.000    0.000    0.000    0.001    0.000     0.02     0.06        .
  + Overlap()              1.728       10    0.163    0.173    0.172    0.182    0.006    20.66    50.20        .
  + Difference()           1.544       10    0.150    0.154    0.154    0.159    0.003    18.46    44.86        .
  + Compress()             0.268       10    0.021    0.027    0.027    0.034    0.004     3.20     7.79        .
  eval                     3.688       10    0.354    0.369    0.366    0.383    0.010    44.10   107.15        .
  total                    8.363       10    0.821    0.836    0.828    0.858    0.015   100.00   242.97    0.492
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.460        1    0.460    0.460    0.460    0.460        .    10.70    12.97        .
  base                     3.548        1    3.548    3.548    3.548    3.548        .    82.51   100.00        .
  init                     0.379        1    0.379    0.379    0.379    0.379        .     8.81    10.68        .
  parse                    0.010        1    0.010    0.010    0.010    0.010        .     0.23     0.28        .
  check                    0.407        1    0.407    0.407    0.407    0.407        .     9.47    11.47        .
  - usefulness             0.182        1    0.182    0.182    0.182    0.182        .     4.23     5.13        .
    - is_useful() 1        0.178        1    0.178    0.178    0.178    0.178        .     4.14     5.02        .
  - combine                0.002        1    0.002    0.002    0.002    0.002        .     0.05     0.06        .
  - exhaustiveness         0.222        1    0.222    0.222    0.222    0.222        .     5.16     6.26        .
    - is_useful() 2        0.221        1    0.221    0.221    0.221    0.221        .     5.14     6.23        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.177        1    0.177    0.177    0.177    0.177        .     4.12     4.99        .
  + Difference()           0.149        1    0.149    0.149    0.149    0.149        .     3.47     4.20        .
  + Compress()             0.031        1    0.031    0.031    0.031    0.031        .     0.72     0.87        .
  eval                     3.503        1    3.503    3.503    3.503    3.503        .    81.47    98.73        .
  total                    4.300        1    4.300    4.300    4.300    4.300        .   100.00   121.20    0.752
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.539        1    6.539    6.539    6.539    6.539        .    23.45    18.53        .
  base                    35.281        1   35.281   35.281   35.281   35.281        .   126.54   100.00        .
  init                     3.847        1    3.847    3.847    3.847    3.847        .    13.80    10.90        .
  parse                    0.008        1    0.008    0.008    0.008    0.008        .     0.03     0.02        .
  check                    0.409        1    0.409    0.409    0.409    0.409        .     1.47     1.16        .
  - usefulness             0.186        1    0.186    0.186    0.186    0.186        .     0.67     0.53        .
    - is_useful() 1        0.175        1    0.175    0.175    0.175    0.175        .     0.63     0.50        .
  - combine                0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.01        .
  - exhaustiveness         0.219        1    0.219    0.219    0.219    0.219        .     0.79     0.62        .
    - is_useful() 2        0.218        1    0.218    0.218    0.218    0.218        .     0.78     0.62        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.167        1    0.167    0.167    0.167    0.167        .     0.60     0.47        .
  + Difference()           0.145        1    0.145    0.145    0.145    0.145        .     0.52     0.41        .
  + Compress()             0.023        1    0.023    0.023    0.023    0.023        .     0.08     0.07        .
  eval                    23.617        1   23.617   23.617   23.617   23.617        .    84.71    66.94        .
  total                   27.881        1   27.881   27.881   27.881   27.881        .   100.00    79.03   -7.400
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.181      100    0.000    0.002    0.002    0.004    0.001     0.46    45.59        .
  base                     0.397      100    0.001    0.004    0.004    0.008    0.001     1.01   100.00        .
  init                     0.223      100    0.000    0.002    0.002    0.004    0.001     0.57    56.17        .
  parse                    1.000      100    0.003    0.010    0.010    0.085    0.008     2.54   251.89        .
  check                   37.600      100    0.142    0.376    0.421    0.491    0.109    95.67  9471.03        .
  - usefulness            16.528      100    0.060    0.165    0.184    0.227    0.049    42.05  4163.22        .
    - is_useful() 1       16.170      100    0.059    0.162    0.180    0.222    0.048    41.14  4073.05        .
  - combine                0.242      100    0.001    0.002    0.003    0.004    0.001     0.62    60.96        .
  - exhaustiveness        20.757      100    0.077    0.208    0.231    0.294    0.061    52.81  5228.46        .
    - is_useful() 2       20.615      100    0.077    0.206    0.230    0.291    0.061    52.45  5192.70        .
  - compress               0.006      100    0.000    0.000    0.000    0.001    0.000     0.02     1.51        .
  - print                  0.026      100    0.000    0.000    0.000    0.001    0.000     0.07     6.55        .
  + Overlap()             15.539      100    0.057    0.155    0.174    0.212    0.045    39.54  3914.11        .
  + Difference()          14.003      100    0.050    0.140    0.155    0.191    0.041    35.63  3527.20        .
  + Compress()             2.462      100    0.004    0.025    0.026    0.039    0.008     6.26   620.15        .
  eval                     0.465      100    0.001    0.005    0.005    0.009    0.002     1.18   117.13        .
  total                   39.303      100    0.148    0.393    0.440    0.574    0.114   100.00  9900.00    0.389
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.504      100    0.002    0.005    0.005    0.009    0.001     1.28    14.17        .
  base                     3.558      100    0.012    0.036    0.042    0.081    0.017     9.05   100.00        .
  init                     0.917      100    0.003    0.009    0.011    0.027    0.004     2.33    25.77        .
  parse                    0.825      100    0.003    0.008    0.010    0.017    0.004     2.10    23.19        .
  check                   33.762      100    0.139    0.338    0.416    0.524    0.134    85.83   948.90        .
  - usefulness            14.864      100    0.059    0.149    0.182    0.230    0.059    37.79   417.76        .
    - is_useful() 1       14.494      100    0.058    0.145    0.177    0.227    0.058    36.85   407.36        .
  - combine                0.211      100    0.000    0.002    0.002    0.005    0.001     0.54     5.93        .
  - exhaustiveness        18.609      100    0.076    0.186    0.229    0.315    0.075    47.31   523.02        .
    - is_useful() 2       18.471      100    0.075    0.185    0.227    0.312    0.074    46.96   519.14        .
  - compress               0.003      100    0.000    0.000    0.000    0.001    0.000     0.01     0.08        .
  - print                  0.019      100    0.000    0.000    0.000    0.001    0.000     0.05     0.53        .
  + Overlap()             14.009      100    0.051    0.140    0.172    0.250    0.056    35.62   393.73        .
  + Difference()          12.564      100    0.049    0.126    0.153    0.187    0.050    31.94   353.12        .
  + Compress()             2.188      100    0.006    0.022    0.026    0.038    0.009     5.56    61.50        .
  eval                     3.821      100    0.013    0.038    0.046    0.085    0.017     9.71   107.39        .
  total                   39.334      100    0.160    0.393    0.487    0.607    0.157   100.00  1105.51    0.358
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.184       10    0.015    0.018    0.019    0.021    0.002     1.56    10.95        .
  base                     1.681       10    0.136    0.168    0.167    0.205    0.024    14.24   100.00        .
  init                     0.723       10    0.055    0.072    0.060    0.129    0.023     6.12    43.01        .
  parse                    0.037       10    0.003    0.004    0.003    0.005    0.001     0.31     2.20        .
  check                    9.435       10    0.137    0.944    0.163    8.022    2.487    79.91   561.27        .
  - usefulness             0.677       10    0.060    0.068    0.068    0.082    0.007     5.73    40.27        .
    - is_useful() 1        0.664       10    0.058    0.066    0.067    0.081    0.008     5.62    39.50        .
  - combine                0.010       10    0.000    0.001    0.001    0.003    0.001     0.08     0.59        .
  - exhaustiveness         8.745       10    0.075    0.874    0.086    7.954    2.488    74.07   520.23        .
    - is_useful() 2        8.736       10    0.075    0.874    0.085    7.953    2.487    73.99   519.69        .
  - compress               0.001       10    0.000    0.000    0.000    0.001    0.000     0.01     0.06        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.01     0.06        .
  + Overlap()              8.526       10    0.054    0.853    0.071    7.932    2.487    72.21   507.20        .
  + Difference()           0.586       10    0.048    0.059    0.057    0.069    0.008     4.96    34.86        .
  + Compress()             0.105       10    0.008    0.011    0.011    0.013    0.002     0.89     6.25        .
  eval                     1.612       10    0.140    0.161    0.154    0.195    0.018    13.65    95.90        .
  total                   11.807       10    0.342    1.181    0.393    8.253    2.485   100.00   702.38    1.013
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.296        1    0.296    0.296    0.296    0.296        .    15.76    22.41        .
  base                     1.321        1    1.321    1.321    1.321    1.321        .    70.34   100.00        .
  init                     0.362        1    0.362    0.362    0.362    0.362        .    19.28    27.40        .
  parse                    0.005        1    0.005    0.005    0.005    0.005        .     0.27     0.38        .
  check                    0.150        1    0.150    0.150    0.150    0.150        .     7.99    11.36        .
  - usefulness             0.068        1    0.068    0.068    0.068    0.068        .     3.62     5.15        .
    - is_useful() 1        0.067        1    0.067    0.067    0.067    0.067        .     3.57     5.07        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.05     0.08        .
  - exhaustiveness         0.081        1    0.081    0.081    0.081    0.081        .     4.31     6.13        .
    - is_useful() 2        0.080        1    0.080    0.080    0.080    0.080        .     4.26     6.06        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.060        1    0.060    0.060    0.060    0.060        .     3.19     4.54        .
  + Difference()           0.057        1    0.057    0.057    0.057    0.057        .     3.04     4.31        .
  + Compress()             0.011        1    0.011    0.011    0.011    0.011        .     0.59     0.83        .
  eval                     1.361        1    1.361    1.361    1.361    1.361        .    72.47   103.03        .
  total                    1.878        1    1.878    1.878    1.878    1.878        .   100.00   142.17    0.557
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.464        1    3.464    3.464    3.464    3.464        .    19.90    27.24        .
  base                    12.717        1   12.717   12.717   12.717   12.717        .    73.07   100.00        .
  init                     3.614        1    3.614    3.614    3.614    3.614        .    20.77    28.42        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.02        .
  check                    0.161        1    0.161    0.161    0.161    0.161        .     0.93     1.27        .
  - usefulness             0.059        1    0.059    0.059    0.059    0.059        .     0.34     0.46        .
    - is_useful() 1        0.057        1    0.057    0.057    0.057    0.057        .     0.33     0.45        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.101        1    0.101    0.101    0.101    0.101        .     0.58     0.79        .
    - is_useful() 2        0.100        1    0.100    0.100    0.100    0.100        .     0.57     0.79        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.072        1    0.072    0.072    0.072    0.072        .     0.41     0.57        .
  + Difference()           0.062        1    0.062    0.062    0.062    0.062        .     0.36     0.49        .
  + Compress()             0.008        1    0.008    0.008    0.008    0.008        .     0.05     0.06        .
  eval                    13.625        1   13.625   13.625   13.625   13.625        .    78.29   107.14        .
  total                   17.404        1   17.404   17.404   17.404   17.404        .   100.00   136.86    4.687
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.203      100    0.001    0.002    0.002    0.012    0.001     1.40   133.55        .
  base                     0.152      100    0.001    0.002    0.001    0.005    0.001     1.05   100.00        .
  init                     0.073      100    0.000    0.001    0.001    0.002    0.000     0.50    48.03        .
  parse                    0.254      100    0.002    0.003    0.002    0.004    0.001     1.75   167.11        .
  check                   13.993      100    0.115    0.140    0.136    0.201    0.019    96.65  9205.92        .
  - usefulness             4.271      100    0.035    0.043    0.042    0.077    0.007    29.50  2809.87        .
    - is_useful() 1        4.205      100    0.033    0.042    0.041    0.076    0.007    29.04  2766.45        .
  - combine                0.049      100    0.000    0.000    0.000    0.001    0.001     0.34    32.24        .
  - exhaustiveness         9.639      100    0.078    0.096    0.093    0.146    0.015    66.58  6341.45        .
    - is_useful() 2        9.591      100    0.078    0.096    0.093    0.145    0.015    66.25  6309.87        .
  - compress               0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     1.97        .
  - print                  0.011      100    0.000    0.000    0.000    0.001    0.000     0.08     7.24        .
  + Overlap()              5.831      100    0.045    0.058    0.057    0.087    0.009    40.27  3836.18        .
  + Difference()           6.120      100    0.048    0.061    0.058    0.116    0.011    42.27  4026.32        .
  + Compress()             1.197      100    0.008    0.012    0.011    0.048    0.005     8.27   787.50        .
  eval                     0.153      100    0.001    0.002    0.001    0.004    0.001     1.06   100.66        .
  total                   14.478      100    0.118    0.145    0.141    0.205    0.019   100.00  9525.00    0.143
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.999      100    0.008    0.010    0.010    0.015    0.002     6.68    84.66        .
  base                     1.180      100    0.010    0.012    0.011    0.018    0.002     7.88   100.00        .
  init                     0.581      100    0.005    0.006    0.005    0.013    0.001     3.88    49.24        .
  parse                    0.237      100    0.002    0.002    0.002    0.005    0.001     1.58    20.08        .
  check                   12.979      100    0.114    0.130    0.125    0.176    0.014    86.72  1099.92        .
  - usefulness             3.971      100    0.034    0.040    0.038    0.053    0.005    26.53   336.53        .
    - is_useful() 1        3.918      100    0.033    0.039    0.038    0.053    0.005    26.18   332.03        .
  - combine                0.032      100    0.000    0.000    0.000    0.001    0.000     0.21     2.71        .
  - exhaustiveness         8.945      100    0.078    0.089    0.086    0.123    0.010    59.77   758.05        .
    - is_useful() 2        8.889      100    0.077    0.089    0.086    0.122    0.010    59.39   753.31        .
  - compress               0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     0.25        .
  - print                  0.004      100    0.000    0.000    0.000    0.001    0.000     0.03     0.34        .
  + Overlap()              5.431      100    0.043    0.054    0.053    0.072    0.006    36.29   460.25        .
  + Difference()           5.593      100    0.046    0.056    0.055    0.082    0.007    37.37   473.98        .
  + Compress()             1.117      100    0.007    0.011    0.011    0.021    0.003     7.46    94.66        .
  eval                     1.164      100    0.009    0.012    0.011    0.019    0.002     7.78    98.64        .
  total                   14.966      100    0.131    0.150    0.144    0.201    0.015   100.00  1268.31    0.138
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.795       10    0.069    0.079    0.078    0.090    0.007    24.24    71.17        .
  base                     1.117       10    0.100    0.112    0.110    0.133    0.011    34.05   100.00        .
  init                     0.715       10    0.063    0.071    0.066    0.106    0.013    21.80    64.01        .
  parse                    0.023       10    0.002    0.002    0.002    0.003    0.000     0.70     2.06        .
  check                    1.300       10    0.116    0.130    0.123    0.150    0.013    39.63   116.38        .
  - usefulness             0.393       10    0.034    0.039    0.037    0.045    0.004    11.98    35.18        .
    - is_useful() 1        0.386       10    0.033    0.039    0.037    0.045    0.004    11.77    34.56        .
  - combine                0.005       10    0.000    0.001    0.000    0.002    0.001     0.15     0.45        .
  - exhaustiveness         0.900       10    0.078    0.090    0.086    0.104    0.010    27.44    80.57        .
    - is_useful() 2        0.896       10    0.078    0.090    0.085    0.104    0.010    27.32    80.21        .
  - compress               0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.09        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.539       10    0.046    0.054    0.050    0.065    0.006    16.43    48.25        .
  + Difference()           0.574       10    0.051    0.057    0.053    0.073    0.008    17.50    51.39        .
  + Compress()             0.115       10    0.008    0.011    0.011    0.015    0.002     3.51    10.30        .
  eval                     1.242       10    0.104    0.124    0.119    0.146    0.015    37.87   111.19        .
  total                    3.280       10    0.294    0.328    0.321    0.389    0.029   100.00   293.64    0.216
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.852        1    0.852    0.852    0.852    0.852        .    44.58    68.71        .
  base                     1.240        1    1.240    1.240    1.240    1.240        .    64.89   100.00        .
  init                     0.577        1    0.577    0.577    0.577    0.577        .    30.19    46.53        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.10     0.16        .
  check                    0.117        1    0.117    0.117    0.117    0.117        .     6.12     9.44        .
  - usefulness             0.036        1    0.036    0.036    0.036    0.036        .     1.88     2.90        .
    - is_useful() 1        0.036        1    0.036    0.036    0.036    0.036        .     1.88     2.90        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.081        1    0.081    0.081    0.081    0.081        .     4.24     6.53        .
    - is_useful() 2        0.080        1    0.080    0.080    0.080    0.080        .     4.19     6.45        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.048        1    0.048    0.048    0.048    0.048        .     2.51     3.87        .
  + Difference()           0.050        1    0.050    0.050    0.050    0.050        .     2.62     4.03        .
  + Compress()             0.012        1    0.012    0.012    0.012    0.012        .     0.63     0.97        .
  eval                     1.215        1    1.215    1.215    1.215    1.215        .    63.58    97.98        .
  total                    1.911        1    1.911    1.911    1.911    1.911        .   100.00   154.11    0.671
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              10.017        1   10.017   10.017   10.017   10.017        .    60.16    87.75        .
  base                    11.415        1   11.415   11.415   11.415   11.415        .    68.56   100.00        .
  init                     5.480        1    5.480    5.480    5.480    5.480        .    32.91    48.01        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.02        .
  check                    0.125        1    0.125    0.125    0.125    0.125        .     0.75     1.10        .
  - usefulness             0.039        1    0.039    0.039    0.039    0.039        .     0.23     0.34        .
    - is_useful() 1        0.039        1    0.039    0.039    0.039    0.039        .     0.23     0.34        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.085        1    0.085    0.085    0.085    0.085        .     0.51     0.74        .
    - is_useful() 2        0.085        1    0.085    0.085    0.085    0.085        .     0.51     0.74        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.055        1    0.055    0.055    0.055    0.055        .     0.33     0.48        .
  + Difference()           0.053        1    0.053    0.053    0.053    0.053        .     0.32     0.46        .
  + Compress()             0.010        1    0.010    0.010    0.010    0.010        .     0.06     0.09        .
  eval                    11.043        1   11.043   11.043   11.043   11.043        .    66.32    96.74        .
  total                   16.650        1   16.650   16.650   16.650   16.650        .   100.00   145.86    5.235
-------------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.00     6.67        .
  base                     0.015        1    0.015    0.015    0.015    0.015        .     0.03   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.00     6.67        .
  parse                    0.158        1    0.158    0.158    0.158    0.158        .     0.32  1053.33        .
  check                   49.273        1   49.273   49.273   49.273   49.273        .    99.65  3.3e+05        .
  - usefulness            40.153        1   40.153   40.153   40.153   40.153        .    81.21  2.7e+05        .
    - is_useful() 1       39.900        1   39.900   39.900   39.900   39.900        .    80.70  2.7e+05        .
  - combine                0.128        1    0.128    0.128    0.128    0.128        .     0.26   853.33        .
  - exhaustiveness         8.986        1    8.986    8.986    8.986    8.986        .    18.17 59906.67        .
    - is_useful() 2        8.980        1    8.980    8.980    8.980    8.980        .    18.16 59866.67        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     6.67        .
  + Overlap()             14.435        1   14.435   14.435   14.435   14.435        .    29.19 96233.33        .
  + Difference()           5.821        1    5.821    5.821    5.821    5.821        .    11.77 38806.67        .
  + Compress()             9.320        1    9.320    9.320    9.320    9.320        .    18.85 62133.33        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.03    86.67        .
  total                   49.445        1   49.445   49.445   49.445   49.445        .   100.00  3.3e+05   49.430
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.00     1.98        .
  base                     0.101        1    0.101    0.101    0.101    0.101        .     0.16   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.00     1.98        .
  parse                    0.145        1    0.145    0.145    0.145    0.145        .     0.23   143.56        .
  check                   62.147        1   62.147   62.147   62.147   62.147        .    99.58 61531.68        .
  - usefulness            52.668        1   52.668   52.668   52.668   52.668        .    84.39 52146.53        .
    - is_useful() 1       52.384        1   52.384   52.384   52.384   52.384        .    83.94 51865.35        .
  - combine                0.150        1    0.150    0.150    0.150    0.150        .     0.24   148.51        .
  - exhaustiveness         9.325        1    9.325    9.325    9.325    9.325        .    14.94  9232.67        .
    - is_useful() 2        9.317        1    9.317    9.317    9.317    9.317        .    14.93  9224.75        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.002        1    0.002    0.002    0.002    0.002        .     0.00     1.98        .
  + Overlap()             18.022        1   18.022   18.022   18.022   18.022        .    28.88 17843.56        .
  + Difference()           5.950        1    5.950    5.950    5.950    5.950        .     9.53  5891.09        .
  + Compress()            12.406        1   12.406   12.406   12.406   12.406        .    19.88 12283.17        .
  eval                     0.114        1    0.114    0.114    0.114    0.114        .     0.18   112.87        .
  total                   62.408        1   62.408   62.408   62.408   62.408        .   100.00 61790.10   62.307
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.018        1    0.018    0.018    0.018    0.018        .     0.03     1.81        .
  base                     0.997        1    0.997    0.997    0.997    0.997        .     1.91   100.00        .
  init                     0.013        1    0.013    0.013    0.013    0.013        .     0.02     1.30        .
  parse                    0.152        1    0.152    0.152    0.152    0.152        .     0.29    15.25        .
  check                   50.921        1   50.921   50.921   50.921   50.921        .    97.72  5107.42        .
  - usefulness            41.762        1   41.762   41.762   41.762   41.762        .    80.15  4188.77        .
    - is_useful() 1       41.498        1   41.498   41.498   41.498   41.498        .    79.64  4162.29        .
  - combine                0.140        1    0.140    0.140    0.140    0.140        .     0.27    14.04        .
  - exhaustiveness         9.016        1    9.016    9.016    9.016    9.016        .    17.30   904.31        .
    - is_useful() 2        9.008        1    9.008    9.008    9.008    9.008        .    17.29   903.51        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.10        .
  + Overlap()             14.870        1   14.870   14.870   14.870   14.870        .    28.54  1491.47        .
  + Difference()           5.822        1    5.822    5.822    5.822    5.822        .    11.17   583.95        .
  + Compress()             9.669        1    9.669    9.669    9.669    9.669        .    18.56   969.81        .
  eval                     1.020        1    1.020    1.020    1.020    1.020        .     1.96   102.31        .
  total                   52.107        1   52.107   52.107   52.107   52.107        .   100.00  5226.38   51.110
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.204        1    0.204    0.204    0.204    0.204        .     0.32     1.94        .
  base                    10.503        1   10.503   10.503   10.503   10.503        .    16.32   100.00        .
  init                     0.122        1    0.122    0.122    0.122    0.122        .     0.19     1.16        .
  parse                    0.148        1    0.148    0.148    0.148    0.148        .     0.23     1.41        .
  check                   50.194        1   50.194   50.194   50.194   50.194        .    78.01   477.90        .
  - usefulness            41.112        1   41.112   41.112   41.112   41.112        .    63.90   391.43        .
    - is_useful() 1       40.863        1   40.863   40.863   40.863   40.863        .    63.51   389.06        .
  - combine                0.130        1    0.130    0.130    0.130    0.130        .     0.20     1.24        .
  - exhaustiveness         8.948        1    8.948    8.948    8.948    8.948        .    13.91    85.19        .
    - is_useful() 2        8.941        1    8.941    8.941    8.941    8.941        .    13.90    85.13        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()             14.622        1   14.622   14.622   14.622   14.622        .    22.73   139.22        .
  + Difference()           5.818        1    5.818    5.818    5.818    5.818        .     9.04    55.39        .
  + Compress()             9.580        1    9.580    9.580    9.580    9.580        .    14.89    91.21        .
  eval                    13.875        1   13.875   13.875   13.875   13.875        .    21.57   132.11        .
  total                   64.340        1   64.340   64.340   64.340   64.340        .   100.00   612.59   53.837
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_integer, obs(10000000) levels(1000) rep(1)
. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.00     2.94        .
  base                     0.034        1    0.034    0.034    0.034    0.034        .     0.05   100.00        .
  init                     0.004        1    0.004    0.004    0.004    0.004        .     0.01    11.76        .
  parse                    0.469        1    0.469    0.469    0.469    0.469        .     0.76  1379.41        .
  check                   61.425        1   61.425   61.425   61.425   61.425        .    99.21  1.8e+05        .
  - usefulness            52.333        1   52.333   52.333   52.333   52.333        .    84.53  1.5e+05        .
    - is_useful() 1       52.000        1   52.000   52.000   52.000   52.000        .    83.99  1.5e+05        .
  - combine                0.124        1    0.124    0.124    0.124    0.124        .     0.20   364.71        .
  - exhaustiveness         8.963        1    8.963    8.963    8.963    8.963        .    14.48 26361.76        .
    - is_useful() 2        8.957        1    8.957    8.957    8.957    8.957        .    14.47 26344.12        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     2.94        .
  + Overlap()             17.852        1   17.852   17.852   17.852   17.852        .    28.83 52505.88        .
  + Difference()           5.712        1    5.712    5.712    5.712    5.712        .     9.23 16800.00        .
  + Compress()            12.170        1   12.170   12.170   12.170   12.170        .    19.66 35794.12        .
  eval                     0.014        1    0.014    0.014    0.014    0.014        .     0.02    41.18        .
  total                   61.914        1   61.914   61.914   61.914   61.914        .   100.00  1.8e+05   61.880
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.003        1    0.003    0.003    0.003    0.003        .     0.01     2.63        .
  base                     0.114        1    0.114    0.114    0.114    0.114        .     0.23   100.00        .
  init                     0.004        1    0.004    0.004    0.004    0.004        .     0.01     3.51        .
  parse                    0.142        1    0.142    0.142    0.142    0.142        .     0.28   124.56        .
  check                   50.356        1   50.356   50.356   50.356   50.356        .    99.45 44171.93        .
  - usefulness            41.079        1   41.079   41.079   41.079   41.079        .    81.12 36034.21        .
    - is_useful() 1       40.821        1   40.821   40.821   40.821   40.821        .    80.61 35807.89        .
  - combine                0.128        1    0.128    0.128    0.128    0.128        .     0.25   112.28        .
  - exhaustiveness         9.145        1    9.145    9.145    9.145    9.145        .    18.06  8021.93        .
    - is_useful() 2        9.137        1    9.137    9.137    9.137    9.137        .    18.04  8014.91        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.88        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.88        .
  + Overlap()             14.936        1   14.936   14.936   14.936   14.936        .    29.50 13101.75        .
  + Difference()           5.862        1    5.862    5.862    5.862    5.862        .    11.58  5142.11        .
  + Compress()             9.608        1    9.608    9.608    9.608    9.608        .    18.97  8428.07        .
  eval                     0.134        1    0.134    0.134    0.134    0.134        .     0.26   117.54        .
  total                   50.637        1   50.637   50.637   50.637   50.637        .   100.00 44418.42   50.523
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.022        1    0.022    0.022    0.022    0.022        .     0.01     1.01        .
  base                     2.168        1    2.168    2.168    2.168    2.168        .     1.35   100.00        .
  init                     0.181        1    0.181    0.181    0.181    0.181        .     0.11     8.35        .
  parse                    0.506        1    0.506    0.506    0.506    0.506        .     0.31    23.34        .
  check                  156.805        1  156.805  156.805  156.805  156.805        .    97.34  7232.70        .
  - usefulness           131.063        1  131.063  131.063  131.063  131.063        .    81.36  6045.34        .
    - is_useful() 1      130.369        1  130.369  130.369  130.369  130.369        .    80.93  6013.33        .
  - combine                0.381        1    0.381    0.381    0.381    0.381        .     0.24    17.57        .
  - exhaustiveness        25.347        1   25.347   25.347   25.347   25.347        .    15.74  1169.14        .
    - is_useful() 2       25.329        1   25.329   25.329   25.329   25.329        .    15.72  1168.31        .
  - compress               0.002        1    0.002    0.002    0.002    0.002        .     0.00     0.09        .
  - print                  0.004        1    0.004    0.004    0.004    0.004        .     0.00     0.18        .
  + Overlap()             45.912        1   45.912   45.912   45.912   45.912        .    28.50  2117.71        .
  + Difference()          16.645        1   16.645   16.645   16.645   16.645        .    10.33   767.76        .
  + Compress()            30.277        1   30.277   30.277   30.277   30.277        .    18.80  1396.54        .
  eval                     3.591        1    3.591    3.591    3.591    3.591        .     2.23   165.64        .
  total                  161.086        1  161.086  161.086  161.086  161.086        .   100.00  7430.17  158.918
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.451        1    0.451    0.451    0.451    0.451        .     0.31     1.40        .
  base                    32.135        1   32.135   32.135   32.135   32.135        .    22.21   100.00        .
  init                     0.609        1    0.609    0.609    0.609    0.609        .     0.42     1.90        .
  parse                    0.440        1    0.440    0.440    0.440    0.440        .     0.30     1.37        .
  check                  132.367        1  132.367  132.367  132.367  132.367        .    91.50   411.91        .
  - usefulness           122.561        1  122.561  122.561  122.561  122.561        .    84.73   381.39        .
    - is_useful() 1      121.899        1  121.899  121.899  121.899  121.899        .    84.27   379.33        .
  - combine                0.130        1    0.130    0.130    0.130    0.130        .     0.09     0.40        .
  - exhaustiveness         9.670        1    9.670    9.670    9.670    9.670        .     6.68    30.09        .
    - is_useful() 2        9.663        1    9.663    9.663    9.663    9.663        .     6.68    30.07        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.00        .
  + Overlap()             36.692        1   36.692   36.692   36.692   36.692        .    25.36   114.18        .
  + Difference()           7.749        1    7.749    7.749    7.749    7.749        .     5.36    24.11        .
  + Compress()            28.694        1   28.694   28.694   28.694   28.694        .    19.84    89.29        .
  eval                    11.241        1   11.241   11.241   11.241   11.241        .     7.77    34.98        .
  total                  144.657        1  144.657  144.657  144.657  144.657        .   100.00   450.15  112.522
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_float,   obs(10000000) levels(1000) rep(1)
. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.00     9.09        .
  base                     0.011        1    0.011    0.011    0.011    0.011        .     0.03   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.00     9.09        .
  parse                    0.071        1    0.071    0.071    0.071    0.071        .     0.22   645.45        .
  check                   32.303        1   32.303   32.303   32.303   32.303        .    99.72  2.9e+05        .
  - usefulness            15.194        1   15.194   15.194   15.194   15.194        .    46.90  1.4e+05        .
    - is_useful() 1       15.101        1   15.101   15.101   15.101   15.101        .    46.62  1.4e+05        .
  - combine                0.065        1    0.065    0.065    0.065    0.065        .     0.20   590.91        .
  - exhaustiveness        17.040        1   17.040   17.040   17.040   17.040        .    52.60  1.5e+05        .
    - is_useful() 2       17.030        1   17.030   17.030   17.030   17.030        .    52.57  1.5e+05        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     9.09        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              8.678        1    8.678    8.678    8.678    8.678        .    26.79 78890.91        .
  + Difference()          13.349        1   13.349   13.349   13.349   13.349        .    41.21  1.2e+05        .
  + Compress()             3.633        1    3.633    3.633    3.633    3.633        .    11.22 33027.27        .
  eval                     0.018        1    0.018    0.018    0.018    0.018        .     0.06   163.64        .
  total                   32.394        1   32.394   32.394   32.394   32.394        .   100.00  2.9e+05   32.383
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.013        1    0.013    0.013    0.013    0.013        .     0.05    10.24        .
  base                     0.127        1    0.127    0.127    0.127    0.127        .     0.51   100.00        .
  init                     0.008        1    0.008    0.008    0.008    0.008        .     0.03     6.30        .
  parse                    0.076        1    0.076    0.076    0.076    0.076        .     0.31    59.84        .
  check                   24.521        1   24.521   24.521   24.521   24.521        .    99.25 19307.87        .
  - usefulness            15.222        1   15.222   15.222   15.222   15.222        .    61.61 11985.83        .
    - is_useful() 1       15.109        1   15.109   15.109   15.109   15.109        .    61.15 11896.85        .
  - combine                0.065        1    0.065    0.065    0.065    0.065        .     0.26    51.18        .
  - exhaustiveness         9.230        1    9.230    9.230    9.230    9.230        .    37.36  7267.72        .
    - is_useful() 2        9.223        1    9.223    9.223    9.223    9.223        .    37.33  7262.20        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.79        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              8.256        1    8.256    8.256    8.256    8.256        .    33.42  6500.79        .
  + Difference()           5.835        1    5.835    5.835    5.835    5.835        .    23.62  4594.49        .
  + Compress()             3.818        1    3.818    3.818    3.818    3.818        .    15.45  3006.30        .
  eval                     0.102        1    0.102    0.102    0.102    0.102        .     0.41    80.31        .
  total                   24.707        1   24.707   24.707   24.707   24.707        .   100.00 19454.33   24.580
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.075        1    0.075    0.075    0.075    0.075        .     0.29     6.94        .
  base                     1.080        1    1.080    1.080    1.080    1.080        .     4.15   100.00        .
  init                     0.069        1    0.069    0.069    0.069    0.069        .     0.27     6.39        .
  parse                    0.069        1    0.069    0.069    0.069    0.069        .     0.27     6.39        .
  check                   24.813        1   24.813   24.813   24.813   24.813        .    95.39  2297.50        .
  - usefulness            14.952        1   14.952   14.952   14.952   14.952        .    57.48  1384.44        .
    - is_useful() 1       14.840        1   14.840   14.840   14.840   14.840        .    57.05  1374.07        .
  - combine                0.052        1    0.052    0.052    0.052    0.052        .     0.20     4.81        .
  - exhaustiveness         9.805        1    9.805    9.805    9.805    9.805        .    37.69   907.87        .
    - is_useful() 2        9.800        1    9.800    9.800    9.800    9.800        .    37.67   907.41        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.09        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.09        .
  + Overlap()              8.433        1    8.433    8.433    8.433    8.433        .    32.42   780.83        .
  + Difference()           6.066        1    6.066    6.066    6.066    6.066        .    23.32   561.67        .
  + Compress()             3.615        1    3.615    3.615    3.615    3.615        .    13.90   334.72        .
  eval                     1.062        1    1.062    1.062    1.062    1.062        .     4.08    98.33        .
  total                   26.013        1   26.013   26.013   26.013   26.013        .   100.00  2408.61   24.933
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.823        1    0.823    0.823    0.823    0.823        .     2.14     6.66        .
  base                    12.353        1   12.353   12.353   12.353   12.353        .    32.18   100.00        .
  init                     0.579        1    0.579    0.579    0.579    0.579        .     1.51     4.69        .
  parse                    0.086        1    0.086    0.086    0.086    0.086        .     0.22     0.70        .
  check                   26.047        1   26.047   26.047   26.047   26.047        .    67.86   210.86        .
  - usefulness            16.278        1   16.278   16.278   16.278   16.278        .    42.41   131.77        .
    - is_useful() 1       16.168        1   16.168   16.168   16.168   16.168        .    42.12   130.88        .
  - combine                0.056        1    0.056    0.056    0.056    0.056        .     0.15     0.45        .
  - exhaustiveness         9.710        1    9.710    9.710    9.710    9.710        .    25.30    78.60        .
    - is_useful() 2        9.703        1    9.703    9.703    9.703    9.703        .    25.28    78.55        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()              8.805        1    8.805    8.805    8.805    8.805        .    22.94    71.28        .
  + Difference()           6.450        1    6.450    6.450    6.450    6.450        .    16.80    52.21        .
  + Compress()             3.742        1    3.742    3.742    3.742    3.742        .     9.75    30.29        .
  eval                    11.670        1   11.670   11.670   11.670   11.670        .    30.40    94.47        .
  total                   38.383        1   38.383   38.383   38.383   38.383        .   100.00   310.72   26.030
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_string,  obs(10000000) levels(1000) rep(1)
. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.616     1000    0.000    0.002    0.002    0.008    0.001   120.69   380.24        .
  base                     0.425     1000    0.000    0.000    0.000    0.003    0.001    31.74   100.00        .
  init                     0.096     1000    0.000    0.000    0.000    0.001    0.000     7.17    22.59        .
  parse                    0.787     1000    0.000    0.001    0.001    0.010    0.001    58.78   185.18        .
  check                    0.004     1000    0.000    0.000    0.000    0.001    0.000     0.30     0.94        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.416     1000    0.000    0.000    0.000    0.004    0.001    31.07    97.88        .
  total                    1.339     1000    0.001    0.001    0.001    0.011    0.001   100.00   315.06    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.670     1000    0.001    0.004    0.004    0.010    0.001    94.83   115.37        .
  base                     3.181     1000    0.002    0.003    0.003    0.010    0.001    82.20   100.00        .
  init                     0.093     1000    0.000    0.000    0.000    0.001    0.000     2.40     2.92        .
  parse                    0.743     1000    0.000    0.001    0.001    0.002    0.000    19.20    23.36        .
  check                    0.005     1000    0.000    0.000    0.000    0.001    0.000     0.13     0.16        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.995     1000    0.002    0.003    0.003    0.011    0.001    77.39    94.15        .
  total                    3.870     1000    0.003    0.004    0.004    0.012    0.001   100.00   121.66    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.656      100    0.013    0.017    0.016    0.025    0.002    51.03    52.21        .
  base                     3.172      100    0.025    0.032    0.031    0.058    0.006    97.75   100.00        .
  init                     0.014      100    0.000    0.000    0.000    0.002    0.000     0.43     0.44        .
  parse                    0.080      100    0.000    0.001    0.001    0.002    0.000     2.47     2.52        .
  check                    0.001      100    0.000    0.000    0.000    0.001    0.000     0.03     0.03        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.146      100    0.025    0.031    0.031    0.047    0.005    96.95    99.18        .
  total                    3.245      100    0.026    0.032    0.032    0.049    0.005   100.00   102.30    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.108       10    0.198    0.211    0.204    0.235    0.012    72.07    70.45        .
  base                     2.992       10    0.261    0.299    0.286    0.341    0.027   102.29   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.03        .
  parse                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.27     0.27        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.916       10    0.260    0.292    0.286    0.324    0.020    99.69    97.46        .
  total                    2.925       10    0.261    0.292    0.287    0.325    0.020   100.00    97.76   -0.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.641        1    3.641    3.641    3.641    3.641        .   114.25   116.85        .
  base                     3.116        1    3.116    3.116    3.116    3.116        .    97.77   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.03        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.185        1    3.185    3.185    3.185    3.185        .    99.94   102.21        .
  total                    3.187        1    3.187    3.187    3.187    3.187        .   100.00   102.28    0.071
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.571     1000    0.000    0.002    0.002    0.014    0.001   116.98   364.50        .
  base                     0.431     1000    0.000    0.000    0.000    0.004    0.001    32.09   100.00        .
  init                     0.135     1000    0.000    0.000    0.000    0.046    0.001    10.05    31.32        .
  parse                    0.745     1000    0.000    0.001    0.001    0.005    0.001    55.47   172.85        .
  check                    0.004     1000    0.000    0.000    0.000    0.001    0.000     0.30     0.93        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.424     1000    0.000    0.000    0.000    0.002    0.000    31.57    98.38        .
  total                    1.343     1000    0.001    0.001    0.001    0.047    0.002   100.00   311.60    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.637     1000    0.002    0.004    0.004    0.018    0.001    83.00   104.00        .
  base                     3.497     1000    0.002    0.003    0.003    0.009    0.001    79.80   100.00        .
  init                     0.092     1000    0.000    0.000    0.000    0.001    0.000     2.10     2.63        .
  parse                    0.777     1000    0.000    0.001    0.001    0.004    0.000    17.73    22.22        .
  check                    0.003     1000    0.000    0.000    0.000    0.001    0.000     0.07     0.09        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.485     1000    0.002    0.003    0.003    0.008    0.001    79.53    99.66        .
  total                    4.382     1000    0.003    0.004    0.004    0.009    0.001   100.00   125.31    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.167      100    0.018    0.022    0.021    0.059    0.004    29.63    29.68        .
  base                     7.302      100    0.062    0.073    0.069    0.273    0.022    99.85   100.00        .
  init                     0.011      100    0.000    0.000    0.000    0.001    0.000     0.15     0.15        .
  parse                    0.070      100    0.000    0.001    0.001    0.002    0.001     0.96     0.96        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     7.229      100    0.063    0.072    0.070    0.123    0.010    98.85    99.00        .
  total                    7.313      100    0.064    0.073    0.071    0.124    0.010   100.00   100.15    0.000
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.268       10    0.203    0.227    0.213    0.269    0.022    67.62    71.61        .
  base                     3.167       10    0.280    0.317    0.313    0.349    0.024    94.42   100.00        .
  init                     0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  parse                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.24     0.25        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.345       10    0.285    0.335    0.318    0.551    0.078    99.73   105.62        .
  total                    3.354       10    0.286    0.335    0.319    0.552    0.078   100.00   105.90    0.019
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.745        1    3.745    3.745    3.745    3.745        .   116.92   116.74        .
  base                     3.208        1    3.208    3.208    3.208    3.208        .   100.16   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.03        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.202        1    3.202    3.202    3.202    3.202        .    99.97    99.81        .
  total                    3.203        1    3.203    3.203    3.203    3.203        .   100.00    99.84   -0.005
-------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.283     1000    0.001    0.002    0.002    0.029    0.001   192.01   830.18        .
  base                     0.275     1000    0.000    0.000    0.000    0.004    0.000    23.13   100.00        .
  init                     0.102     1000    0.000    0.000    0.000    0.001    0.000     8.58    37.09        .
  parse                    0.798     1000    0.000    0.001    0.001    0.004    0.001    67.12   290.18        .
  check                    0.005     1000    0.000    0.000    0.000    0.001    0.000     0.42     1.82        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.253     1000    0.000    0.000    0.000    0.001    0.000    21.28    92.00        .
  total                    1.189     1000    0.000    0.001    0.001    0.005    0.000   100.00   432.36    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               9.704     1000    0.007    0.010    0.009    0.217    0.009   353.26   498.66        .
  base                     1.946     1000    0.001    0.002    0.002    0.010    0.001    70.84   100.00        .
  init                     0.102     1000    0.000    0.000    0.000    0.001    0.000     3.71     5.24        .
  parse                    0.816     1000    0.000    0.001    0.001    0.006    0.001    29.71    41.93        .
  check                    0.007     1000    0.000    0.000    0.000    0.001    0.000     0.25     0.36        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.784     1000    0.001    0.002    0.002    0.006    0.001    64.94    91.68        .
  total                    2.747     1000    0.002    0.003    0.003    0.010    0.001   100.00   141.16    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.181      100    0.066    0.072    0.070    0.092    0.006   416.29   415.57        .
  base                     1.728      100    0.015    0.017    0.016    0.025    0.002   100.17   100.00        .
  init                     0.016      100    0.000    0.000    0.000    0.001    0.000     0.93     0.93        .
  parse                    0.071      100    0.000    0.001    0.001    0.002    0.000     4.12     4.11        .
  check                    0.001      100    0.000    0.000    0.000    0.001    0.000     0.06     0.06        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.635      100    0.014    0.016    0.016    0.028    0.002    94.78    94.62        .
  total                    1.725      100    0.015    0.017    0.016    0.030    0.002   100.00    99.83   -0.000
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.929       10    0.758    0.793    0.789    0.823    0.022   486.74   446.96        .
  base                     1.774       10    0.161    0.177    0.171    0.209    0.017   108.90   100.00        .
  init                     0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  parse                    0.006       10    0.000    0.001    0.001    0.001    0.001     0.37     0.34        .
  check                    0.001       10    0.000    0.000    0.000    0.001    0.000     0.06     0.06        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.621       10    0.154    0.162    0.163    0.171    0.006    99.51    91.38        .
  total                    1.629       10    0.154    0.163    0.164    0.172    0.007   100.00    91.83   -0.015
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               9.329        1    9.329    9.329    9.329    9.329        .   571.63   574.09        .
  base                     1.625        1    1.625    1.625    1.625    1.625        .    99.57   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.06        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.631        1    1.631    1.631    1.631    1.631        .    99.94   100.37        .
  total                    1.632        1    1.632    1.632    1.632    1.632        .   100.00   100.43    0.007
-------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:   4 Oct 2024, 12:10:06
----------------------------------------------------------------------------------------------------------------------------------
