-----------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:   6 Oct 2024, 13:43:26

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.800     1000    0.000    0.001    0.001    0.004    0.000    17.57   272.11        .
  base                     0.294     1000    0.000    0.000    0.000    0.001    0.000     6.46   100.00        .
  init                     0.546     1000    0.000    0.001    0.001    0.004    0.001    11.99   185.71        .
  parse                    0.692     1000    0.000    0.001    0.001    0.002    0.000    15.20   235.37        .
  check                    2.925     1000    0.002    0.003    0.003    0.007    0.000    64.26   994.90        .
  - usefulness             1.312     1000    0.001    0.001    0.001    0.003    0.000    28.82   446.26        .
    - is_useful() 1        1.201     1000    0.000    0.001    0.001    0.002    0.001    26.38   408.50        .
  - combine                0.052     1000    0.000    0.000    0.000    0.001    0.000     1.14    17.69        .
  - exhaustiveness         1.490     1000    0.001    0.001    0.001    0.004    0.001    32.73   506.80        .
    - is_useful() 2        1.439     1000    0.001    0.001    0.001    0.003    0.001    31.61   489.46        .
  - compress               0.012     1000    0.000    0.000    0.000    0.001    0.000     0.26     4.08        .
  - print                  0.019     1000    0.000    0.000    0.000    0.001    0.000     0.42     6.46        .
  + Overlap()              1.254     1000    0.000    0.001    0.001    0.003    0.001    27.55   426.53        .
  + Difference()           0.772     1000    0.000    0.001    0.001    0.003    0.001    16.96   262.59        .
  + Compress()             0.123     1000    0.000    0.000    0.000    0.002    0.000     2.70    41.84        .
  eval                     0.362     1000    0.000    0.000    0.000    0.005    0.001     7.95   123.13        .
  total                    4.552     1000    0.004    0.005    0.005    0.009    0.001   100.00  1548.30    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.215     1000    0.002    0.002    0.002    0.003    0.000    30.50    82.16        .
  base                     2.696     1000    0.002    0.003    0.003    0.006    0.001    37.12   100.00        .
  init                     0.851     1000    0.000    0.001    0.001    0.002    0.000    11.72    31.57        .
  parse                    0.717     1000    0.000    0.001    0.001    0.002    0.000     9.87    26.59        .
  check                    2.895     1000    0.002    0.003    0.003    0.005    0.000    39.86   107.38        .
  - usefulness             1.290     1000    0.001    0.001    0.001    0.002    0.000    17.76    47.85        .
    - is_useful() 1        1.212     1000    0.000    0.001    0.001    0.002    0.000    16.69    44.96        .
  - combine                0.049     1000    0.000    0.000    0.000    0.001    0.000     0.67     1.82        .
  - exhaustiveness         1.472     1000    0.001    0.001    0.001    0.003    0.001    20.27    54.60        .
    - is_useful() 2        1.400     1000    0.001    0.001    0.001    0.003    0.000    19.28    51.93        .
  - compress               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.08     0.22        .
  - print                  0.027     1000    0.000    0.000    0.000    0.001    0.000     0.37     1.00        .
  + Overlap()              1.285     1000    0.000    0.001    0.001    0.003    0.001    17.69    47.66        .
  + Difference()           0.758     1000    0.000    0.001    0.001    0.002    0.001    10.44    28.12        .
  + Compress()             0.112     1000    0.000    0.000    0.000    0.001    0.000     1.54     4.15        .
  eval                     2.772     1000    0.002    0.003    0.003    0.005    0.000    38.17   102.82        .
  total                    7.263     1000    0.007    0.007    0.007    0.012    0.000   100.00   269.40    0.005
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.447      100    0.013    0.014    0.014    0.029    0.002    37.44    49.25        .
  base                     2.938      100    0.028    0.029    0.029    0.040    0.001    76.02   100.00        .
  init                     0.540      100    0.005    0.005    0.005    0.007    0.001    13.97    18.38        .
  parse                    0.069      100    0.000    0.001    0.001    0.001    0.000     1.79     2.35        .
  check                    0.296      100    0.002    0.003    0.003    0.004    0.000     7.66    10.07        .
  - usefulness             0.136      100    0.001    0.001    0.001    0.002    0.000     3.52     4.63        .
    - is_useful() 1        0.123      100    0.000    0.001    0.001    0.002    0.000     3.18     4.19        .
  - combine                0.004      100    0.000    0.000    0.000    0.001    0.000     0.10     0.14        .
  - exhaustiveness         0.148      100    0.001    0.001    0.001    0.003    0.001     3.83     5.04        .
    - is_useful() 2        0.142      100    0.001    0.001    0.001    0.003    0.001     3.67     4.83        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.05     0.07        .
  - print                  0.002      100    0.000    0.000    0.000    0.001    0.000     0.05     0.07        .
  + Overlap()              0.122      100    0.000    0.001    0.001    0.003    0.001     3.16     4.15        .
  + Difference()           0.085      100    0.000    0.001    0.001    0.003    0.001     2.20     2.89        .
  + Compress()             0.006      100    0.000    0.000    0.000    0.001    0.000     0.16     0.20        .
  eval                     2.957      100    0.028    0.030    0.029    0.034    0.001    76.51   100.65        .
  total                    3.865      100    0.037    0.039    0.038    0.043    0.001   100.00   131.55    0.009
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.813       10    0.167    0.181    0.182    0.191    0.008    62.35    74.67        .
  base                     2.428       10    0.240    0.243    0.242    0.249    0.003    83.49   100.00        .
  init                     0.441       10    0.044    0.044    0.044    0.045    0.000    15.17    18.16        .
  parse                    0.007       10    0.000    0.001    0.001    0.001    0.000     0.24     0.29        .
  check                    0.030       10    0.003    0.003    0.003    0.003    0.000     1.03     1.24        .
  - usefulness             0.014       10    0.001    0.001    0.001    0.002    0.001     0.48     0.58        .
    - is_useful() 1        0.013       10    0.001    0.001    0.001    0.002    0.000     0.45     0.54        .
  - combine                0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.04        .
  - exhaustiveness         0.014       10    0.001    0.001    0.001    0.002    0.001     0.48     0.58        .
    - is_useful() 2        0.013       10    0.001    0.001    0.001    0.002    0.000     0.45     0.54        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.013       10    0.000    0.001    0.001    0.002    0.001     0.45     0.54        .
  + Difference()           0.008       10    0.000    0.001    0.001    0.002    0.001     0.28     0.33        .
  + Compress()             0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.04        .
  eval                     2.429       10    0.241    0.243    0.242    0.248    0.002    83.53   100.04        .
  total                    2.908       10    0.289    0.291    0.290    0.296    0.002   100.00   119.77    0.048
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.004        1    3.004    3.004    3.004    3.004        .   104.02   125.06        .
  base                     2.402        1    2.402    2.402    2.402    2.402        .    83.17   100.00        .
  init                     0.434        1    0.434    0.434    0.434    0.434        .    15.03    18.07        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  check                    0.003        1    0.003    0.003    0.003    0.003        .     0.10     0.12        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
    - is_useful() 1        0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
    - is_useful() 2        0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()             0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     2.450        1    2.450    2.450    2.450    2.450        .    84.83   102.00        .
  total                    2.888        1    2.888    2.888    2.888    2.888        .   100.00   120.23    0.486
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.732     1000    0.000    0.001    0.001    0.002    0.000    15.35   239.22        .
  base                     0.306     1000    0.000    0.000    0.000    0.001    0.000     6.42   100.00        .
  init                     0.779     1000    0.000    0.001    0.001    0.002    0.000    16.33   254.58        .
  parse                    0.690     1000    0.000    0.001    0.001    0.001    0.000    14.47   225.49        .
  check                    2.918     1000    0.002    0.003    0.003    0.006    0.000    61.17   953.59        .
  - usefulness             1.285     1000    0.001    0.001    0.001    0.003    0.000    26.94   419.93        .
    - is_useful() 1        1.180     1000    0.000    0.001    0.001    0.003    0.000    24.74   385.62        .
  - combine                0.062     1000    0.000    0.000    0.000    0.001    0.000     1.30    20.26        .
  - exhaustiveness         1.499     1000    0.001    0.001    0.001    0.003    0.001    31.43   489.87        .
    - is_useful() 2        1.436     1000    0.001    0.001    0.001    0.003    0.001    30.10   469.28        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.10     1.63        .
  - print                  0.014     1000    0.000    0.000    0.000    0.001    0.000     0.29     4.58        .
  + Overlap()              1.283     1000    0.000    0.001    0.001    0.003    0.001    26.90   419.28        .
  + Difference()           0.768     1000    0.000    0.001    0.001    0.002    0.001    16.10   250.98        .
  + Compress()             0.113     1000    0.000    0.000    0.000    0.002    0.000     2.37    36.93        .
  eval                     0.349     1000    0.000    0.000    0.000    0.002    0.000     7.32   114.05        .
  total                    4.770     1000    0.004    0.005    0.005    0.008    0.001   100.00  1558.82    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.375     1000    0.001    0.002    0.002    0.005    0.001    15.31    51.91        .
  base                     4.575     1000    0.002    0.005    0.004    0.010    0.001    29.49   100.00        .
  init                     5.228     1000    0.003    0.005    0.005    0.021    0.002    33.70   114.27        .
  parse                    1.136     1000    0.000    0.001    0.001    0.003    0.000     7.32    24.83        .
  check                    4.137     1000    0.002    0.004    0.004    0.008    0.001    26.67    90.43        .
  - usefulness             1.832     1000    0.001    0.002    0.002    0.005    0.001    11.81    40.04        .
    - is_useful() 1        1.689     1000    0.000    0.002    0.002    0.005    0.001    10.89    36.92        .
  - combine                0.076     1000    0.000    0.000    0.000    0.001    0.000     0.49     1.66        .
  - exhaustiveness         2.127     1000    0.001    0.002    0.002    0.005    0.001    13.71    46.49        .
    - is_useful() 2        2.024     1000    0.001    0.002    0.002    0.005    0.001    13.05    44.24        .
  - compress               0.004     1000    0.000    0.000    0.000    0.001    0.000     0.03     0.09        .
  - print                  0.032     1000    0.000    0.000    0.000    0.001    0.000     0.21     0.70        .
  + Overlap()              1.883     1000    0.000    0.002    0.002    0.005    0.001    12.14    41.16        .
  + Difference()           1.052     1000    0.000    0.001    0.001    0.003    0.001     6.78    22.99        .
  + Compress()             0.166     1000    0.000    0.000    0.000    0.002    0.000     1.07     3.63        .
  eval                     4.963     1000    0.002    0.005    0.005    0.014    0.002    31.99   108.48        .
  total                   15.513     1000    0.010    0.016    0.015    0.039    0.004   100.00   339.08    0.011
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.132      100    0.017    0.021    0.021    0.029    0.002    13.80    30.87        .
  base                     6.906      100    0.060    0.069    0.069    0.094    0.006    44.69   100.00        .
  init                     7.924      100    0.063    0.079    0.076    0.127    0.012    51.27   114.74        .
  parse                    0.093      100    0.000    0.001    0.001    0.002    0.001     0.60     1.35        .
  check                    0.372      100    0.002    0.004    0.003    0.009    0.001     2.41     5.39        .
  - usefulness             0.160      100    0.001    0.002    0.001    0.004    0.001     1.04     2.32        .
    - is_useful() 1        0.148      100    0.000    0.001    0.001    0.004    0.001     0.96     2.14        .
  - combine                0.010      100    0.000    0.000    0.000    0.001    0.000     0.06     0.14        .
  - exhaustiveness         0.194      100    0.001    0.002    0.002    0.005    0.001     1.26     2.81        .
    - is_useful() 2        0.183      100    0.001    0.002    0.002    0.005    0.001     1.18     2.65        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.01        .
  + Overlap()              0.159      100    0.000    0.002    0.002    0.005    0.001     1.03     2.30        .
  + Difference()           0.101      100    0.000    0.001    0.001    0.003    0.001     0.65     1.46        .
  + Compress()             0.008      100    0.000    0.000    0.000    0.001    0.000     0.05     0.12        .
  eval                     7.061      100    0.062    0.071    0.069    0.120    0.007    45.69   102.24        .
  total                   15.454      100    0.134    0.155    0.151    0.208    0.015   100.00   223.78    0.085
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.116       10    0.196    0.212    0.201    0.252    0.018    32.35    76.33        .
  base                     2.772       10    0.259    0.277    0.271    0.327    0.021    42.39   100.00        .
  init                     3.817       10    0.364    0.382    0.374    0.413    0.017    58.36   137.70        .
  parse                    0.011       10    0.001    0.001    0.001    0.002    0.000     0.17     0.40        .
  check                    0.034       10    0.003    0.003    0.003    0.005    0.001     0.52     1.23        .
  - usefulness             0.014       10    0.001    0.001    0.001    0.003    0.001     0.21     0.51        .
    - is_useful() 1        0.012       10    0.000    0.001    0.001    0.002    0.001     0.18     0.43        .
  - combine                0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.04        .
  - exhaustiveness         0.019       10    0.001    0.002    0.002    0.003    0.001     0.29     0.69        .
    - is_useful() 2        0.019       10    0.001    0.002    0.002    0.003    0.001     0.29     0.69        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.016       10    0.000    0.002    0.002    0.002    0.001     0.24     0.58        .
  + Difference()           0.006       10    0.000    0.001    0.000    0.002    0.001     0.09     0.22        .
  + Compress()             0.004       10    0.000    0.000    0.000    0.001    0.001     0.06     0.14        .
  eval                     2.678       10    0.255    0.268    0.262    0.281    0.010    40.95    96.61        .
  total                    6.540       10    0.629    0.654    0.652    0.691    0.018   100.00   235.93    0.377
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.186        1    3.186    3.186    3.186    3.186        .    48.98   121.56        .
  base                     2.621        1    2.621    2.621    2.621    2.621        .    40.29   100.00        .
  init                     3.815        1    3.815    3.815    3.815    3.815        .    58.65   145.56        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  check                    0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.08        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
    - is_useful() 1        0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
    - is_useful() 2        0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  + Difference()           0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  + Compress()             0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     2.687        1    2.687    2.687    2.687    2.687        .    41.31   102.52        .
  total                    6.505        1    6.505    6.505    6.505    6.505        .   100.00   248.19    3.884
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.449     1000    0.001    0.001    0.001    0.003    0.001    48.03   717.33        .
  base                     0.202     1000    0.000    0.000    0.000    0.001    0.000     6.70   100.00        .
  init                     0.548     1000    0.000    0.001    0.001    0.002    0.000    18.16   271.29        .
  parse                    0.473     1000    0.000    0.000    0.000    0.002    0.001    15.68   234.16        .
  check                    1.754     1000    0.001    0.002    0.002    0.004    0.001    58.14   868.32        .
  - usefulness             0.455     1000    0.000    0.000    0.000    0.002    0.001    15.08   225.25        .
    - is_useful() 1        0.414     1000    0.000    0.000    0.000    0.002    0.000    13.72   204.95        .
  - combine                0.022     1000    0.000    0.000    0.000    0.001    0.000     0.73    10.89        .
  - exhaustiveness         1.224     1000    0.001    0.001    0.001    0.003    0.000    40.57   605.94        .
    - is_useful() 2        1.145     1000    0.001    0.001    0.001    0.003    0.000    37.95   566.83        .
  - compress               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.20     2.97        .
  - print                  0.017     1000    0.000    0.000    0.000    0.001    0.000     0.56     8.42        .
  + Overlap()              0.691     1000    0.000    0.001    0.001    0.003    0.001    22.90   342.08        .
  + Difference()           0.680     1000    0.000    0.001    0.001    0.003    0.001    22.54   336.63        .
  + Compress()             0.021     1000    0.000    0.000    0.000    0.001    0.000     0.70    10.40        .
  eval                     0.219     1000    0.000    0.000    0.000    0.001    0.000     7.26   108.42        .
  total                    3.017     1000    0.002    0.003    0.003    0.005    0.001   100.00  1493.56    0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.681     1000    0.006    0.008    0.007    0.014    0.001    86.19   461.88        .
  base                     1.663     1000    0.001    0.002    0.002    0.004    0.001    18.66   100.00        .
  init                     4.911     1000    0.004    0.005    0.005    0.023    0.001    55.11   295.31        .
  parse                    0.515     1000    0.000    0.001    0.001    0.007    0.001     5.78    30.97        .
  check                    1.762     1000    0.001    0.002    0.002    0.004    0.001    19.77   105.95        .
  - usefulness             0.469     1000    0.000    0.000    0.000    0.002    0.001     5.26    28.20        .
    - is_useful() 1        0.430     1000    0.000    0.000    0.000    0.002    0.000     4.82    25.86        .
  - combine                0.022     1000    0.000    0.000    0.000    0.001    0.000     0.25     1.32        .
  - exhaustiveness         1.192     1000    0.001    0.001    0.001    0.003    0.000    13.38    71.68        .
    - is_useful() 2        1.128     1000    0.001    0.001    0.001    0.003    0.000    12.66    67.83        .
  - compress               0.007     1000    0.000    0.000    0.000    0.001    0.000     0.08     0.42        .
  - print                  0.018     1000    0.000    0.000    0.000    0.001    0.000     0.20     1.08        .
  + Overlap()              0.718     1000    0.000    0.001    0.001    0.003    0.001     8.06    43.17        .
  + Difference()           0.647     1000    0.000    0.001    0.001    0.003    0.001     7.26    38.91        .
  + Compress()             0.022     1000    0.000    0.000    0.000    0.001    0.000     0.25     1.32        .
  eval                     1.697     1000    0.001    0.002    0.002    0.004    0.001    19.04   102.04        .
  total                    8.912     1000    0.008    0.009    0.009    0.038    0.001   100.00   535.90    0.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.978      100    0.063    0.070    0.068    0.101    0.008    88.40   420.11        .
  base                     1.661      100    0.015    0.017    0.016    0.031    0.003    21.04   100.00        .
  init                     6.026      100    0.054    0.060    0.057    0.104    0.007    76.34   362.79        .
  parse                    0.041      100    0.000    0.000    0.000    0.001    0.000     0.52     2.47        .
  check                    0.176      100    0.001    0.002    0.002    0.003    0.001     2.23    10.60        .
  - usefulness             0.055      100    0.000    0.001    0.001    0.001    0.000     0.70     3.31        .
    - is_useful() 1        0.047      100    0.000    0.000    0.000    0.001    0.001     0.60     2.83        .
  - combine                0.002      100    0.000    0.000    0.000    0.001    0.000     0.03     0.12        .
  - exhaustiveness         0.110      100    0.001    0.001    0.001    0.002    0.000     1.39     6.62        .
    - is_useful() 2        0.104      100    0.001    0.001    0.001    0.002    0.000     1.32     6.26        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.06        .
  - print                  0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.06        .
  + Overlap()              0.070      100    0.000    0.001    0.001    0.002    0.001     0.89     4.21        .
  + Difference()           0.070      100    0.000    0.001    0.001    0.002    0.001     0.89     4.21        .
  + Compress()             0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     1.645      100    0.015    0.016    0.016    0.026    0.002    20.84    99.04        .
  total                    7.894      100    0.071    0.079    0.076    0.123    0.009   100.00   475.26    0.062
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.475       10    0.804    0.847    0.850    0.895    0.032   117.89   495.32        .
  base                     1.711       10    0.158    0.171    0.172    0.178    0.006    23.80   100.00        .
  init                     5.283       10    0.491    0.528    0.520    0.569    0.025    73.49   308.77        .
  parse                    0.005       10    0.000    0.001    0.000    0.001    0.001     0.07     0.29        .
  check                    0.018       10    0.001    0.002    0.002    0.002    0.000     0.25     1.05        .
  - usefulness             0.007       10    0.000    0.001    0.001    0.001    0.000     0.10     0.41        .
    - is_useful() 1        0.007       10    0.000    0.001    0.001    0.001    0.000     0.10     0.41        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.011       10    0.001    0.001    0.001    0.002    0.000     0.15     0.64        .
    - is_useful() 2        0.011       10    0.001    0.001    0.001    0.002    0.000     0.15     0.64        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.009       10    0.000    0.001    0.001    0.002    0.001     0.13     0.53        .
  + Difference()           0.005       10    0.000    0.001    0.000    0.001    0.001     0.07     0.29        .
  + Compress()             0.001       10    0.000    0.000    0.000    0.001    0.000     0.01     0.06        .
  eval                     1.883       10    0.175    0.188    0.182    0.225    0.014    26.19   110.05        .
  total                    7.189       10    0.683    0.719    0.712    0.754    0.020   100.00   420.16    0.548
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               9.726        1    9.726    9.726    9.726    9.726        .   137.80   549.80        .
  base                     1.769        1    1.769    1.769    1.769    1.769        .    25.06   100.00        .
  init                     5.236        1    5.236    5.236    5.236    5.236        .    74.19   295.99        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.06        .
  check                    0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.06        .
  - usefulness             0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
    - is_useful() 1        0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.06        .
    - is_useful() 2        0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.06        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Difference()           0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.06        .
  + Compress()             0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.820        1    1.820    1.820    1.820    1.820        .    25.79   102.88        .
  total                    7.058        1    7.058    7.058    7.058    7.058        .   100.00   398.98    5.289
-------------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.085      100    0.000    0.001    0.001    0.002    0.000     0.58    66.93        .
  base                     0.127      100    0.001    0.001    0.001    0.003    0.000     0.87   100.00        .
  init                     0.067      100    0.000    0.001    0.001    0.001    0.000     0.46    52.76        .
  parse                    0.368      100    0.003    0.004    0.003    0.006    0.001     2.53   289.76        .
  check                   13.959      100    0.128    0.140    0.133    0.190    0.013    95.90 10991.34        .
  - usefulness             6.072      100    0.056    0.061    0.058    0.087    0.006    41.71  4781.10        .
    - is_useful() 1        5.931      100    0.052    0.059    0.057    0.084    0.005    40.75  4670.08        .
  - combine                0.092      100    0.000    0.001    0.001    0.002    0.000     0.63    72.44        .
  - exhaustiveness         7.764      100    0.070    0.078    0.073    0.100    0.009    53.34  6113.39        .
    - is_useful() 2        7.703      100    0.070    0.077    0.072    0.099    0.009    52.92  6065.35        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.01     1.57        .
  - print                  0.012      100    0.000    0.000    0.000    0.001    0.000     0.08     9.45        .
  + Overlap()              5.894      100    0.046    0.059    0.057    0.080    0.007    40.49  4640.94        .
  + Difference()           5.341      100    0.045    0.053    0.052    0.078    0.006    36.69  4205.51        .
  + Compress()             0.658      100    0.002    0.007    0.007    0.012    0.002     4.52   518.11        .
  eval                     0.159      100    0.001    0.002    0.002    0.003    0.001     1.09   125.20        .
  total                   14.556      100    0.134    0.146    0.138    0.199    0.014   100.00 11461.42    0.144
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.206      100    0.001    0.002    0.002    0.003    0.001     1.41    19.56        .
  base                     1.053      100    0.010    0.011    0.010    0.015    0.001     7.20   100.00        .
  init                     0.172      100    0.001    0.002    0.002    0.003    0.000     1.18    16.33        .
  parse                    0.322      100    0.003    0.003    0.003    0.005    0.000     2.20    30.58        .
  check                   13.042      100    0.128    0.130    0.130    0.137    0.002    89.19  1238.56        .
  - usefulness             5.746      100    0.056    0.057    0.057    0.064    0.001    39.29   545.68        .
    - is_useful() 1        5.619      100    0.053    0.056    0.056    0.064    0.002    38.43   533.62        .
  - combine                0.084      100    0.000    0.001    0.001    0.002    0.000     0.57     7.98        .
  - exhaustiveness         7.191      100    0.071    0.072    0.072    0.077    0.001    49.18   682.91        .
    - is_useful() 2        7.148      100    0.070    0.071    0.071    0.077    0.001    48.88   678.82        .
  - compress               0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     0.28        .
  - print                  0.007      100    0.000    0.000    0.000    0.001    0.000     0.05     0.66        .
  + Overlap()              5.593      100    0.046    0.056    0.056    0.067    0.003    38.25   531.15        .
  + Difference()           4.929      100    0.043    0.049    0.049    0.057    0.003    33.71   468.09        .
  + Compress()             0.643      100    0.002    0.006    0.006    0.011    0.002     4.40    61.06        .
  eval                     1.085      100    0.010    0.011    0.011    0.013    0.001     7.42   103.04        .
  total                   14.623      100    0.144    0.146    0.146    0.153    0.002   100.00  1388.70    0.136
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.114       10    0.010    0.011    0.011    0.012    0.001     4.54    10.86        .
  base                     1.050       10    0.102    0.105    0.104    0.112    0.003    41.80   100.00        .
  init                     0.125       10    0.012    0.013    0.012    0.013    0.001     4.98    11.90        .
  parse                    0.031       10    0.003    0.003    0.003    0.004    0.000     1.23     2.95        .
  check                    1.316       10    0.128    0.132    0.130    0.138    0.003    52.39   125.33        .
  - usefulness             0.587       10    0.056    0.059    0.057    0.064    0.003    23.37    55.90        .
    - is_useful() 1        0.570       10    0.053    0.057    0.056    0.063    0.003    22.69    54.29        .
  - combine                0.007       10    0.000    0.001    0.001    0.001    0.000     0.28     0.67        .
  - exhaustiveness         0.719       10    0.071    0.072    0.072    0.073    0.001    28.62    68.48        .
    - is_useful() 2        0.714       10    0.070    0.071    0.071    0.073    0.001    28.42    68.00        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.10        .
  + Overlap()              0.559       10    0.051    0.056    0.056    0.063    0.003    22.25    53.24        .
  + Difference()           0.500       10    0.047    0.050    0.049    0.055    0.002    19.90    47.62        .
  + Compress()             0.062       10    0.003    0.006    0.006    0.010    0.002     2.47     5.90        .
  eval                     1.040       10    0.102    0.104    0.103    0.107    0.002    41.40    99.05        .
  total                    2.512       10    0.247    0.251    0.251    0.257    0.003   100.00   239.24    0.146
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.180        1    0.180    0.180    0.180    0.180        .    14.08    17.53        .
  base                     1.027        1    1.027    1.027    1.027    1.027        .    80.36   100.00        .
  init                     0.119        1    0.119    0.119    0.119    0.119        .     9.31    11.59        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.23     0.29        .
  check                    0.129        1    0.129    0.129    0.129    0.129        .    10.09    12.56        .
  - usefulness             0.057        1    0.057    0.057    0.057    0.057        .     4.46     5.55        .
    - is_useful() 1        0.057        1    0.057    0.057    0.057    0.057        .     4.46     5.55        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.08     0.10        .
  - exhaustiveness         0.071        1    0.071    0.071    0.071    0.071        .     5.56     6.91        .
    - is_useful() 2        0.071        1    0.071    0.071    0.071    0.071        .     5.56     6.91        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.056        1    0.056    0.056    0.056    0.056        .     4.38     5.45        .
  + Difference()           0.050        1    0.050    0.050    0.050    0.050        .     3.91     4.87        .
  + Compress()             0.005        1    0.005    0.005    0.005    0.005        .     0.39     0.49        .
  eval                     1.027        1    1.027    1.027    1.027    1.027        .    80.36   100.00        .
  total                    1.278        1    1.278    1.278    1.278    1.278        .   100.00   124.44    0.251
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.004        1    3.004    3.004    3.004    3.004        .    25.82    29.28        .
  base                    10.261        1   10.261   10.261   10.261   10.261        .    88.18   100.00        .
  init                     1.214        1    1.214    1.214    1.214    1.214        .    10.43    11.83        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.03     0.04        .
  check                    0.133        1    0.133    0.133    0.133    0.133        .     1.14     1.30        .
  - usefulness             0.061        1    0.061    0.061    0.061    0.061        .     0.52     0.59        .
    - is_useful() 1        0.059        1    0.059    0.059    0.059    0.059        .     0.51     0.57        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.072        1    0.072    0.072    0.072    0.072        .     0.62     0.70        .
    - is_useful() 2        0.071        1    0.071    0.071    0.071    0.071        .     0.61     0.69        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.056        1    0.056    0.056    0.056    0.056        .     0.48     0.55        .
  + Difference()           0.052        1    0.052    0.052    0.052    0.052        .     0.45     0.51        .
  + Compress()             0.006        1    0.006    0.006    0.006    0.006        .     0.05     0.06        .
  eval                    10.285        1   10.285   10.285   10.285   10.285        .    88.39   100.23        .
  total                   11.636        1   11.636   11.636   11.636   11.636        .   100.00   113.40    1.375
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.079      100    0.000    0.001    0.001    0.003    0.000     0.57    63.71        .
  base                     0.124      100    0.001    0.001    0.001    0.002    0.000     0.89   100.00        .
  init                     0.083      100    0.000    0.001    0.001    0.002    0.000     0.60    66.94        .
  parse                    0.328      100    0.003    0.003    0.003    0.005    0.000     2.36   264.52        .
  check                   13.339      100    0.128    0.133    0.131    0.158    0.007    95.87 10757.26        .
  - usefulness             5.826      100    0.056    0.058    0.057    0.080    0.004    41.87  4698.39        .
    - is_useful() 1        5.682      100    0.053    0.057    0.056    0.078    0.004    40.84  4582.26        .
  - combine                0.087      100    0.000    0.001    0.001    0.002    0.000     0.63    70.16        .
  - exhaustiveness         7.399      100    0.070    0.074    0.072    0.095    0.004    53.18  5966.94        .
    - is_useful() 2        7.336      100    0.070    0.073    0.072    0.094    0.004    52.72  5916.13        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.81        .
  - print                  0.008      100    0.000    0.000    0.000    0.001    0.000     0.06     6.45        .
  + Overlap()              5.684      100    0.047    0.057    0.056    0.071    0.004    40.85  4583.87        .
  + Difference()           5.070      100    0.043    0.051    0.050    0.070    0.005    36.44  4088.71        .
  + Compress()             0.652      100    0.003    0.007    0.006    0.012    0.002     4.69   525.81        .
  eval                     0.162      100    0.001    0.002    0.002    0.003    0.001     1.16   130.65        .
  total                   13.914      100    0.134    0.139    0.136    0.165    0.007   100.00 11220.97    0.138
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.212      100    0.001    0.002    0.002    0.003    0.000     1.42    19.06        .
  base                     1.112      100    0.010    0.011    0.011    0.014    0.001     7.43   100.00        .
  init                     0.349      100    0.003    0.003    0.003    0.006    0.001     2.33    31.38        .
  parse                    0.323      100    0.003    0.003    0.003    0.004    0.000     2.16    29.05        .
  check                   13.058      100    0.128    0.131    0.130    0.140    0.002    87.26  1174.28        .
  - usefulness             5.756      100    0.056    0.058    0.057    0.064    0.002    38.46   517.63        .
    - is_useful() 1        5.629      100    0.053    0.056    0.056    0.064    0.002    37.61   506.21        .
  - combine                0.085      100    0.000    0.001    0.001    0.002    0.000     0.57     7.64        .
  - exhaustiveness         7.197      100    0.070    0.072    0.072    0.079    0.001    48.09   647.21        .
    - is_useful() 2        7.138      100    0.070    0.071    0.071    0.079    0.001    47.70   641.91        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.09        .
  - print                  0.009      100    0.000    0.000    0.000    0.001    0.000     0.06     0.81        .
  + Overlap()              5.489      100    0.047    0.055    0.055    0.064    0.004    36.68   493.62        .
  + Difference()           4.984      100    0.040    0.050    0.049    0.058    0.003    33.30   448.20        .
  + Compress()             0.620      100    0.002    0.006    0.006    0.011    0.002     4.14    55.76        .
  eval                     1.232      100    0.011    0.012    0.012    0.015    0.001     8.23   110.79        .
  total                   14.965      100    0.147    0.150    0.149    0.159    0.002   100.00  1345.77    0.139
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.167       10    0.016    0.017    0.016    0.018    0.001     3.60     6.29        .
  base                     2.657       10    0.262    0.266    0.265    0.274    0.004    57.23   100.00        .
  init                     0.578       10    0.054    0.058    0.057    0.066    0.004    12.45    21.75        .
  parse                    0.035       10    0.003    0.004    0.003    0.004    0.001     0.75     1.32        .
  check                    1.306       10    0.129    0.131    0.130    0.133    0.001    28.13    49.15        .
  - usefulness             0.573       10    0.056    0.057    0.057    0.060    0.001    12.34    21.57        .
    - is_useful() 1        0.565       10    0.054    0.057    0.056    0.059    0.002    12.17    21.26        .
  - combine                0.010       10    0.001    0.001    0.001    0.001    0.000     0.22     0.38        .
  - exhaustiveness         0.721       10    0.071    0.072    0.072    0.075    0.001    15.53    27.14        .
    - is_useful() 2        0.717       10    0.071    0.072    0.071    0.075    0.001    15.44    26.99        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.550       10    0.050    0.055    0.055    0.060    0.003    11.85    20.70        .
  + Difference()           0.483       10    0.046    0.048    0.048    0.051    0.002    10.40    18.18        .
  + Compress()             0.074       10    0.003    0.007    0.007    0.010    0.002     1.59     2.79        .
  eval                     2.723       10    0.269    0.272    0.270    0.281    0.004    58.65   102.48        .
  total                    4.643       10    0.458    0.464    0.462    0.474    0.005   100.00   174.75    0.199
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.188        1    0.188    0.188    0.188    0.188        .    12.56    17.82        .
  base                     1.055        1    1.055    1.055    1.055    1.055        .    70.47   100.00        .
  init                     0.318        1    0.318    0.318    0.318    0.318        .    21.24    30.14        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.20     0.28        .
  check                    0.131        1    0.131    0.131    0.131    0.131        .     8.75    12.42        .
  - usefulness             0.058        1    0.058    0.058    0.058    0.058        .     3.87     5.50        .
    - is_useful() 1        0.057        1    0.057    0.057    0.057    0.057        .     3.81     5.40        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.09        .
  - exhaustiveness         0.071        1    0.071    0.071    0.071    0.071        .     4.74     6.73        .
    - is_useful() 2        0.071        1    0.071    0.071    0.071    0.071        .     4.74     6.73        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.060        1    0.060    0.060    0.060    0.060        .     4.01     5.69        .
  + Difference()           0.046        1    0.046    0.046    0.046    0.046        .     3.07     4.36        .
  + Compress()             0.005        1    0.005    0.005    0.005    0.005        .     0.33     0.47        .
  eval                     1.045        1    1.045    1.045    1.045    1.045        .    69.81    99.05        .
  total                    1.497        1    1.497    1.497    1.497    1.497        .   100.00   141.90    0.442
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.019        1    3.019    3.019    3.019    3.019        .    22.14    29.04        .
  base                    10.395        1   10.395   10.395   10.395   10.395        .    76.24   100.00        .
  init                     3.154        1    3.154    3.154    3.154    3.154        .    23.13    30.34        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.03     0.04        .
  check                    0.129        1    0.129    0.129    0.129    0.129        .     0.95     1.24        .
  - usefulness             0.057        1    0.057    0.057    0.057    0.057        .     0.42     0.55        .
    - is_useful() 1        0.056        1    0.056    0.056    0.056    0.056        .     0.41     0.54        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.071        1    0.071    0.071    0.071    0.071        .     0.52     0.68        .
    - is_useful() 2        0.070        1    0.070    0.070    0.070    0.070        .     0.51     0.67        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.057        1    0.057    0.057    0.057    0.057        .     0.42     0.55        .
  + Difference()           0.050        1    0.050    0.050    0.050    0.050        .     0.37     0.48        .
  + Compress()             0.006        1    0.006    0.006    0.006    0.006        .     0.04     0.06        .
  eval                    10.348        1   10.348   10.348   10.348   10.348        .    75.89    99.55        .
  total                   13.635        1   13.635   13.635   13.635   13.635        .   100.00   131.17    3.240
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.130      100    0.001    0.001    0.001    0.003    0.000     1.12   116.07        .
  base                     0.112      100    0.001    0.001    0.001    0.002    0.000     0.96   100.00        .
  init                     0.057      100    0.000    0.001    0.001    0.001    0.000     0.49    50.89        .
  parse                    0.222      100    0.002    0.002    0.002    0.005    0.000     1.91   198.21        .
  check                   11.214      100    0.109    0.112    0.111    0.132    0.004    96.45 10012.50        .
  - usefulness             3.417      100    0.033    0.034    0.034    0.043    0.001    29.39  3050.89        .
    - is_useful() 1        3.355      100    0.030    0.034    0.033    0.043    0.001    28.86  2995.54        .
  - combine                0.034      100    0.000    0.000    0.000    0.001    0.000     0.29    30.36        .
  - exhaustiveness         7.739      100    0.075    0.077    0.077    0.097    0.003    66.56  6909.82        .
    - is_useful() 2        7.691      100    0.075    0.077    0.076    0.095    0.003    66.15  6866.96        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.007      100    0.000    0.000    0.000    0.001    0.000     0.06     6.25        .
  + Overlap()              5.347      100    0.048    0.053    0.053    0.063    0.003    45.99  4774.11        .
  + Difference()           4.937      100    0.043    0.049    0.049    0.063    0.003    42.46  4408.04        .
  + Compress()             0.188      100    0.000    0.002    0.002    0.005    0.001     1.62   167.86        .
  eval                     0.131      100    0.001    0.001    0.001    0.003    0.000     1.13   116.96        .
  total                   11.627      100    0.114    0.116    0.115    0.136    0.004   100.00 10381.25    0.115
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.731      100    0.006    0.007    0.007    0.012    0.001     5.64    71.18        .
  base                     1.027      100    0.010    0.010    0.010    0.013    0.001     7.92   100.00        .
  init                     0.511      100    0.004    0.005    0.005    0.006    0.000     3.94    49.76        .
  parse                    0.216      100    0.002    0.002    0.002    0.003    0.000     1.67    21.03        .
  check                   11.194      100    0.109    0.112    0.111    0.139    0.004    86.34  1089.97        .
  - usefulness             3.402      100    0.033    0.034    0.034    0.040    0.001    26.24   331.26        .
    - is_useful() 1        3.343      100    0.030    0.033    0.033    0.040    0.001    25.78   325.51        .
  - combine                0.036      100    0.000    0.000    0.000    0.001    0.000     0.28     3.51        .
  - exhaustiveness         7.736      100    0.075    0.077    0.076    0.105    0.004    59.67   753.26        .
    - is_useful() 2        7.690      100    0.075    0.077    0.076    0.105    0.004    59.31   748.78        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.02     0.19        .
  - print                  0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     0.29        .
  + Overlap()              5.454      100    0.046    0.055    0.054    0.076    0.004    42.07   531.06        .
  + Difference()           4.868      100    0.043    0.049    0.048    0.058    0.002    37.55   474.00        .
  + Compress()             0.194      100    0.000    0.002    0.002    0.006    0.001     1.50    18.89        .
  eval                     1.041      100    0.010    0.010    0.010    0.014    0.001     8.03   101.36        .
  total                   12.965      100    0.127    0.130    0.129    0.157    0.004   100.00  1262.41    0.119
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.664       10    0.065    0.066    0.066    0.069    0.001    24.30    65.94        .
  base                     1.007       10    0.099    0.101    0.100    0.102    0.001    36.85   100.00        .
  init                     0.596       10    0.058    0.060    0.059    0.062    0.001    21.81    59.19        .
  parse                    0.023       10    0.002    0.002    0.002    0.003    0.000     0.84     2.28        .
  check                    1.111       10    0.110    0.111    0.111    0.114    0.001    40.65   110.33        .
  - usefulness             0.340       10    0.033    0.034    0.034    0.035    0.000    12.44    33.76        .
    - is_useful() 1        0.330       10    0.031    0.033    0.033    0.034    0.001    12.07    32.77        .
  - combine                0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.10        .
  - exhaustiveness         0.769       10    0.076    0.077    0.077    0.080    0.001    28.14    76.37        .
    - is_useful() 2        0.761       10    0.074    0.076    0.076    0.079    0.001    27.84    75.57        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.534       10    0.050    0.053    0.053    0.058    0.003    19.54    53.03        .
  + Difference()           0.483       10    0.044    0.048    0.049    0.051    0.002    17.67    47.96        .
  + Compress()             0.018       10    0.000    0.002    0.002    0.004    0.001     0.66     1.79        .
  eval                     1.003       10    0.098    0.100    0.100    0.103    0.002    36.70    99.60        .
  total                    2.733       10    0.270    0.273    0.273    0.278    0.002   100.00   271.40    0.173
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.732        1    0.732    0.732    0.732    0.732        .    45.44    73.49        .
  base                     0.996        1    0.996    0.996    0.996    0.996        .    61.82   100.00        .
  init                     0.492        1    0.492    0.492    0.492    0.492        .    30.54    49.40        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.12     0.20        .
  check                    0.111        1    0.111    0.111    0.111    0.111        .     6.89    11.14        .
  - usefulness             0.034        1    0.034    0.034    0.034    0.034        .     2.11     3.41        .
    - is_useful() 1        0.034        1    0.034    0.034    0.034    0.034        .     2.11     3.41        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.10        .
  - exhaustiveness         0.076        1    0.076    0.076    0.076    0.076        .     4.72     7.63        .
    - is_useful() 2        0.076        1    0.076    0.076    0.076    0.076        .     4.72     7.63        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.052        1    0.052    0.052    0.052    0.052        .     3.23     5.22        .
  + Difference()           0.049        1    0.049    0.049    0.049    0.049        .     3.04     4.92        .
  + Compress()             0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.006        1    1.006    1.006    1.006    1.006        .    62.45   101.00        .
  total                    1.611        1    1.611    1.611    1.611    1.611        .   100.00   161.75    0.615
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.406        1    8.406    8.406    8.406    8.406        .    56.39    84.34        .
  base                     9.967        1    9.967    9.967    9.967    9.967        .    66.86   100.00        .
  init                     4.788        1    4.788    4.788    4.788    4.788        .    32.12    48.04        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.02        .
  check                    0.113        1    0.113    0.113    0.113    0.113        .     0.76     1.13        .
  - usefulness             0.036        1    0.036    0.036    0.036    0.036        .     0.24     0.36        .
    - is_useful() 1        0.036        1    0.036    0.036    0.036    0.036        .     0.24     0.36        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.075        1    0.075    0.075    0.075    0.075        .     0.50     0.75        .
    - is_useful() 2        0.075        1    0.075    0.075    0.075    0.075        .     0.50     0.75        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  + Overlap()              0.055        1    0.055    0.055    0.055    0.055        .     0.37     0.55        .
  + Difference()           0.049        1    0.049    0.049    0.049    0.049        .     0.33     0.49        .
  + Compress()             0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  eval                    10.005        1   10.005   10.005   10.005   10.005        .    67.11   100.38        .
  total                   14.908        1   14.908   14.908   14.908   14.908        .   100.00   149.57    4.941
-------------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.003        1    0.003    0.003    0.003    0.003        .     0.01    33.33        .
  base                     0.009        1    0.009    0.009    0.009    0.009        .     0.02   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.141        1    0.141    0.141    0.141    0.141        .     0.33  1566.67        .
  check                   42.367        1   42.367   42.367   42.367   42.367        .    99.64  4.7e+05        .
  - usefulness            34.670        1   34.670   34.670   34.670   34.670        .    81.53  3.9e+05        .
    - is_useful() 1       34.440        1   34.440   34.440   34.440   34.440        .    80.99  3.8e+05        .
  - combine                0.123        1    0.123    0.123    0.123    0.123        .     0.29  1366.67        .
  - exhaustiveness         7.572        1    7.572    7.572    7.572    7.572        .    17.81 84133.33        .
    - is_useful() 2        7.565        1    7.565    7.565    7.565    7.565        .    17.79 84055.56        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00    11.11        .
  + Overlap()             12.709        1   12.709   12.709   12.709   12.709        .    29.89  1.4e+05        .
  + Difference()           5.145        1    5.145    5.145    5.145    5.145        .    12.10 57166.67        .
  + Compress()             7.853        1    7.853    7.853    7.853    7.853        .    18.47 87255.56        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.03   144.44        .
  total                   42.522        1   42.522   42.522   42.522   42.522        .   100.00  4.7e+05   42.513
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.00     2.13        .
  base                     0.094        1    0.094    0.094    0.094    0.094        .     0.22   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.00     2.13        .
  parse                    0.137        1    0.137    0.137    0.137    0.137        .     0.32   145.74        .
  check                   42.470        1   42.470   42.470   42.470   42.470        .    99.43 45180.85        .
  - usefulness            34.738        1   34.738   34.738   34.738   34.738        .    81.33 36955.32        .
    - is_useful() 1       34.538        1   34.538   34.538   34.538   34.538        .    80.86 36742.55        .
  - combine                0.116        1    0.116    0.116    0.116    0.116        .     0.27   123.40        .
  - exhaustiveness         7.613        1    7.613    7.613    7.613    7.613        .    17.82  8098.94        .
    - is_useful() 2        7.607        1    7.607    7.607    7.607    7.607        .    17.81  8092.55        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     1.06        .
  + Overlap()             12.581        1   12.581   12.581   12.581   12.581        .    29.45 13384.04        .
  + Difference()           5.124        1    5.124    5.124    5.124    5.124        .    12.00  5451.06        .
  + Compress()             7.884        1    7.884    7.884    7.884    7.884        .    18.46  8387.23        .
  eval                     0.106        1    0.106    0.106    0.106    0.106        .     0.25   112.77        .
  total                   42.715        1   42.715   42.715   42.715   42.715        .   100.00 45441.49   42.621
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.013        1    0.013    0.013    0.013    0.013        .     0.03     1.45        .
  base                     0.895        1    0.895    0.895    0.895    0.895        .     2.04   100.00        .
  init                     0.012        1    0.012    0.012    0.012    0.012        .     0.03     1.34        .
  parse                    0.137        1    0.137    0.137    0.137    0.137        .     0.31    15.31        .
  check                   42.874        1   42.874   42.874   42.874   42.874        .    97.64  4790.39        .
  - usefulness            35.095        1   35.095   35.095   35.095   35.095        .    79.92  3921.23        .
    - is_useful() 1       34.871        1   34.871   34.871   34.871   34.871        .    79.41  3896.20        .
  - combine                0.115        1    0.115    0.115    0.115    0.115        .     0.26    12.85        .
  - exhaustiveness         7.660        1    7.660    7.660    7.660    7.660        .    17.44   855.87        .
    - is_useful() 2        7.654        1    7.654    7.654    7.654    7.654        .    17.43   855.20        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.11        .
  + Overlap()             12.721        1   12.721   12.721   12.721   12.721        .    28.97  1421.34        .
  + Difference()           5.178        1    5.178    5.178    5.178    5.178        .    11.79   578.55        .
  + Compress()             7.921        1    7.921    7.921    7.921    7.921        .    18.04   885.03        .
  eval                     0.888        1    0.888    0.888    0.888    0.888        .     2.02    99.22        .
  total                   43.911        1   43.911   43.911   43.911   43.911        .   100.00  4906.26   43.016
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.189        1    0.189    0.189    0.189    0.189        .     0.36     2.13        .
  base                     8.869        1    8.869    8.869    8.869    8.869        .    16.89   100.00        .
  init                     0.118        1    0.118    0.118    0.118    0.118        .     0.22     1.33        .
  parse                    0.136        1    0.136    0.136    0.136    0.136        .     0.26     1.53        .
  check                   43.382        1   43.382   43.382   43.382   43.382        .    82.64   489.14        .
  - usefulness            35.550        1   35.550   35.550   35.550   35.550        .    67.72   400.83        .
    - is_useful() 1       35.319        1   35.319   35.319   35.319   35.319        .    67.28   398.23        .
  - combine                0.117        1    0.117    0.117    0.117    0.117        .     0.22     1.32        .
  - exhaustiveness         7.711        1    7.711    7.711    7.711    7.711        .    14.69    86.94        .
    - is_useful() 2        7.705        1    7.705    7.705    7.705    7.705        .    14.68    86.88        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()             12.847        1   12.847   12.847   12.847   12.847        .    24.47   144.85        .
  + Difference()           5.195        1    5.195    5.195    5.195    5.195        .     9.90    58.57        .
  + Compress()             8.182        1    8.182    8.182    8.182    8.182        .    15.59    92.25        .
  eval                     8.859        1    8.859    8.859    8.859    8.859        .    16.88    99.89        .
  total                   52.496        1   52.496   52.496   52.496   52.496        .   100.00   591.90   43.627
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_integer, obs(10000000) levels(1000) rep(1)
. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.00    10.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.02   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.00    10.00        .
  parse                    0.141        1    0.141    0.141    0.141    0.141        .     0.32  1410.00        .
  check                   43.776        1   43.776   43.776   43.776   43.776        .    99.65  4.4e+05        .
  - usefulness            35.889        1   35.889   35.889   35.889   35.889        .    81.69  3.6e+05        .
    - is_useful() 1       35.670        1   35.670   35.670   35.670   35.670        .    81.20  3.6e+05        .
  - combine                0.120        1    0.120    0.120    0.120    0.120        .     0.27  1200.00        .
  - exhaustiveness         7.765        1    7.765    7.765    7.765    7.765        .    17.68 77650.00        .
    - is_useful() 2        7.759        1    7.759    7.759    7.759    7.759        .    17.66 77590.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00    10.00        .
  + Overlap()             13.051        1   13.051   13.051   13.051   13.051        .    29.71  1.3e+05        .
  + Difference()           5.240        1    5.240    5.240    5.240    5.240        .    11.93 52400.00        .
  + Compress()             8.130        1    8.130    8.130    8.130    8.130        .    18.51 81300.00        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.03   130.00        .
  total                   43.931        1   43.931   43.931   43.931   43.931        .   100.00  4.4e+05   43.921
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.00     1.87        .
  base                     0.107        1    0.107    0.107    0.107    0.107        .     0.25   100.00        .
  init                     0.003        1    0.003    0.003    0.003    0.003        .     0.01     2.80        .
  parse                    0.140        1    0.140    0.140    0.140    0.140        .     0.32   130.84        .
  check                   42.909        1   42.909   42.909   42.909   42.909        .    99.43 40101.87        .
  - usefulness            35.147        1   35.147   35.147   35.147   35.147        .    81.44 32847.66        .
    - is_useful() 1       34.923        1   34.923   34.923   34.923   34.923        .    80.92 32638.32        .
  - combine                0.120        1    0.120    0.120    0.120    0.120        .     0.28   112.15        .
  - exhaustiveness         7.640        1    7.640    7.640    7.640    7.640        .    17.70  7140.19        .
    - is_useful() 2        7.633        1    7.633    7.633    7.633    7.633        .    17.69  7133.64        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.93        .
  + Overlap()             12.730        1   12.730   12.730   12.730   12.730        .    29.50 11897.20        .
  + Difference()           5.169        1    5.169    5.169    5.169    5.169        .    11.98  4830.84        .
  + Compress()             8.013        1    8.013    8.013    8.013    8.013        .    18.57  7488.79        .
  eval                     0.103        1    0.103    0.103    0.103    0.103        .     0.24    96.26        .
  total                   43.156        1   43.156   43.156   43.156   43.156        .   100.00 40332.71   43.049
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.015        1    0.015    0.015    0.015    0.015        .     0.03     1.42        .
  base                     1.060        1    1.060    1.060    1.060    1.060        .     2.43   100.00        .
  init                     0.054        1    0.054    0.054    0.054    0.054        .     0.12     5.09        .
  parse                    0.138        1    0.138    0.138    0.138    0.138        .     0.32    13.02        .
  check                   42.344        1   42.344   42.344   42.344   42.344        .    97.12  3994.72        .
  - usefulness            34.622        1   34.622   34.622   34.622   34.622        .    79.41  3266.23        .
    - is_useful() 1       34.405        1   34.405   34.405   34.405   34.405        .    78.91  3245.75        .
  - combine                0.116        1    0.116    0.116    0.116    0.116        .     0.27    10.94        .
  - exhaustiveness         7.603        1    7.603    7.603    7.603    7.603        .    17.44   717.26        .
    - is_useful() 2        7.597        1    7.597    7.597    7.597    7.597        .    17.42   716.70        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()             12.607        1   12.607   12.607   12.607   12.607        .    28.91  1189.34        .
  + Difference()           5.145        1    5.145    5.145    5.145    5.145        .    11.80   485.38        .
  + Compress()             7.915        1    7.915    7.915    7.915    7.915        .    18.15   746.70        .
  eval                     1.065        1    1.065    1.065    1.065    1.065        .     2.44   100.47        .
  total                   43.601        1   43.601   43.601   43.601   43.601        .   100.00  4113.30   42.541
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.183        1    0.183    0.183    0.183    0.183        .     0.35     2.02        .
  base                     9.071        1    9.071    9.071    9.071    9.071        .    17.41   100.00        .
  init                     0.320        1    0.320    0.320    0.320    0.320        .     0.61     3.53        .
  parse                    0.138        1    0.138    0.138    0.138    0.138        .     0.26     1.52        .
  check                   42.706        1   42.706   42.706   42.706   42.706        .    81.96   470.80        .
  - usefulness            35.064        1   35.064   35.064   35.064   35.064        .    67.29   386.55        .
    - is_useful() 1       34.859        1   34.859   34.859   34.859   34.859        .    66.90   384.29        .
  - combine                0.117        1    0.117    0.117    0.117    0.117        .     0.22     1.29        .
  - exhaustiveness         7.521        1    7.521    7.521    7.521    7.521        .    14.43    82.91        .
    - is_useful() 2        7.514        1    7.514    7.514    7.514    7.514        .    14.42    82.84        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()             12.682        1   12.682   12.682   12.682   12.682        .    24.34   139.81        .
  + Difference()           5.090        1    5.090    5.090    5.090    5.090        .     9.77    56.11        .
  + Compress()             8.049        1    8.049    8.049    8.049    8.049        .    15.45    88.73        .
  eval                     8.944        1    8.944    8.944    8.944    8.944        .    17.16    98.60        .
  total                   52.108        1   52.108   52.108   52.108   52.108        .   100.00   574.45   43.037
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_float,   obs(10000000) levels(1000) rep(1)
. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.01    20.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.05   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.01    20.00        .
  parse                    0.068        1    0.068    0.068    0.068    0.068        .     0.32   680.00        .
  check                   20.902        1   20.902   20.902   20.902   20.902        .    99.61  2.1e+05        .
  - usefulness            12.803        1   12.803   12.803   12.803   12.803        .    61.01  1.3e+05        .
    - is_useful() 1       12.721        1   12.721   12.721   12.721   12.721        .    60.62  1.3e+05        .
  - combine                0.046        1    0.046    0.046    0.046    0.046        .     0.22   460.00        .
  - exhaustiveness         8.050        1    8.050    8.050    8.050    8.050        .    38.36 80500.00        .
    - is_useful() 2        8.043        1    8.043    8.043    8.043    8.043        .    38.33 80430.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00    10.00        .
  + Overlap()              7.732        1    7.732    7.732    7.732    7.732        .    36.85 77320.00        .
  + Difference()           5.059        1    5.059    5.059    5.059    5.059        .    24.11 50590.00        .
  + Compress()             2.553        1    2.553    2.553    2.553    2.553        .    12.17 25530.00        .
  eval                     0.012        1    0.012    0.012    0.012    0.012        .     0.06   120.00        .
  total                   20.984        1   20.984   20.984   20.984   20.984        .   100.00  2.1e+05   20.974
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.007        1    0.007    0.007    0.007    0.007        .     0.03     6.93        .
  base                     0.101        1    0.101    0.101    0.101    0.101        .     0.48   100.00        .
  init                     0.007        1    0.007    0.007    0.007    0.007        .     0.03     6.93        .
  parse                    0.069        1    0.069    0.069    0.069    0.069        .     0.33    68.32        .
  check                   20.792        1   20.792   20.792   20.792   20.792        .    99.17 20586.14        .
  - usefulness            12.744        1   12.744   12.744   12.744   12.744        .    60.78 12617.82        .
    - is_useful() 1       12.662        1   12.662   12.662   12.662   12.662        .    60.39 12536.63        .
  - combine                0.048        1    0.048    0.048    0.048    0.048        .     0.23    47.52        .
  - exhaustiveness         7.997        1    7.997    7.997    7.997    7.997        .    38.14  7917.82        .
    - is_useful() 2        7.992        1    7.992    7.992    7.992    7.992        .    38.12  7912.87        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.99        .
  + Overlap()              7.717        1    7.717    7.717    7.717    7.717        .    36.81  7640.59        .
  + Difference()           5.030        1    5.030    5.030    5.030    5.030        .    23.99  4980.20        .
  + Compress()             2.430        1    2.430    2.430    2.430    2.430        .    11.59  2405.94        .
  eval                     0.098        1    0.098    0.098    0.098    0.098        .     0.47    97.03        .
  total                   20.967        1   20.967   20.967   20.967   20.967        .   100.00 20759.41   20.866
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.071        1    0.071    0.071    0.071    0.071        .     0.32     7.33        .
  base                     0.969        1    0.969    0.969    0.969    0.969        .     4.39   100.00        .
  init                     0.066        1    0.066    0.066    0.066    0.066        .     0.30     6.81        .
  parse                    0.064        1    0.064    0.064    0.064    0.064        .     0.29     6.60        .
  check                   20.953        1   20.953   20.953   20.953   20.953        .    95.03  2162.33        .
  - usefulness            12.775        1   12.775   12.775   12.775   12.775        .    57.94  1318.37        .
    - is_useful() 1       12.685        1   12.685   12.685   12.685   12.685        .    57.53  1309.08        .
  - combine                0.048        1    0.048    0.048    0.048    0.048        .     0.22     4.95        .
  - exhaustiveness         8.128        1    8.128    8.128    8.128    8.128        .    36.87   838.80        .
    - is_useful() 2        8.123        1    8.123    8.123    8.123    8.123        .    36.84   838.29        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.10        .
  + Overlap()              7.842        1    7.842    7.842    7.842    7.842        .    35.57   809.29        .
  + Difference()           5.060        1    5.060    5.060    5.060    5.060        .    22.95   522.19        .
  + Compress()             2.454        1    2.454    2.454    2.454    2.454        .    11.13   253.25        .
  eval                     0.964        1    0.964    0.964    0.964    0.964        .     4.37    99.48        .
  total                   22.048        1   22.048   22.048   22.048   22.048        .   100.00  2275.34   21.079
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.753        1    0.753    0.753    0.753    0.753        .     2.44     7.71        .
  base                     9.766        1    9.766    9.766    9.766    9.766        .    31.64   100.00        .
  init                     0.527        1    0.527    0.527    0.527    0.527        .     1.71     5.40        .
  parse                    0.065        1    0.065    0.065    0.065    0.065        .     0.21     0.67        .
  check                   20.656        1   20.656   20.656   20.656   20.656        .    66.92   211.51        .
  - usefulness            12.564        1   12.564   12.564   12.564   12.564        .    40.70   128.65        .
    - is_useful() 1       12.484        1   12.484   12.484   12.484   12.484        .    40.44   127.83        .
  - combine                0.050        1    0.050    0.050    0.050    0.050        .     0.16     0.51        .
  - exhaustiveness         8.039        1    8.039    8.039    8.039    8.039        .    26.04    82.32        .
    - is_useful() 2        8.034        1    8.034    8.034    8.034    8.034        .    26.03    82.27        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()              7.697        1    7.697    7.697    7.697    7.697        .    24.94    78.81        .
  + Difference()           5.044        1    5.044    5.044    5.044    5.044        .    16.34    51.65        .
  + Compress()             2.435        1    2.435    2.435    2.435    2.435        .     7.89    24.93        .
  eval                     9.619        1    9.619    9.619    9.619    9.619        .    31.16    98.49        .
  total                   30.867        1   30.867   30.867   30.867   30.867        .   100.00   316.07   21.101
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_string,  obs(10000000) levels(1000) rep(1)
. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.743     1000    0.000    0.001    0.001    0.002    0.000    69.44   248.49        .
  base                     0.299     1000    0.000    0.000    0.000    0.001    0.000    27.94   100.00        .
  init                     0.065     1000    0.000    0.000    0.000    0.001    0.000     6.07    21.74        .
  parse                    0.627     1000    0.000    0.001    0.001    0.002    0.000    58.60   209.70        .
  check                    0.005     1000    0.000    0.000    0.000    0.001    0.000     0.47     1.67        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.347     1000    0.000    0.000    0.000    0.001    0.000    32.43   116.05        .
  total                    1.070     1000    0.001    0.001    0.001    0.002    0.000   100.00   357.86    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.879     1000    0.001    0.002    0.002    0.005    0.000    57.73    76.32        .
  base                     2.462     1000    0.002    0.002    0.002    0.005    0.001    75.64   100.00        .
  init                     0.080     1000    0.000    0.000    0.000    0.001    0.000     2.46     3.25        .
  parse                    0.606     1000    0.000    0.001    0.001    0.001    0.000    18.62    24.61        .
  check                    0.004     1000    0.000    0.000    0.000    0.001    0.000     0.12     0.16        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.539     1000    0.002    0.003    0.003    0.005    0.001    78.00   103.13        .
  total                    3.255     1000    0.003    0.003    0.003    0.006    0.000   100.00   132.21    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.117      100    0.010    0.011    0.011    0.013    0.001    44.38    45.72        .
  base                     2.443      100    0.024    0.024    0.024    0.033    0.001    97.06   100.00        .
  init                     0.012      100    0.000    0.000    0.000    0.001    0.000     0.48     0.49        .
  parse                    0.070      100    0.000    0.001    0.001    0.001    0.000     2.78     2.87        .
  check                    0.001      100    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.432      100    0.023    0.024    0.024    0.034    0.001    96.62    99.55        .
  total                    2.517      100    0.024    0.025    0.025    0.035    0.001   100.00   103.03    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.871       10    0.177    0.187    0.189    0.194    0.006    76.34    75.72        .
  base                     2.471       10    0.241    0.247    0.242    0.290    0.015   100.82   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  parse                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.33     0.32        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.442       10    0.240    0.244    0.242    0.257    0.005    99.63    98.83        .
  total                    2.451       10    0.241    0.245    0.243    0.258    0.005   100.00    99.19   -0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.020        1    3.020    3.020    3.020    3.020        .   123.37   125.16        .
  base                     2.413        1    2.413    2.413    2.413    2.413        .    98.57   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.448        1    2.448    2.448    2.448    2.448        .   100.00   101.45        .
  total                    2.448        1    2.448    2.448    2.448    2.448        .   100.00   101.45    0.035
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.763     1000    0.000    0.001    0.001    0.003    0.000    70.65   249.35        .
  base                     0.306     1000    0.000    0.000    0.000    0.001    0.000    28.33   100.00        .
  init                     0.070     1000    0.000    0.000    0.000    0.001    0.000     6.48    22.88        .
  parse                    0.647     1000    0.000    0.001    0.001    0.002    0.000    59.91   211.44        .
  check                    0.004     1000    0.000    0.000    0.000    0.001    0.000     0.37     1.31        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.331     1000    0.000    0.000    0.000    0.001    0.000    30.65   108.17        .
  total                    1.080     1000    0.001    0.001    0.001    0.002    0.000   100.00   352.94    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.309     1000    0.001    0.002    0.002    0.004    0.000    60.67    80.76        .
  base                     2.859     1000    0.002    0.003    0.003    0.008    0.001    75.12   100.00        .
  init                     0.075     1000    0.000    0.000    0.000    0.001    0.000     1.97     2.62        .
  parse                    0.711     1000    0.000    0.001    0.001    0.002    0.000    18.68    24.87        .
  check                    0.005     1000    0.000    0.000    0.000    0.001    0.000     0.13     0.17        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.986     1000    0.002    0.003    0.003    0.009    0.001    78.46   104.44        .
  total                    3.806     1000    0.003    0.004    0.004    0.011    0.001   100.00   133.12    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.680      100    0.014    0.017    0.016    0.026    0.002    27.43    27.55        .
  base                     6.098      100    0.056    0.061    0.058    0.205    0.015    99.58   100.00        .
  init                     0.012      100    0.000    0.000    0.000    0.001    0.000     0.20     0.20        .
  parse                    0.068      100    0.000    0.001    0.001    0.001    0.000     1.11     1.12        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     6.042      100    0.057    0.060    0.059    0.077    0.004    98.66    99.08        .
  total                    6.124      100    0.058    0.061    0.060    0.077    0.004   100.00   100.43    0.000
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.057       10    0.184    0.206    0.198    0.250    0.021    78.45    78.12        .
  base                     2.633       10    0.248    0.263    0.257    0.291    0.013   100.42   100.00        .
  init                     0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  parse                    0.007       10    0.000    0.001    0.001    0.001    0.000     0.27     0.27        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.615       10    0.249    0.262    0.257    0.278    0.011    99.73    99.32        .
  total                    2.622       10    0.250    0.262    0.258    0.279    0.011   100.00    99.58   -0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.772        1    3.772    3.772    3.772    3.772        .   102.22   109.05        .
  base                     3.459        1    3.459    3.459    3.459    3.459        .    93.74   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.03        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.689        1    3.689    3.689    3.689    3.689        .    99.97   106.65        .
  total                    3.690        1    3.690    3.690    3.690    3.690        .   100.00   106.68    0.231
-------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.770     1000    0.001    0.002    0.002    0.006    0.001   113.24   621.05        .
  base                     0.285     1000    0.000    0.000    0.000    0.001    0.000    18.23   100.00        .
  init                     0.127     1000    0.000    0.000    0.000    0.001    0.000     8.13    44.56        .
  parse                    1.036     1000    0.000    0.001    0.001    0.003    0.001    66.28   363.51        .
  check                    0.011     1000    0.000    0.000    0.000    0.001    0.000     0.70     3.86        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.344     1000    0.000    0.000    0.000    0.002    0.000    22.01   120.70        .
  total                    1.563     1000    0.001    0.002    0.001    0.004    0.001   100.00   548.42    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              13.579     1000    0.008    0.014    0.013    0.026    0.004   275.83   420.92        .
  base                     3.226     1000    0.001    0.003    0.003    0.009    0.001    65.53   100.00        .
  init                     0.177     1000    0.000    0.000    0.000    0.002    0.000     3.60     5.49        .
  parse                    1.378     1000    0.000    0.001    0.001    0.004    0.001    27.99    42.72        .
  check                    0.009     1000    0.000    0.000    0.000    0.001    0.000     0.18     0.28        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.313     1000    0.001    0.003    0.003    0.008    0.001    67.30   102.70        .
  total                    4.923     1000    0.002    0.005    0.005    0.012    0.002   100.00   152.60    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              11.211      100    0.079    0.112    0.108    0.166    0.019   441.03   375.45        .
  base                     2.986      100    0.018    0.030    0.030    0.047    0.009   117.47   100.00        .
  init                     0.014      100    0.000    0.000    0.000    0.001    0.000     0.55     0.47        .
  parse                    0.119      100    0.000    0.001    0.001    0.003    0.001     4.68     3.99        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.402      100    0.018    0.024    0.020    0.048    0.007    94.49    80.44        .
  total                    2.542      100    0.019    0.025    0.022    0.050    0.007   100.00    85.13   -0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              10.097       10    0.918    1.010    1.006    1.069    0.053   458.54   428.57        .
  base                     2.356       10    0.203    0.236    0.237    0.293    0.026   106.99   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.05     0.04        .
  parse                    0.011       10    0.001    0.001    0.001    0.002    0.000     0.50     0.47        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.190       10    0.187    0.219    0.216    0.266    0.022    99.46    92.95        .
  total                    2.202       10    0.188    0.220    0.218    0.267    0.022   100.00    93.46   -0.015
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              12.192        1   12.192   12.192   12.192   12.192        .   488.66   520.58        .
  base                     2.342        1    2.342    2.342    2.342    2.342        .    93.87   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.494        1    2.494    2.494    2.494    2.494        .    99.96   106.49        .
  total                    2.495        1    2.495    2.495    2.495    2.495        .   100.00   106.53    0.153
-------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:   6 Oct 2024, 14:00:49
-----------------------------------------------------------------------------------------------------------------------------------------------------
