---------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  25 Aug 2024, 17:11:34

. 
. dis "`c(current_date)'"
25 Aug 2024

. dis "`c(current_time)'"
17:11:34

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. profile_obs_integer, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.203     1000    0.000    0.000    0.000    0.003    0.000     4.39   100.00        .
        init          0.290     1000    0.000    0.000    0.000    0.016    0.001     6.28   142.86        .
       parse          0.590     1000    0.000    0.001    0.001    0.003    0.001    12.77   290.64        .
       check          3.466     1000    0.002    0.003    0.003    0.007    0.001    75.02  1707.39        .
        eval          0.241     1000    0.000    0.000    0.000    0.001    0.000     5.22   118.72        .
       total          4.620     1000    0.003    0.005    0.004    0.020    0.001   100.00  2275.86    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.693     1000    0.001    0.002    0.002    0.007    0.001    23.27   100.00        .
        init          1.561     1000    0.001    0.002    0.002    0.007    0.001    21.45    92.20        .
       parse          0.601     1000    0.000    0.001    0.001    0.003    0.001     8.26    35.50        .
       check          3.289     1000    0.002    0.003    0.003    0.010    0.001    45.20   194.27        .
        eval          1.801     1000    0.001    0.002    0.002    0.009    0.001    24.75   106.38        .
       total          7.277     1000    0.006    0.007    0.007    0.022    0.001   100.00   429.83    0.006
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.373      100    0.021    0.024    0.023    0.038    0.003    52.28   100.00        .
        init          1.677      100    0.015    0.017    0.016    0.028    0.002    36.95    70.67        .
       parse          0.063      100    0.000    0.001    0.001    0.002    0.001     1.39     2.65        .
       check          0.322      100    0.002    0.003    0.003    0.005    0.001     7.09    13.57        .
        eval          2.475      100    0.021    0.025    0.024    0.036    0.003    54.53   104.30        .
       total          4.539      100    0.040    0.045    0.044    0.066    0.005   100.00   191.28    0.022
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.527       10    0.142    0.153    0.148    0.181    0.012    52.26   100.00        .
        init          1.329       10    0.119    0.133    0.129    0.158    0.012    45.48    87.03        .
       parse          0.007       10    0.000    0.001    0.001    0.002    0.001     0.24     0.46        .
       check          0.036       10    0.003    0.004    0.004    0.004    0.001     1.23     2.36        .
        eval          1.550       10    0.140    0.155    0.150    0.185    0.015    53.05   101.51        .
       total          2.922       10    0.264    0.292    0.285    0.325    0.019   100.00   191.36    0.140
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.479        1    1.479    1.479    1.479    1.479        .    53.05   100.00        .
        init          1.256        1    1.256    1.256    1.256    1.256        .    45.05    84.92        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.07        .
       check          0.003        1    0.003    0.003    0.003    0.003        .     0.11     0.20        .
        eval          1.528        1    1.528    1.528    1.528    1.528        .    54.81   103.31        .
       total          2.788        1    2.788    2.788    2.788    2.788        .   100.00   188.51    1.309
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.192     1000    0.000    0.000    0.000    0.001    0.000     4.79   100.00        .
        init          0.123     1000    0.000    0.000    0.000    0.001    0.000     3.07    64.06        .
       parse          0.506     1000    0.000    0.001    0.001    0.003    0.001    12.62   263.54        .
       check          3.102     1000    0.002    0.003    0.003    0.010    0.001    77.34  1615.62        .
        eval          0.244     1000    0.000    0.000    0.000    0.002    0.000     6.08   127.08        .
       total          4.011     1000    0.003    0.004    0.004    0.011    0.001   100.00  2089.06    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.816     1000    0.001    0.002    0.002    0.006    0.001    30.61   100.00        .
        init          0.224     1000    0.000    0.000    0.000    0.001    0.000     3.78    12.33        .
       parse          0.554     1000    0.000    0.001    0.001    0.003    0.001     9.34    30.51        .
       check          3.131     1000    0.002    0.003    0.003    0.007    0.001    52.77   172.41        .
        eval          1.990     1000    0.001    0.002    0.002    0.008    0.001    33.54   109.58        .
       total          5.933     1000    0.005    0.006    0.005    0.013    0.001   100.00   326.71    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.298      100    0.029    0.033    0.032    0.051    0.004    83.28   100.00        .
        init          0.262      100    0.002    0.003    0.003    0.005    0.001     6.62     7.94        .
       parse          0.052      100    0.000    0.001    0.000    0.004    0.001     1.31     1.58        .
       check          0.312      100    0.002    0.003    0.003    0.005    0.001     7.88     9.46        .
        eval          3.327      100    0.029    0.033    0.032    0.044    0.003    84.02   100.88        .
       total          3.960      100    0.034    0.040    0.038    0.054    0.004   100.00   120.07    0.007
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.533       10    0.139    0.153    0.145    0.183    0.014    94.34   100.00        .
        init          0.058       10    0.005    0.006    0.005    0.008    0.001     3.57     3.78        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.25     0.26        .
       check          0.030       10    0.002    0.003    0.003    0.004    0.000     1.85     1.96        .
        eval          1.533       10    0.143    0.153    0.148    0.184    0.012    94.34   100.00        .
       total          1.625       10    0.152    0.163    0.156    0.194    0.013   100.00   106.00    0.009
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.520        1    1.520    1.520    1.520    1.520        .    98.00   100.00        .
        init          0.048        1    0.048    0.048    0.048    0.048        .     3.09     3.16        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.003        1    0.003    0.003    0.003    0.003        .     0.19     0.20        .
        eval          1.500        1    1.500    1.500    1.500    1.500        .    96.71    98.68        .
       total          1.551        1    1.551    1.551    1.551    1.551        .   100.00   102.04    0.031
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.196     1000    0.000    0.000    0.000    0.001    0.000     6.15   100.00        .
        init          0.550     1000    0.000    0.001    0.001    0.003    0.001    17.25   280.61        .
       parse          0.494     1000    0.000    0.000    0.000    0.002    0.001    15.49   252.04        .
       check          1.916     1000    0.001    0.002    0.002    0.006    0.001    60.08   977.55        .
        eval          0.202     1000    0.000    0.000    0.000    0.001    0.000     6.33   103.06        .
       total          3.189     1000    0.002    0.003    0.003    0.009    0.001   100.00  1627.04    0.003
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.479     1000    0.001    0.001    0.001    0.007    0.001    16.78   100.00        .
        init          4.997     1000    0.004    0.005    0.005    0.017    0.001    56.71   337.86        .
       parse          0.466     1000    0.000    0.000    0.000    0.002    0.001     5.29    31.51        .
       check          1.874     1000    0.001    0.002    0.002    0.005    0.001    21.27   126.71        .
        eval          1.452     1000    0.001    0.001    0.001    0.005    0.001    16.48    98.17        .
       total          8.812     1000    0.007    0.009    0.008    0.023    0.001   100.00   595.81    0.007
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.409      100    0.012    0.014    0.013    0.022    0.002    18.33   100.00        .
        init          5.996      100    0.053    0.060    0.058    0.088    0.007    77.99   425.55        .
       parse          0.051      100    0.000    0.001    0.001    0.001    0.001     0.66     3.62        .
       check          0.191      100    0.001    0.002    0.002    0.004    0.001     2.48    13.56        .
        eval          1.446      100    0.013    0.014    0.014    0.020    0.002    18.81   102.63        .
       total          7.688      100    0.069    0.077    0.075    0.111    0.008   100.00   545.64    0.063
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.350       10    0.130    0.135    0.135    0.140    0.004    10.94   100.00        .
        init         10.927       10    1.029    1.093    1.081    1.161    0.043    88.54   809.41        .
       parse          0.003       10    0.000    0.000    0.000    0.001    0.000     0.02     0.22        .
       check          0.019       10    0.001    0.002    0.002    0.002    0.000     0.15     1.41        .
        eval          1.391       10    0.132    0.139    0.136    0.162    0.009    11.27   103.04        .
       total         12.341       10    1.168    1.234    1.220    1.326    0.048   100.00   914.15    1.099
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.413        1    1.413    1.413    1.413    1.413        .     4.98   100.00        .
        init         26.892        1   26.892   26.892   26.892   26.892        .    94.82  1903.18        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.14        .
        eval          1.467        1    1.467    1.467    1.467    1.467        .     5.17   103.82        .
       total         28.362        1   28.362   28.362   28.362   28.362        .   100.00  2007.22   26.949
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.204     1000    0.000    0.000    0.000    0.001    0.000    24.11   100.00        .
        init          0.084     1000    0.000    0.000    0.000    0.001    0.000     9.93    41.18        .
       parse          0.490     1000    0.000    0.000    0.000    0.003    0.001    57.92   240.20        .
       check          0.009     1000    0.000    0.000    0.000    0.001    0.000     1.06     4.41        .
        eval          0.230     1000    0.000    0.000    0.000    0.001    0.000    27.19   112.75        .
       total          0.846     1000    0.000    0.001    0.001    0.003    0.000   100.00   414.71    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.532     1000    0.001    0.002    0.002    0.005    0.001    69.64   100.00        .
        init          0.090     1000    0.000    0.000    0.000    0.001    0.000     4.09     5.87        .
       parse          0.492     1000    0.000    0.000    0.000    0.002    0.001    22.36    32.11        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.27     0.39        .
        eval          1.586     1000    0.001    0.002    0.002    0.005    0.001    72.09   103.52        .
       total          2.200     1000    0.001    0.002    0.002    0.007    0.001   100.00   143.60    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.497      100    0.013    0.015    0.014    0.021    0.002    97.84   100.00        .
        init          0.005      100    0.000    0.000    0.000    0.001    0.000     0.33     0.33        .
       parse          0.052      100    0.000    0.001    0.001    0.001    0.001     3.40     3.47        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.470      100    0.013    0.015    0.014    0.022    0.002    96.08    98.20        .
       total          1.530      100    0.013    0.015    0.015    0.023    0.002   100.00   102.20    0.000
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.496       10    0.141    0.150    0.146    0.168    0.009    99.20   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.07     0.07        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.40     0.40        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.501       10    0.138    0.150    0.141    0.174    0.014    99.54   100.33        .
       total          1.508       10    0.138    0.151    0.142    0.175    0.014   100.00   100.80    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.525        1    1.525    1.525    1.525    1.525        .   101.60   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.501        1    1.501    1.501    1.501    1.501        .   100.00    98.43        .
       total          1.501        1    1.501    1.501    1.501    1.501        .   100.00    98.43   -0.024
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.203     1000    0.000    0.000    0.000    0.005    0.000    23.07   100.00        .
        init          0.085     1000    0.000    0.000    0.000    0.001    0.000     9.66    41.87        .
       parse          0.489     1000    0.000    0.000    0.000    0.003    0.001    55.57   240.89        .
       check          0.001     1000    0.000    0.000    0.000    0.001    0.000     0.11     0.49        .
        eval          0.275     1000    0.000    0.000    0.000    0.001    0.000    31.25   135.47        .
       total          0.880     1000    0.000    0.001    0.001    0.003    0.000   100.00   433.50    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.813     1000    0.001    0.002    0.002    0.005    0.001    71.92   100.00        .
        init          0.084     1000    0.000    0.000    0.000    0.001    0.000     3.33     4.63        .
       parse          0.510     1000    0.000    0.001    0.001    0.003    0.001    20.23    28.13        .
       check          0.001     1000    0.000    0.000    0.000    0.001    0.000     0.04     0.06        .
        eval          1.902     1000    0.001    0.002    0.002    0.005    0.001    75.45   104.91        .
       total          2.521     1000    0.002    0.003    0.002    0.006    0.001   100.00   139.05    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.267      100    0.029    0.033    0.032    0.046    0.003    95.67   100.00        .
        init          0.011      100    0.000    0.000    0.000    0.001    0.000     0.32     0.34        .
       parse          0.061      100    0.000    0.001    0.001    0.002    0.001     1.79     1.87        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          3.340      100    0.030    0.033    0.032    0.048    0.004    97.80   102.23        .
       total          3.415      100    0.030    0.034    0.033    0.049    0.004   100.00   104.53    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.571       10    0.143    0.157    0.150    0.204    0.019   103.02   100.00        .
        init          0.002       10    0.000    0.000    0.000    0.001    0.000     0.13     0.13        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.26     0.25        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.519       10    0.143    0.152    0.147    0.170    0.008    99.61    96.69        .
       total          1.525       10    0.143    0.152    0.148    0.171    0.008   100.00    97.07   -0.005
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.502        1    1.502    1.502    1.502    1.502        .    94.82   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.07        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.583        1    1.583    1.583    1.583    1.583        .    99.94   105.39        .
       total          1.584        1    1.584    1.584    1.584    1.584        .   100.00   105.46    0.082
---------------------------------------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.177     1000    0.000    0.000    0.000    0.001    0.000    23.85   100.00        .
        init          0.080     1000    0.000    0.000    0.000    0.001    0.000    10.78    45.20        .
       parse          0.421     1000    0.000    0.000    0.000    0.001    0.000    56.74   237.85        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.81     3.39        .
        eval          0.209     1000    0.000    0.000    0.000    0.001    0.000    28.17   118.08        .
       total          0.742     1000    0.000    0.001    0.001    0.002    0.000   100.00   419.21    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.504     1000    0.001    0.002    0.001    0.011    0.001    72.52   100.00        .
        init          0.079     1000    0.000    0.000    0.000    0.001    0.000     3.81     5.25        .
       parse          0.418     1000    0.000    0.000    0.000    0.002    0.000    20.15    27.79        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.19     0.27        .
        eval          1.544     1000    0.001    0.002    0.002    0.004    0.001    74.45   102.66        .
       total          2.074     1000    0.001    0.002    0.002    0.005    0.001   100.00   137.90    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.405      100    0.012    0.014    0.013    0.026    0.002    93.11   100.00        .
        init          0.006      100    0.000    0.000    0.000    0.001    0.000     0.40     0.43        .
       parse          0.041      100    0.000    0.000    0.000    0.001    0.000     2.72     2.92        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.459      100    0.012    0.015    0.014    0.025    0.002    96.69   103.84        .
       total          1.509      100    0.013    0.015    0.014    0.026    0.002   100.00   107.40    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.393       10    0.132    0.139    0.137    0.148    0.006    94.57   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.07     0.07        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.27     0.29        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.468       10    0.141    0.147    0.143    0.175    0.010    99.66   105.38        .
       total          1.473       10    0.142    0.147    0.144    0.175    0.010   100.00   105.74    0.008
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.453        1    1.453    1.453    1.453    1.453        .    99.38   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.07        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.461        1    1.461    1.461    1.461    1.461        .    99.93   100.55        .
       total          1.462        1    1.462    1.462    1.462    1.462        .   100.00   100.62    0.009
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  25 Aug 2024, 17:15:01
---------------------------------------------------------------------------------------------------------------------------------------------------
