--------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  17 Sep 2024, 18:23:13

. 
. dis "`c(current_date)'"
17 Sep 2024

. dis "`c(current_time)'"
18:23:13

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. profile_obs_integer, obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.203     1000    0.000    0.000    0.000    0.002    0.000     4.66   100.00        .
        init          0.263     1000    0.000    0.000    0.000    0.003    0.000     6.03   129.56        .
       parse          0.540     1000    0.000    0.001    0.001    0.002    0.001    12.39   266.01        .
       check          3.286     1000    0.002    0.003    0.003    0.010    0.001    75.38  1618.72        .
        eval          0.240     1000    0.000    0.000    0.000    0.002    0.000     5.51   118.23        .
       total          4.359     1000    0.003    0.004    0.004    0.011    0.001   100.00  2147.29    0.004
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.753     1000    0.001    0.002    0.002    0.005    0.001    23.94   100.00        .
        init          1.562     1000    0.001    0.002    0.002    0.004    0.001    21.33    89.10        .
       parse          0.589     1000    0.000    0.001    0.001    0.002    0.001     8.04    33.60        .
       check          3.263     1000    0.002    0.003    0.003    0.007    0.001    44.55   186.14        .
        eval          1.870     1000    0.001    0.002    0.002    0.009    0.001    25.53   106.67        .
       total          7.324     1000    0.006    0.007    0.007    0.014    0.001   100.00   417.80    0.006
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.384      100    0.021    0.024    0.022    0.039    0.004    52.04   100.00        .
        init          1.712      100    0.014    0.017    0.016    0.037    0.003    37.37    71.81        .
       parse          0.062      100    0.000    0.001    0.001    0.001    0.000     1.35     2.60        .
       check          0.314      100    0.002    0.003    0.003    0.005    0.001     6.85    13.17        .
        eval          2.490      100    0.021    0.025    0.023    0.039    0.004    54.35   104.45        .
       total          4.581      100    0.040    0.046    0.043    0.071    0.007   100.00   192.16    0.022
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.584       10    0.145    0.158    0.151    0.193    0.015    52.89   100.00        .
        init          1.404       10    0.121    0.140    0.128    0.178    0.021    46.88    88.64        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.23     0.44        .
       check          0.034       10    0.003    0.003    0.003    0.004    0.001     1.14     2.15        .
        eval          1.550       10    0.145    0.155    0.151    0.177    0.011    51.75    97.85        .
       total          2.995       10    0.276    0.299    0.284    0.355    0.026   100.00   189.08    0.141
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.551        1    1.551    1.551    1.551    1.551        .    51.80   100.00        .
        init          1.318        1    1.318    1.318    1.318    1.318        .    44.02    84.98        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.06        .
       check          0.003        1    0.003    0.003    0.003    0.003        .     0.10     0.19        .
        eval          1.672        1    1.672    1.672    1.672    1.672        .    55.85   107.80        .
       total          2.994        1    2.994    2.994    2.994    2.994        .   100.00   193.04    1.443
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.223     1000    0.000    0.000    0.000    0.004    0.000     4.90   100.00        .
        init          0.155     1000    0.000    0.000    0.000    0.001    0.000     3.41    69.51        .
       parse          0.587     1000    0.000    0.001    0.001    0.005    0.001    12.91   263.23        .
       check          3.468     1000    0.002    0.003    0.003    0.029    0.001    76.27  1555.16        .
        eval          0.303     1000    0.000    0.000    0.000    0.003    0.000     6.66   135.87        .
       total          4.547     1000    0.003    0.005    0.004    0.030    0.002   100.00  2039.01    0.004
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.887     1000    0.001    0.003    0.002    0.097    0.004    31.89   100.00        .
        init          0.397     1000    0.000    0.000    0.000    0.003    0.001     4.38    13.75        .
       parse          0.737     1000    0.000    0.001    0.001    0.003    0.001     8.14    25.53        .
       check          4.474     1000    0.002    0.004    0.003    0.028    0.003    49.41   154.97        .
        eval          3.410     1000    0.001    0.003    0.002    0.035    0.003    37.66   118.12        .
       total          9.054     1000    0.005    0.009    0.007    0.052    0.005   100.00   313.61    0.006
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.255      100    0.029    0.033    0.031    0.048    0.004    82.41   100.00        .
        init          0.251      100    0.002    0.003    0.002    0.007    0.001     6.35     7.71        .
       parse          0.059      100    0.000    0.001    0.001    0.001    0.000     1.49     1.81        .
       check          0.300      100    0.002    0.003    0.003    0.007    0.001     7.59     9.22        .
        eval          3.335      100    0.030    0.033    0.032    0.050    0.004    84.43   102.46        .
       total          3.950      100    0.035    0.040    0.038    0.057    0.005   100.00   121.35    0.007
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.528       10    0.143    0.153    0.148    0.191    0.014    93.00   100.00        .
        init          0.057       10    0.005    0.006    0.006    0.006    0.000     3.47     3.73        .
       parse          0.003       10    0.000    0.000    0.000    0.001    0.000     0.18     0.20        .
       check          0.029       10    0.002    0.003    0.003    0.004    0.001     1.77     1.90        .
        eval          1.554       10    0.147    0.155    0.151    0.188    0.012    94.58   101.70        .
       total          1.643       10    0.155    0.164    0.160    0.197    0.012   100.00   107.53    0.012
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.587        1    1.587    1.587    1.587    1.587        .    94.13   100.00        .
        init          0.048        1    0.048    0.048    0.048    0.048        .     2.85     3.02        .
       parse          0.004        1    0.004    0.004    0.004    0.004        .     0.24     0.25        .
       check          0.003        1    0.003    0.003    0.003    0.003        .     0.18     0.19        .
        eval          1.631        1    1.631    1.631    1.631    1.631        .    96.74   102.77        .
       total          1.686        1    1.686    1.686    1.686    1.686        .   100.00   106.24    0.099
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.170     1000    0.000    0.000    0.000    0.001    0.000     5.31   100.00        .
        init          0.600     1000    0.000    0.001    0.001    0.002    0.001    18.74   352.94        .
       parse          0.465     1000    0.000    0.000    0.000    0.003    0.001    14.52   273.53        .
       check          1.924     1000    0.001    0.002    0.002    0.005    0.001    60.09  1131.76        .
        eval          0.181     1000    0.000    0.000    0.000    0.001    0.000     5.65   106.47        .
       total          3.202     1000    0.002    0.003    0.003    0.008    0.001   100.00  1883.53    0.003
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.529     1000    0.001    0.002    0.001    0.006    0.001    17.35   100.00        .
        init          4.942     1000    0.004    0.005    0.005    0.011    0.001    56.07   323.22        .
       parse          0.512     1000    0.000    0.001    0.001    0.002    0.001     5.81    33.49        .
       check          1.854     1000    0.001    0.002    0.002    0.005    0.001    21.03   121.26        .
        eval          1.471     1000    0.001    0.001    0.001    0.007    0.001    16.69    96.21        .
       total          8.814     1000    0.007    0.009    0.008    0.020    0.002   100.00   576.46    0.007
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.388      100    0.012    0.014    0.013    0.024    0.002    18.09   100.00        .
        init          5.973      100    0.053    0.060    0.058    0.095    0.007    77.84   430.33        .
       parse          0.055      100    0.000    0.001    0.001    0.002    0.001     0.72     3.96        .
       check          0.190      100    0.001    0.002    0.002    0.004    0.001     2.48    13.69        .
        eval          1.451      100    0.012    0.015    0.014    0.024    0.002    18.91   104.54        .
       total          7.673      100    0.068    0.077    0.074    0.114    0.008   100.00   552.81    0.063
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.376       10    0.130    0.138    0.136    0.154    0.007    10.93   100.00        .
        init         11.182       10    1.022    1.118    1.124    1.179    0.047    88.84   812.65        .
       parse          0.008       10    0.000    0.001    0.001    0.001    0.000     0.06     0.58        .
       check          0.016       10    0.001    0.002    0.001    0.003    0.001     0.13     1.16        .
        eval          1.381       10    0.132    0.138    0.135    0.157    0.008    10.97   100.36        .
       total         12.587       10    1.157    1.259    1.258    1.320    0.047   100.00   914.75    1.121
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.403        1    1.403    1.403    1.403    1.403        .     6.06   100.00        .
        init         21.701        1   21.701   21.701   21.701   21.701        .    93.71  1546.76        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.07        .
       check          0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.14        .
        eval          1.453        1    1.453    1.453    1.453    1.453        .     6.27   103.56        .
       total         23.158        1   23.158   23.158   23.158   23.158        .   100.00  1650.61   21.755
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.187     1000    0.000    0.000    0.000    0.001    0.000    22.32   100.00        .
        init          0.071     1000    0.000    0.000    0.000    0.001    0.000     8.47    37.97        .
       parse          0.477     1000    0.000    0.000    0.000    0.002    0.001    56.92   255.08        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.72     3.21        .
        eval          0.252     1000    0.000    0.000    0.000    0.001    0.000    30.07   134.76        .
       total          0.838     1000    0.000    0.001    0.001    0.003    0.000   100.00   448.13    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.516     1000    0.001    0.002    0.001    0.004    0.001    68.38   100.00        .
        init          0.085     1000    0.000    0.000    0.000    0.001    0.000     3.83     5.61        .
       parse          0.494     1000    0.000    0.000    0.000    0.002    0.001    22.28    32.59        .
       check          0.007     1000    0.000    0.000    0.000    0.001    0.000     0.32     0.46        .
        eval          1.590     1000    0.001    0.002    0.002    0.011    0.001    71.72   104.88        .
       total          2.217     1000    0.001    0.002    0.002    0.011    0.001   100.00   146.24    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.501      100    0.013    0.015    0.014    0.024    0.002    95.06   100.00        .
        init          0.010      100    0.000    0.000    0.000    0.001    0.000     0.63     0.67        .
       parse          0.054      100    0.000    0.001    0.001    0.001    0.001     3.42     3.60        .
       check          0.002      100    0.000    0.000    0.000    0.001    0.000     0.13     0.13        .
        eval          1.508      100    0.013    0.015    0.014    0.028    0.002    95.50   100.47        .
       total          1.579      100    0.014    0.016    0.015    0.029    0.002   100.00   105.20    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.495       10    0.139    0.149    0.143    0.174    0.012    97.14   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.06     0.07        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.45     0.47        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.531       10    0.142    0.153    0.150    0.173    0.010    99.48   102.41        .
       total          1.539       10    0.142    0.154    0.152    0.173    0.010   100.00   102.94    0.004
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.483        1    1.483    1.483    1.483    1.483        .    92.40   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.605        1    1.605    1.605    1.605    1.605        .   100.00   108.23        .
       total          1.605        1    1.605    1.605    1.605    1.605        .   100.00   108.23    0.122
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.211     1000    0.000    0.000    0.000    0.001    0.000    23.60   100.00        .
        init          0.095     1000    0.000    0.000    0.000    0.003    0.000    10.63    45.02        .
       parse          0.485     1000    0.000    0.000    0.000    0.002    0.001    54.25   229.86        .
       check          0.005     1000    0.000    0.000    0.000    0.001    0.000     0.56     2.37        .
        eval          0.281     1000    0.000    0.000    0.000    0.010    0.001    31.43   133.18        .
       total          0.894     1000    0.000    0.001    0.001    0.012    0.001   100.00   423.70    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.781     1000    0.001    0.002    0.002    0.008    0.001    66.41   100.00        .
        init          0.098     1000    0.000    0.000    0.000    0.004    0.000     3.65     5.50        .
       parse          0.527     1000    0.000    0.001    0.001    0.004    0.001    19.65    29.59        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.15     0.22        .
        eval          2.016     1000    0.001    0.002    0.002    0.010    0.001    75.17   113.19        .
       total          2.682     1000    0.002    0.003    0.002    0.013    0.001   100.00   150.59    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.234      100    0.029    0.032    0.031    0.047    0.003    95.15   100.00        .
        init          0.010      100    0.000    0.000    0.000    0.001    0.000     0.29     0.31        .
       parse          0.052      100    0.000    0.001    0.001    0.001    0.001     1.53     1.61        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          3.333      100    0.030    0.033    0.032    0.047    0.004    98.06   103.06        .
       total          3.399      100    0.030    0.034    0.033    0.047    0.004   100.00   105.10    0.002
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.519       10    0.141    0.152    0.147    0.174    0.011    96.38   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.06     0.07        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.44     0.46        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.568       10    0.145    0.157    0.150    0.191    0.015    99.49   103.23        .
       total          1.576       10    0.146    0.158    0.151    0.191    0.015   100.00   103.75    0.006
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.545        1    1.545    1.545    1.545    1.545        .    99.17   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.06        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.557        1    1.557    1.557    1.557    1.557        .    99.94   100.78        .
       total          1.558        1    1.558    1.558    1.558    1.558        .   100.00   100.84    0.013
--------------------------------------------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.180     1000    0.000    0.000    0.000    0.002    0.000    24.16   100.00        .
        init          0.072     1000    0.000    0.000    0.000    0.001    0.000     9.66    40.00        .
       parse          0.423     1000    0.000    0.000    0.000    0.001    0.000    56.78   235.00        .
       check          0.003     1000    0.000    0.000    0.000    0.001    0.000     0.40     1.67        .
        eval          0.218     1000    0.000    0.000    0.000    0.001    0.000    29.26   121.11        .
       total          0.745     1000    0.000    0.001    0.001    0.002    0.000   100.00   413.89    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.487     1000    0.001    0.001    0.001    0.005    0.001    70.98   100.00        .
        init          0.094     1000    0.000    0.000    0.000    0.002    0.000     4.49     6.32        .
       parse          0.441     1000    0.000    0.000    0.000    0.003    0.001    21.05    29.66        .
       check          0.001     1000    0.000    0.000    0.000    0.001    0.000     0.05     0.07        .
        eval          1.524     1000    0.001    0.002    0.001    0.005    0.001    72.74   102.49        .
       total          2.095     1000    0.001    0.002    0.002    0.006    0.001   100.00   140.89    0.001
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.465      100    0.012    0.015    0.013    0.033    0.003    97.41   100.00        .
        init          0.011      100    0.000    0.000    0.000    0.001    0.000     0.73     0.75        .
       parse          0.051      100    0.000    0.001    0.001    0.001    0.001     3.39     3.48        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.438      100    0.012    0.014    0.013    0.022    0.002    95.61    98.16        .
       total          1.504      100    0.013    0.015    0.014    0.022    0.002   100.00   102.66    0.000
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.416       10    0.130    0.142    0.138    0.164    0.012    93.04   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.46     0.49        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.515       10    0.136    0.151    0.149    0.171    0.011    99.54   106.99        .
       total          1.522       10    0.136    0.152    0.149    0.172    0.012   100.00   107.49    0.011
--------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.418        1    1.418    1.418    1.418    1.418        .    98.68   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.07        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.436        1    1.436    1.436    1.436    1.436        .    99.93   101.27        .
       total          1.437        1    1.437    1.437    1.437    1.437        .   100.00   101.34    0.019
--------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  17 Sep 2024, 18:26:42
--------------------------------------------------------------------------------------------------------------------------------------------------------
