---------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  21 Aug 2024, 18:33:16

. 
. dis "`c(current_date)'"
21 Aug 2024

. dis "`c(current_time)'"
18:33:16

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. profile_obs_integer, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.218     1000    0.000    0.000    0.000    0.003    0.000     4.96   100.00        .
        init          0.176     1000    0.000    0.000    0.000    0.001    0.000     4.00    80.73        .
       parse          0.557     1000    0.000    0.001    0.001    0.005    0.001    12.67   255.50        .
       check          3.169     1000    0.002    0.003    0.003    0.012    0.001    72.07  1453.67        .
        eval          0.339     1000    0.000    0.000    0.000    0.004    0.000     7.71   155.50        .
       total          4.397     1000    0.003    0.004    0.004    0.013    0.001   100.00  2016.97    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.746     1000    0.001    0.002    0.002    0.006    0.001    24.16   100.00        .
        init          1.497     1000    0.001    0.001    0.001    0.005    0.001    20.72    85.74        .
       parse          0.549     1000    0.000    0.001    0.001    0.003    0.001     7.60    31.44        .
       check          3.086     1000    0.002    0.003    0.003    0.005    0.000    42.71   176.75        .
        eval          1.951     1000    0.001    0.002    0.002    0.006    0.001    27.00   111.74        .
       total          7.226     1000    0.006    0.007    0.007    0.012    0.001   100.00   413.86    0.005
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.616      100    0.015    0.016    0.016    0.025    0.001    45.94   100.00        .
        init          1.411      100    0.013    0.014    0.014    0.019    0.001    40.11    87.31        .
       parse          0.054      100    0.000    0.001    0.001    0.001    0.001     1.53     3.34        .
       check          0.311      100    0.002    0.003    0.003    0.007    0.000     8.84    19.25        .
        eval          1.722      100    0.016    0.017    0.017    0.025    0.002    48.95   106.56        .
       total          3.518      100    0.033    0.035    0.035    0.043    0.002   100.00   217.70    0.019
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.412       10    0.138    0.141    0.140    0.145    0.002    51.59   100.00        .
        init          1.236       10    0.121    0.124    0.123    0.128    0.002    45.16    87.54        .
       parse          0.009       10    0.000    0.001    0.001    0.001    0.000     0.33     0.64        .
       check          0.030       10    0.003    0.003    0.003    0.003    0.000     1.10     2.12        .
        eval          1.460       10    0.141    0.146    0.145    0.161    0.006    53.34   103.40        .
       total          2.737       10    0.267    0.274    0.271    0.294    0.008   100.00   193.84    0.133
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.922       10    1.426    1.492    1.462    1.785    0.106    53.89   100.00        .
        init         12.567       10    1.219    1.257    1.251    1.286    0.023    45.38    84.22        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.03     0.05        .
       check          0.031       10    0.003    0.003    0.003    0.004    0.000     0.11     0.21        .
        eval         15.083       10    1.457    1.508    1.496    1.625    0.049    54.47   101.08        .
       total         27.690       10    2.708    2.769    2.775    2.857    0.054   100.00   185.56    1.277
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.197     1000    0.000    0.000    0.000    0.003    0.000     4.88   100.00        .
        init          0.054     1000    0.000    0.000    0.000    0.001    0.000     1.34    27.41        .
       parse          0.503     1000    0.000    0.001    0.001    0.001    0.001    12.47   255.33        .
       check          2.975     1000    0.002    0.003    0.003    0.015    0.001    73.75  1510.15        .
        eval          0.358     1000    0.000    0.000    0.000    0.004    0.001     8.87   181.73        .
       total          4.034     1000    0.003    0.004    0.004    0.015    0.001   100.00  2047.72    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.838     1000    0.001    0.002    0.002    0.006    0.001    31.81   100.00        .
        init          0.142     1000    0.000    0.000    0.000    0.001    0.000     2.46     7.73        .
       parse          0.517     1000    0.000    0.001    0.001    0.004    0.001     8.95    28.13        .
       check          2.943     1000    0.002    0.003    0.003    0.008    0.001    50.93   160.12        .
        eval          2.023     1000    0.001    0.002    0.002    0.006    0.001    35.01   110.07        .
       total          5.778     1000    0.005    0.006    0.006    0.012    0.001   100.00   314.36    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.923      100    0.015    0.019    0.017    0.038    0.006    76.10   100.00        .
        init          0.173      100    0.001    0.002    0.002    0.003    0.001     6.85     9.00        .
       parse          0.049      100    0.000    0.000    0.000    0.001    0.001     1.94     2.55        .
       check          0.291      100    0.002    0.003    0.003    0.007    0.001    11.52    15.13        .
        eval          2.006      100    0.016    0.020    0.017    0.042    0.006    79.38   104.32        .
       total          2.527      100    0.021    0.025    0.022    0.049    0.006   100.00   131.41    0.006
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.525       10    0.149    0.152    0.151    0.165    0.005    93.56   100.00        .
        init          0.042       10    0.004    0.004    0.004    0.005    0.000     2.58     2.75        .
       parse          0.008       10    0.000    0.001    0.001    0.001    0.000     0.49     0.52        .
       check          0.030       10    0.003    0.003    0.003    0.003    0.000     1.84     1.97        .
        eval          1.547       10    0.150    0.155    0.155    0.158    0.003    94.91   101.44        .
       total          1.630       10    0.159    0.163    0.163    0.166    0.003   100.00   106.89    0.011
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         15.187       10    1.503    1.519    1.507    1.553    0.019    95.25   100.00        .
        init          0.462       10    0.044    0.046    0.045    0.054    0.003     2.90     3.04        .
       parse          0.003       10    0.000    0.000    0.000    0.001    0.000     0.02     0.02        .
       check          0.030       10    0.002    0.003    0.003    0.004    0.000     0.19     0.20        .
        eval         15.449       10    1.533    1.545    1.544    1.559    0.008    96.89   101.73        .
       total         15.945       10    1.582    1.595    1.595    1.610    0.008   100.00   104.99    0.076
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.204     1000    0.000    0.000    0.000    0.002    0.000     6.52   100.00        .
        init          0.456     1000    0.000    0.000    0.000    0.004    0.001    14.57   223.53        .
       parse          0.460     1000    0.000    0.000    0.000    0.006    0.001    14.70   225.49        .
       check          1.777     1000    0.001    0.002    0.002    0.006    0.001    56.79   871.08        .
        eval          0.290     1000    0.000    0.000    0.000    0.007    0.001     9.27   142.16        .
       total          3.129     1000    0.002    0.003    0.003    0.017    0.001   100.00  1533.82    0.003
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.475     1000    0.001    0.001    0.001    0.005    0.001    17.53   100.00        .
        init          4.580     1000    0.004    0.005    0.005    0.011    0.001    54.44   310.51        .
       parse          0.449     1000    0.000    0.000    0.000    0.001    0.000     5.34    30.44        .
       check          1.744     1000    0.001    0.002    0.002    0.005    0.001    20.73   118.24        .
        eval          1.503     1000    0.001    0.002    0.001    0.003    0.001    17.87   101.90        .
       total          8.413     1000    0.007    0.008    0.008    0.016    0.001   100.00   570.37    0.007
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.368      100    0.013    0.014    0.013    0.021    0.001    18.60   100.00        .
        init          5.714      100    0.054    0.057    0.057    0.066    0.002    77.69   417.69        .
       parse          0.044      100    0.000    0.000    0.000    0.001    0.000     0.60     3.22        .
       check          0.178      100    0.001    0.002    0.002    0.003    0.000     2.42    13.01        .
        eval          1.404      100    0.013    0.014    0.014    0.019    0.001    19.09   102.63        .
       total          7.355      100    0.069    0.074    0.073    0.084    0.002   100.00   537.65    0.060
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.441       10    0.142    0.144    0.144    0.148    0.002    12.64   100.00        .
        init          9.957       10    0.972    0.996    0.985    1.065    0.027    87.34   690.98        .
       parse          0.003       10    0.000    0.000    0.000    0.001    0.000     0.03     0.21        .
       check          0.019       10    0.001    0.002    0.002    0.003    0.001     0.17     1.32        .
        eval          1.418       10    0.136    0.142    0.142    0.146    0.003    12.44    98.40        .
       total         11.400       10    1.113    1.140    1.131    1.209    0.027   100.00   791.12    0.996
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.237       10    1.401    1.424    1.415    1.460    0.021     6.66   100.00        .
        init        199.663       10   19.319   19.966   19.777   21.189    0.507    93.36  1402.42        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.00     0.04        .
       check          0.017       10    0.001    0.002    0.002    0.002    0.000     0.01     0.12        .
        eval         14.183       10    1.392    1.418    1.414    1.457    0.020     6.63    99.62        .
       total        213.874       10   20.757   21.387   21.199   22.605    0.508   100.00  1502.24   19.964
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.198     1000    0.000    0.000    0.000    0.001    0.000    22.10   100.00        .
        init          0.007     1000    0.000    0.000    0.000    0.001    0.000     0.78     3.54        .
       parse          0.440     1000    0.000    0.000    0.000    0.002    0.000    49.11   222.22        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.45     2.02        .
        eval          0.291     1000    0.000    0.000    0.000    0.003    0.000    32.48   146.97        .
       total          0.896     1000    0.000    0.001    0.001    0.004    0.000   100.00   452.53    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.498     1000    0.001    0.001    0.001    0.006    0.001    66.82   100.00        .
        init          0.010     1000    0.000    0.000    0.000    0.001    0.000     0.45     0.67        .
       parse          0.485     1000    0.000    0.000    0.000    0.004    0.001    21.63    32.38        .
       check          0.003     1000    0.000    0.000    0.000    0.001    0.000     0.13     0.20        .
        eval          1.611     1000    0.001    0.002    0.002    0.006    0.001    71.86   107.54        .
       total          2.242     1000    0.002    0.002    0.002    0.006    0.000   100.00   149.67    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.406      100    0.013    0.014    0.014    0.017    0.001    93.17   100.00        .
        init          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.050      100    0.000    0.001    0.000    0.001    0.001     3.31     3.56        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.443      100    0.013    0.014    0.014    0.020    0.001    95.63   102.63        .
       total          1.509      100    0.014    0.015    0.015    0.021    0.001   100.00   107.33    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.486       10    0.143    0.149    0.148    0.152    0.003    98.28   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.003       10    0.000    0.000    0.000    0.001    0.000     0.20     0.20        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.506       10    0.147    0.151    0.150    0.154    0.002    99.60   101.35        .
       total          1.512       10    0.148    0.151    0.151    0.155    0.002   100.00   101.75    0.003
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.892       10    1.468    1.489    1.481    1.525    0.018    98.13   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.04     0.04        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval         15.169       10    1.499    1.517    1.506    1.555    0.018    99.95   101.86        .
       total         15.176       10    1.499    1.518    1.507    1.556    0.019   100.00   101.91    0.028
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.243     1000    0.000    0.000    0.000    0.002    0.000    26.02   100.00        .
        init          0.009     1000    0.000    0.000    0.000    0.001    0.000     0.96     3.70        .
       parse          0.434     1000    0.000    0.000    0.000    0.001    0.000    46.47   178.60        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.43     1.65        .
        eval          0.349     1000    0.000    0.000    0.000    0.003    0.000    37.37   143.62        .
       total          0.934     1000    0.000    0.001    0.001    0.004    0.000   100.00   384.36    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.785     1000    0.001    0.002    0.002    0.004    0.001    66.63   100.00        .
        init          0.019     1000    0.000    0.000    0.000    0.001    0.000     0.71     1.06        .
       parse          0.492     1000    0.000    0.000    0.000    0.001    0.001    18.37    27.56        .
       check          0.005     1000    0.000    0.000    0.000    0.001    0.000     0.19     0.28        .
        eval          2.003     1000    0.001    0.002    0.002    0.008    0.001    74.77   112.21        .
       total          2.679     1000    0.002    0.003    0.003    0.008    0.001   100.00   150.08    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.169      100    0.030    0.032    0.031    0.040    0.002    96.76   100.00        .
        init          0.003      100    0.000    0.000    0.000    0.001    0.000     0.09     0.09        .
       parse          0.053      100    0.000    0.001    0.001    0.001    0.001     1.62     1.67        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          3.206      100    0.030    0.032    0.032    0.040    0.002    97.89   101.17        .
       total          3.275      100    0.031    0.033    0.032    0.040    0.002   100.00   103.34    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.559       10    0.152    0.156    0.156    0.160    0.003    97.56   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.38     0.38        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.591       10    0.157    0.159    0.158    0.163    0.002    99.56   102.05        .
       total          1.598       10    0.158    0.160    0.159    0.164    0.002   100.00   102.50    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         15.585       10    1.523    1.558    1.540    1.682    0.047    99.65   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.04     0.04        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval         15.632       10    1.529    1.563    1.558    1.618    0.023    99.96   100.30        .
       total         15.639       10    1.529    1.564    1.558    1.619    0.023   100.00   100.35    0.005
---------------------------------------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.240     1000    0.000    0.000    0.000    0.003    0.000    31.29   100.00        .
        init          0.008     1000    0.000    0.000    0.000    0.001    0.000     1.04     3.33        .
       parse          0.361     1000    0.000    0.000    0.000    0.003    0.000    47.07   150.42        .
       check          0.007     1000    0.000    0.000    0.000    0.001    0.000     0.91     2.92        .
        eval          0.254     1000    0.000    0.000    0.000    0.007    0.000    33.12   105.83        .
       total          0.767     1000    0.000    0.001    0.001    0.008    0.001   100.00   319.58    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.434     1000    0.001    0.001    0.001    0.004    0.001    70.68   100.00        .
        init          0.011     1000    0.000    0.000    0.000    0.001    0.000     0.54     0.77        .
       parse          0.410     1000    0.000    0.000    0.000    0.001    0.000    20.21    28.59        .
       check          0.002     1000    0.000    0.000    0.000    0.001    0.000     0.10     0.14        .
        eval          1.480     1000    0.001    0.001    0.001    0.006    0.001    72.94   103.21        .
       total          2.029     1000    0.001    0.002    0.002    0.006    0.000   100.00   141.49    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.377      100    0.013    0.014    0.014    0.017    0.001    93.42   100.00        .
        init          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.043      100    0.000    0.000    0.000    0.001    0.000     2.92     3.12        .
       check          0.002      100    0.000    0.000    0.000    0.001    0.000     0.14     0.15        .
        eval          1.415      100    0.013    0.014    0.014    0.022    0.001    96.00   102.76        .
       total          1.474      100    0.013    0.015    0.015    0.022    0.001   100.00   107.04    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.464       10    0.144    0.146    0.146    0.149    0.002   100.21   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.41     0.41        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.454       10    0.142    0.145    0.146    0.149    0.003    99.52    99.32        .
       total          1.461       10    0.142    0.146    0.147    0.150    0.003   100.00    99.80   -0.000
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         15.170       10    1.455    1.517    1.489    1.722    0.077    99.29   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.002       10    0.000    0.000    0.000    0.001    0.000     0.01     0.01        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval         15.272       10    1.454    1.527    1.511    1.746    0.085    99.96   100.67        .
       total         15.278       10    1.454    1.528    1.512    1.746    0.085   100.00   100.71    0.011
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  21 Aug 2024, 18:43:32
---------------------------------------------------------------------------------------------------------------------------------------------------
