-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Mael\Desktop\Projects\stata_match\dev/logs/bench_levelsof.log
  log type:  text
 opened on:  19 Sep 2024, 11:04:56

. 
. bench_all, n_obs(1000)     n_levels(10)   n_rep(1000)
Number of observations (_N) was 0, now 1,000.
100 / 1000
200 / 1000
300 / 1000
400 / 1000
500 / 1000
600 / 1000
700 / 1000
800 / 1000
900 / 1000
1000 / 1000
  10:      1.09 /     1000 =       0.0011
  11:      0.76 /     1000 =       0.0008
  12:      0.69 /     1000 =       0.0007
  13:      0.70 /     1000 =       0.0007
  14:      2.20 /     1000 =       0.0022
  15:      1.54 /     1000 =       0.0015
  20:      1.33 /     1000 =       0.0013
  21:      0.81 /     1000 =       0.0008
  22:      0.73 /     1000 =       0.0007
  23:      0.77 /     1000 =       0.0008
  24:      1.97 /     1000 =       0.0020
  25:      1.46 /     1000 =       0.0015
  30:      1.64 /     1000 =       0.0016
  31:      1.24 /     1000 =       0.0012
  32:      1.30 /     1000 =       0.0013
  33:      1.21 /     1000 =       0.0012
  34:      1.18 /     1000 =       0.0012
  35:      2.48 /     1000 =       0.0025
  36:      1.90 /     1000 =       0.0019
  40:      1.17 /     1000 =       0.0012
  41:      0.75 /     1000 =       0.0007
  42:      0.70 /     1000 =       0.0007

. bench_all, n_obs(10000)    n_levels(10)   n_rep(100)
Number of observations (_N) was 0, now 10,000.
10 / 100
20 / 100
30 / 100
40 / 100
50 / 100
60 / 100
70 / 100
80 / 100
90 / 100
100 / 100
  10:      0.39 /      100 =       0.0039
  11:      0.79 /      100 =       0.0079
  12:      0.56 /      100 =       0.0056
  13:      0.54 /      100 =       0.0054
  14:      1.90 /      100 =       0.0190
  15:      1.26 /      100 =       0.0126
  20:      0.38 /      100 =       0.0038
  21:      0.82 /      100 =       0.0082
  22:      0.85 /      100 =       0.0085
  23:      0.85 /      100 =       0.0085
  24:      1.67 /      100 =       0.0167
  25:      1.21 /      100 =       0.0121
  30:      1.56 /      100 =       0.0156
  31:      1.34 /      100 =       0.0134
  32:      1.37 /      100 =       0.0137
  33:      1.35 /      100 =       0.0135
  34:      1.35 /      100 =       0.0135
  35:      2.08 /      100 =       0.0208
  36:      1.61 /      100 =       0.0161
  40:      0.40 /      100 =       0.0040
  41:      0.80 /      100 =       0.0080
  42:      0.58 /      100 =       0.0058

. bench_all, n_obs(100000)   n_levels(10)   n_rep(10)
Number of observations (_N) was 0, now 100,000.
1 / 10
2 / 10
3 / 10
4 / 10
5 / 10
6 / 10
7 / 10
8 / 10
9 / 10
10 / 10
  10:      0.21 /       10 =       0.0212
  11:      0.54 /       10 =       0.0540
  12:      0.45 /       10 =       0.0454
  13:      0.51 /       10 =       0.0513
  14:      1.82 /       10 =       0.1824
  15:      1.06 /       10 =       0.1061
  20:      0.21 /       10 =       0.0215
  21:      1.35 /       10 =       0.1353
  22:      1.32 /       10 =       0.1319
  23:      1.29 /       10 =       0.1293
  24:      1.54 /       10 =       0.1541
  25:      1.14 /       10 =       0.1136
  30:      2.43 /       10 =       0.2433
  31:      2.02 /       10 =       0.2016
  32:      1.98 /       10 =       0.1985
  33:      2.01 /       10 =       0.2011
  34:      2.01 /       10 =       0.2010
  35:      1.96 /       10 =       0.1961
  36:      1.51 /       10 =       0.1510
  40:      0.22 /       10 =       0.0220
  41:      0.53 /       10 =       0.0526
  42:      0.46 /       10 =       0.0465

. bench_all, n_obs(1000000)  n_levels(10)   n_rep(1)
Number of observations (_N) was 0, now 1,000,000.
1 / 1
  10:      0.17 /        1 =       0.1650
  11:      0.42 /        1 =       0.4190
  12:      0.45 /        1 =       0.4510
  13:      0.42 /        1 =       0.4190
  14:      1.80 /        1 =       1.8040
  15:      1.10 /        1 =       1.1000
  20:      0.14 /        1 =       0.1410
  21:      2.22 /        1 =       2.2220
  22:      2.21 /        1 =       2.2080
  23:      2.22 /        1 =       2.2200
  24:      1.51 /        1 =       1.5150
  25:      0.99 /        1 =       0.9890
  30:      4.12 /        1 =       4.1230
  31:      3.06 /        1 =       3.0590
  32:      3.18 /        1 =       3.1820
  33:      3.13 /        1 =       3.1330
  34:      3.19 /        1 =       3.1950
  35:      2.09 /        1 =       2.0870
  36:      1.51 /        1 =       1.5120
  40:      0.14 /        1 =       0.1400
  41:      0.44 /        1 =       0.4440
  42:      0.39 /        1 =       0.3930

. bench_all, n_obs(10000000) n_levels(10)   n_rep(1)
Number of observations (_N) was 0, now 10,000,000.
1 / 1
  10:      1.37 /        1 =       1.3680
  11:      4.42 /        1 =       4.4170
  12:      4.20 /        1 =       4.1960
  13:      3.93 /        1 =       3.9260
  14:     16.93 /        1 =      16.9260
  15:     10.31 /        1 =      10.3130
  20:      1.42 /        1 =       1.4170
  21:     47.50 /        1 =      47.5000
  22:     48.25 /        1 =      48.2520
  23:     45.11 /        1 =      45.1140
  24:     22.64 /        1 =      22.6420
  25:     16.45 /        1 =      16.4450
  30:     71.05 /        1 =      71.0530
  31:     47.03 /        1 =      47.0270
  32:     55.09 /        1 =      55.0880
  33:     57.09 /        1 =      57.0860
  34:     55.91 /        1 =      55.9150
  35:     23.89 /        1 =      23.8930
  36:     14.89 /        1 =      14.8940
  40:      1.30 /        1 =       1.3030
  41:      3.76 /        1 =       3.7620
  42:      4.02 /        1 =       4.0190

. 
. bench_all, n_obs(1000)     n_levels(100)  n_rep(1000)
Number of observations (_N) was 0, now 1,000.
100 / 1000
200 / 1000
300 / 1000
400 / 1000
500 / 1000
600 / 1000
700 / 1000
800 / 1000
900 / 1000
1000 / 1000
  10:      1.05 /     1000 =       0.0011
  11:      0.71 /     1000 =       0.0007
  12:      0.60 /     1000 =       0.0006
  13:      0.58 /     1000 =       0.0006
  14:      2.69 /     1000 =       0.0027
  15:      1.64 /     1000 =       0.0016
  20:      2.66 /     1000 =       0.0027
  21:      0.75 /     1000 =       0.0008
  22:      0.74 /     1000 =       0.0007
  23:      0.69 /     1000 =       0.0007
  24:      2.58 /     1000 =       0.0026
  25:      1.65 /     1000 =       0.0017
  30:      1.61 /     1000 =       0.0016
  31:      1.20 /     1000 =       0.0012
  32:      1.20 /     1000 =       0.0012
  33:      1.18 /     1000 =       0.0012
  34:      1.23 /     1000 =       0.0012
  35:      3.11 /     1000 =       0.0031
  36:      2.22 /     1000 =       0.0022
  40:      1.09 /     1000 =       0.0011
  41:      0.72 /     1000 =       0.0007
  42:      0.59 /     1000 =       0.0006

. bench_all, n_obs(10000)    n_levels(100)  n_rep(100)
Number of observations (_N) was 0, now 10,000.
10 / 100
20 / 100
30 / 100
40 / 100
50 / 100
60 / 100
70 / 100
80 / 100
90 / 100
100 / 100
  10:      0.77 /      100 =       0.0077
  11:      0.95 /      100 =       0.0095
  12:      0.57 /      100 =       0.0057
  13:      0.54 /      100 =       0.0054
  14:      2.53 /      100 =       0.0253
  15:      1.40 /      100 =       0.0140
  20:      1.48 /      100 =       0.0148
  21:      1.00 /      100 =       0.0100
  22:      1.04 /      100 =       0.0104
  23:      1.02 /      100 =       0.0102
  24:      2.48 /      100 =       0.0248
  25:      1.39 /      100 =       0.0139
  30:      1.92 /      100 =       0.0192
  31:      1.65 /      100 =       0.0165
  32:      1.68 /      100 =       0.0168
  33:      1.63 /      100 =       0.0163
  34:      1.62 /      100 =       0.0162
  35:      2.78 /      100 =       0.0278
  36:      1.87 /      100 =       0.0187
  40:      0.79 /      100 =       0.0079
  41:      1.01 /      100 =       0.0101
  42:      0.59 /      100 =       0.0059

. bench_all, n_obs(100000)   n_levels(100)  n_rep(10)
Number of observations (_N) was 0, now 100,000.
1 / 10
2 / 10
3 / 10
4 / 10
5 / 10
6 / 10
7 / 10
8 / 10
9 / 10
10 / 10
  10:      0.69 /       10 =       0.0691
  11:      0.62 /       10 =       0.0616
  12:      0.57 /       10 =       0.0573
  13:      0.62 /       10 =       0.0616
  14:      2.57 /       10 =       0.2570
  15:      1.37 /       10 =       0.1372
  20:      2.36 /       10 =       0.2358
  21:      1.70 /       10 =       0.1701
  22:      1.67 /       10 =       0.1674
  23:      1.65 /       10 =       0.1654
  24:      2.54 /       10 =       0.2544
  25:      1.39 /       10 =       0.1388
  30:      3.27 /       10 =       0.3273
  31:      2.50 /       10 =       0.2503
  32:      2.50 /       10 =       0.2497
  33:      2.51 /       10 =       0.2507
  34:      2.55 /       10 =       0.2549
  35:      3.04 /       10 =       0.3039
  36:      1.75 /       10 =       0.1752
  40:      0.59 /       10 =       0.0594
  41:      0.62 /       10 =       0.0619
  42:      0.58 /       10 =       0.0580

. bench_all, n_obs(1000000)  n_levels(100)  n_rep(1)
Number of observations (_N) was 0, now 1,000,000.
1 / 1
  10:      0.56 /        1 =       0.5590
  11:      0.58 /        1 =       0.5830
  12:      0.49 /        1 =       0.4870
  13:      0.50 /        1 =       0.4980
  14:      2.42 /        1 =       2.4150
  15:      1.40 /        1 =       1.3960
  20:      4.02 /        1 =       4.0170
  21:      2.63 /        1 =       2.6350
  22:      3.00 /        1 =       3.0040
  23:      2.89 /        1 =       2.8880
  24:      2.44 /        1 =       2.4360
  25:      1.37 /        1 =       1.3720
  30:      5.55 /        1 =       5.5500
  31:      3.98 /        1 =       3.9750
  32:      3.92 /        1 =       3.9230
  33:      3.89 /        1 =       3.8880
  34:      3.60 /        1 =       3.5950
  35:      2.31 /        1 =       2.3090
  36:      1.31 /        1 =       1.3100
  40:      0.46 /        1 =       0.4580
  41:      0.40 /        1 =       0.4000
  42:      0.40 /        1 =       0.4000

. bench_all, n_obs(10000000) n_levels(100)  n_rep(1)
Number of observations (_N) was 0, now 10,000,000.
1 / 1
  10:      5.97 /        1 =       5.9680
  11:      5.88 /        1 =       5.8750
  12:      5.87 /        1 =       5.8650
  13:      5.91 /        1 =       5.9110
  14:     30.91 /        1 =      30.9080
  15:     16.55 /        1 =      16.5540
  20:     77.79 /        1 =      77.7940
  21:     48.29 /        1 =      48.2910
  22:     48.09 /        1 =      48.0860
  23:     46.68 /        1 =      46.6830
  24:     27.39 /        1 =      27.3850
  25:     15.44 /        1 =      15.4370
  30:     72.73 /        1 =      72.7320
  31:     50.22 /        1 =      50.2200
  32:     46.02 /        1 =      46.0240
  33:     48.40 /        1 =      48.3990
  34:     46.20 /        1 =      46.2050
  35:     21.72 /        1 =      21.7230
  36:     13.12 /        1 =      13.1180
  40:      3.92 /        1 =       3.9160
  41:      3.72 /        1 =       3.7190
  42:      3.66 /        1 =       3.6630

. 
. bench_all, n_obs(1000)     n_levels(1000) n_rep(1000)
Number of observations (_N) was 0, now 1,000.
100 / 1000
200 / 1000
300 / 1000
400 / 1000
500 / 1000
600 / 1000
700 / 1000
800 / 1000
900 / 1000
1000 / 1000
  10:      2.30 /     1000 =       0.0023
  11:      0.63 /     1000 =       0.0006
  12:      0.46 /     1000 =       0.0005
  13:      0.44 /     1000 =       0.0004
  14:     16.19 /     1000 =       0.0162
  15:      4.34 /     1000 =       0.0043
  20:     52.83 /     1000 =       0.0528
  21:      0.79 /     1000 =       0.0008
  22:      0.69 /     1000 =       0.0007
  23:      0.64 /     1000 =       0.0006
  24:     16.05 /     1000 =       0.0160
  25:      4.41 /     1000 =       0.0044
  30:      2.30 /     1000 =       0.0023
  31:      1.05 /     1000 =       0.0011
  32:      1.01 /     1000 =       0.0010
  33:      1.10 /     1000 =       0.0011
  34:      1.11 /     1000 =       0.0011
  35:     18.67 /     1000 =       0.0187
  36:      5.55 /     1000 =       0.0055
  40:      2.43 /     1000 =       0.0024
  41:      0.65 /     1000 =       0.0006
  42:      0.47 /     1000 =       0.0005

. bench_all, n_obs(10000)    n_levels(1000) n_rep(100)
Number of observations (_N) was 0, now 10,000.
10 / 100
20 / 100
30 / 100
40 / 100
50 / 100
60 / 100
70 / 100
80 / 100
90 / 100
100 / 100
  10:      0.54 /      100 =       0.0054
  11:      0.62 /      100 =       0.0062
  12:      0.29 /      100 =       0.0029
  13:      0.28 /      100 =       0.0028
  14:      2.76 /      100 =       0.0276
  15:      1.06 /      100 =       0.0106
  20:      5.28 /      100 =       0.0528
  21:      0.70 /      100 =       0.0070
  22:      0.65 /      100 =       0.0065
  23:      0.65 /      100 =       0.0065
  24:      2.70 /      100 =       0.0270
  25:      1.06 /      100 =       0.0106
  30:      1.19 /      100 =       0.0119
  31:      1.07 /      100 =       0.0107
  32:      1.05 /      100 =       0.0105
  33:      1.03 /      100 =       0.0103
  34:      1.03 /      100 =       0.0103
  35:      3.22 /      100 =       0.0322
  36:      1.46 /      100 =       0.0146
  40:      0.57 /      100 =       0.0057
  41:      0.62 /      100 =       0.0062
  42:      0.28 /      100 =       0.0028

. bench_all, n_obs(100000)   n_levels(1000) n_rep(10)
Number of observations (_N) was 0, now 100,000.
1 / 10
2 / 10
3 / 10
4 / 10
5 / 10
6 / 10
7 / 10
8 / 10
9 / 10
10 / 10
  10:      0.53 /       10 =       0.0529
  11:      0.42 /       10 =       0.0425
  12:      0.38 /       10 =       0.0380
  13:      0.35 /       10 =       0.0351
  14:      1.85 /       10 =       0.1851
  15:      0.91 /       10 =       0.0906
  20:      1.78 /       10 =       0.1783
  21:      1.11 /       10 =       0.1107
  22:      1.07 /       10 =       0.1074
  23:      1.05 /       10 =       0.1052
  24:      1.76 /       10 =       0.1758
  25:      0.90 /       10 =       0.0904
  30:      2.03 /       10 =       0.2033
  31:      1.80 /       10 =       0.1803
  32:      1.77 /       10 =       0.1765
  33:      1.72 /       10 =       0.1723
  34:      1.76 /       10 =       0.1759
  35:      2.27 /       10 =       0.2271
  36:      1.30 /       10 =       0.1298
  40:      0.42 /       10 =       0.0422
  41:      0.43 /       10 =       0.0429
  42:      0.44 /       10 =       0.0440

. bench_all, n_obs(1000000)  n_levels(1000) n_rep(1)
Number of observations (_N) was 0, now 1,000,000.
1 / 1
  10:      0.26 /        1 =       0.2610
  11:      0.25 /        1 =       0.2460
  12:      0.26 /        1 =       0.2580
  13:      0.23 /        1 =       0.2340
  14:      1.52 /        1 =       1.5170
  15:      0.75 /        1 =       0.7490
  20:      2.43 /        1 =       2.4310
  21:      1.67 /        1 =       1.6700
  22:      1.63 /        1 =       1.6320
  23:      1.60 /        1 =       1.6010
  24:      1.51 /        1 =       1.5140
  25:      0.78 /        1 =       0.7790
  30:      3.12 /        1 =       3.1230
  31:      2.44 /        1 =       2.4390
  32:      2.44 /        1 =       2.4390
  33:      2.45 /        1 =       2.4510
  34:      2.46 /        1 =       2.4580
  35:      1.76 /        1 =       1.7620
  36:      1.07 /        1 =       1.0730
  40:      0.28 /        1 =       0.2780
  41:      0.33 /        1 =       0.3310
  42:      0.31 /        1 =       0.3100

. bench_all, n_obs(10000000) n_levels(1000) n_rep(1)
Number of observations (_N) was 0, now 10,000,000.
1 / 1
  10:      2.69 /        1 =       2.6900
  11:      3.00 /        1 =       3.0030
  12:      2.61 /        1 =       2.6060
  13:      2.77 /        1 =       2.7690
  14:     14.23 /        1 =      14.2290
  15:      7.42 /        1 =       7.4210
  20:     37.72 /        1 =      37.7190
  21:     26.76 /        1 =      26.7640
  22:     26.55 /        1 =      26.5480
  23:     25.87 /        1 =      25.8670
  24:     15.13 /        1 =      15.1300
  25:      7.76 /        1 =       7.7570
  30:     49.82 /        1 =      49.8240
  31:     43.80 /        1 =      43.8000
  32:     39.11 /        1 =      39.1060
  33:     40.12 /        1 =      40.1160
  34:     40.34 /        1 =      40.3370
  35:     27.65 /        1 =      27.6520
  36:     16.51 /        1 =      16.5060
  40:      4.64 /        1 =       4.6440
  41:      4.52 /        1 =       4.5160
  42:      4.14 /        1 =       4.1450

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Mael\Desktop\Projects\stata_match\dev/logs/bench_levelsof.log
  log type:  text
 closed on:  19 Sep 2024, 11:41:48
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
