----------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:   9 Mar 2025, 15:11:57

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. bench_obs_integer, obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.751     1000    0.000    0.001    0.001    0.002    0.000    27.17   248.68        .
  base                     0.302     1000    0.000    0.000    0.000    0.001    0.000    10.93   100.00        .
  init                     0.496     1000    0.000    0.000    0.000    0.003    0.001    17.95   164.24        .
  parse                    0.518     1000    0.000    0.001    0.001    0.001    0.000    18.74   171.52        .
  check                    1.379     1000    0.001    0.001    0.001    0.005    0.001    49.89   456.62        .
  - usefulness             0.699     1000    0.000    0.001    0.001    0.002    0.000    25.29   231.46        .
    - is_useful() 1        0.610     1000    0.000    0.001    0.001    0.002    0.000    22.07   201.99        .
  - combine                0.060     1000    0.000    0.000    0.000    0.001    0.000     2.17    19.87        .
  - exhaustiveness         0.570     1000    0.000    0.001    0.001    0.004    0.001    20.62   188.74        .
    - is_useful() 2        0.543     1000    0.000    0.001    0.001    0.004    0.001    19.65   179.80        .
  - compress               0.001     1000    0.000    0.000    0.000    0.001    0.000     0.04     0.33        .
  - print                  0.019     1000    0.000    0.000    0.000    0.001    0.000     0.69     6.29        .
  + Overlap()              0.517     1000    0.000    0.001    0.000    0.004    0.001    18.70   171.19        .
  + Difference()           0.317     1000    0.000    0.000    0.000    0.001    0.000    11.47   104.97        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.348     1000    0.000    0.000    0.000    0.002    0.000    12.59   115.23        .
  total                    2.764     1000    0.002    0.003    0.003    0.006    0.000   100.00   915.23    0.002
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.086     1000    0.001    0.002    0.002    0.004    0.000    37.28    78.51        .
  base                     2.657     1000    0.002    0.003    0.003    0.008    0.001    47.49   100.00        .
  init                     0.844     1000    0.000    0.001    0.001    0.002    0.000    15.08    31.77        .
  parse                    0.559     1000    0.000    0.001    0.001    0.001    0.000     9.99    21.04        .
  check                    1.375     1000    0.001    0.001    0.001    0.002    0.000    24.58    51.75        .
  - usefulness             0.725     1000    0.000    0.001    0.001    0.001    0.000    12.96    27.29        .
    - is_useful() 1        0.631     1000    0.000    0.001    0.001    0.001    0.000    11.28    23.75        .
  - combine                0.040     1000    0.000    0.000    0.000    0.001    0.000     0.71     1.51        .
  - exhaustiveness         0.561     1000    0.000    0.001    0.001    0.001    0.000    10.03    21.11        .
    - is_useful() 2        0.530     1000    0.000    0.001    0.001    0.001    0.000     9.47    19.95        .
  - compress               0.007     1000    0.000    0.000    0.000    0.001    0.000     0.13     0.26        .
  - print                  0.011     1000    0.000    0.000    0.000    0.001    0.000     0.20     0.41        .
  + Overlap()              0.511     1000    0.000    0.001    0.000    0.002    0.001     9.13    19.23        .
  + Difference()           0.333     1000    0.000    0.000    0.000    0.001    0.000     5.95    12.53        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.801     1000    0.002    0.003    0.003    0.004    0.000    50.06   105.42        .
  total                    5.595     1000    0.005    0.006    0.006    0.008    0.001   100.00   210.58    0.003
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.360      100    0.012    0.014    0.014    0.016    0.001    36.22    45.53        .
  base                     2.987      100    0.029    0.030    0.030    0.035    0.001    79.55   100.00        .
  init                     0.546      100    0.005    0.005    0.005    0.007    0.001    14.54    18.28        .
  parse                    0.057      100    0.000    0.001    0.001    0.001    0.000     1.52     1.91        .
  check                    0.144      100    0.001    0.001    0.001    0.002    0.000     3.83     4.82        .
  - usefulness             0.069      100    0.000    0.001    0.001    0.001    0.000     1.84     2.31        .
    - is_useful() 1        0.061      100    0.000    0.001    0.001    0.001    0.000     1.62     2.04        .
  - combine                0.005      100    0.000    0.000    0.000    0.001    0.000     0.13     0.17        .
  - exhaustiveness         0.063      100    0.000    0.001    0.001    0.001    0.000     1.68     2.11        .
    - is_useful() 2        0.060      100    0.000    0.001    0.001    0.001    0.000     1.60     2.01        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.03     0.03        .
  - print                  0.001      100    0.000    0.000    0.000    0.001    0.000     0.03     0.03        .
  + Overlap()              0.053      100    0.000    0.001    0.000    0.002    0.001     1.41     1.77        .
  + Difference()           0.035      100    0.000    0.000    0.000    0.001    0.000     0.93     1.17        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.008      100    0.029    0.030    0.030    0.033    0.001    80.11   100.70        .
  total                    3.755      100    0.036    0.038    0.038    0.041    0.001   100.00   125.71    0.008
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.872       10    0.177    0.187    0.188    0.197    0.007    61.74    72.45        .
  base                     2.584       10    0.256    0.258    0.257    0.264    0.003    85.22   100.00        .
  init                     0.457       10    0.045    0.046    0.046    0.047    0.001    15.07    17.69        .
  parse                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.26     0.31        .
  check                    0.012       10    0.001    0.001    0.001    0.002    0.000     0.40     0.46        .
  - usefulness             0.009       10    0.000    0.001    0.001    0.001    0.000     0.30     0.35        .
    - is_useful() 1        0.008       10    0.000    0.001    0.001    0.001    0.000     0.26     0.31        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.003       10    0.000    0.000    0.000    0.001    0.000     0.10     0.12        .
    - is_useful() 2        0.003       10    0.000    0.000    0.000    0.001    0.000     0.10     0.12        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.006       10    0.000    0.001    0.000    0.002    0.001     0.20     0.23        .
  + Difference()           0.005       10    0.000    0.001    0.000    0.001    0.001     0.16     0.19        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.555       10    0.251    0.256    0.257    0.259    0.003    84.27    98.88        .
  total                    3.032       10    0.298    0.303    0.304    0.307    0.003   100.00   117.34    0.045
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.076        1    3.076    3.076    3.076    3.076        .   101.42   121.05        .
  base                     2.541        1    2.541    2.541    2.541    2.541        .    83.78   100.00        .
  init                     0.450        1    0.450    0.450    0.450    0.450        .    14.84    17.71        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
    - is_useful() 1        0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
    - is_useful() 2        0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.582        1    2.582    2.582    2.582    2.582        .    85.13   101.61        .
  total                    3.033        1    3.033    3.033    3.033    3.033        .   100.00   119.36    0.492
-------------------------------------------------------------------------------------------------------------------

. 
. bench_obs_float,   obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.779     1000    0.000    0.001    0.001    0.002    0.000    25.74   263.18        .
  base                     0.296     1000    0.000    0.000    0.000    0.001    0.000     9.78   100.00        .
  init                     0.753     1000    0.000    0.001    0.001    0.005    0.000    24.88   254.39        .
  parse                    0.515     1000    0.000    0.001    0.001    0.002    0.001    17.02   173.99        .
  check                    1.379     1000    0.001    0.001    0.001    0.002    0.000    45.57   465.88        .
  - usefulness             0.713     1000    0.000    0.001    0.001    0.002    0.000    23.56   240.88        .
    - is_useful() 1        0.628     1000    0.000    0.001    0.001    0.001    0.000    20.75   212.16        .
  - combine                0.047     1000    0.000    0.000    0.000    0.001    0.000     1.55    15.88        .
  - exhaustiveness         0.555     1000    0.000    0.001    0.001    0.001    0.000    18.34   187.50        .
    - is_useful() 2        0.533     1000    0.000    0.001    0.001    0.001    0.000    17.61   180.07        .
  - compress               0.002     1000    0.000    0.000    0.000    0.001    0.000     0.07     0.68        .
  - print                  0.016     1000    0.000    0.000    0.000    0.001    0.000     0.53     5.41        .
  + Overlap()              0.495     1000    0.000    0.000    0.000    0.002    0.001    16.36   167.23        .
  + Difference()           0.326     1000    0.000    0.000    0.000    0.001    0.000    10.77   110.14        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.352     1000    0.000    0.000    0.000    0.001    0.000    11.63   118.92        .
  total                    3.026     1000    0.002    0.003    0.003    0.007    0.000   100.00  1022.30    0.003
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.096     1000    0.001    0.002    0.002    0.004    0.000    24.86    75.89        .
  base                     2.762     1000    0.002    0.003    0.003    0.005    0.000    32.76   100.00        .
  init                     3.494     1000    0.003    0.003    0.003    0.005    0.001    41.45   126.50        .
  parse                    0.566     1000    0.000    0.001    0.001    0.002    0.000     6.71    20.49        .
  check                    1.374     1000    0.001    0.001    0.001    0.003    0.000    16.30    49.75        .
  - usefulness             0.709     1000    0.000    0.001    0.001    0.002    0.000     8.41    25.67        .
    - is_useful() 1        0.617     1000    0.000    0.001    0.001    0.001    0.000     7.32    22.34        .
  - combine                0.054     1000    0.000    0.000    0.000    0.001    0.000     0.64     1.96        .
  - exhaustiveness         0.554     1000    0.000    0.001    0.001    0.001    0.000     6.57    20.06        .
    - is_useful() 2        0.520     1000    0.000    0.001    0.001    0.001    0.000     6.17    18.83        .
  - compress               0.007     1000    0.000    0.000    0.000    0.001    0.000     0.08     0.25        .
  - print                  0.017     1000    0.000    0.000    0.000    0.001    0.000     0.20     0.62        .
  + Overlap()              0.525     1000    0.000    0.001    0.000    0.002    0.001     6.23    19.01        .
  + Difference()           0.303     1000    0.000    0.000    0.000    0.002    0.000     3.59    10.97        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.972     1000    0.002    0.003    0.003    0.005    0.000    35.26   107.60        .
  total                    8.430     1000    0.008    0.008    0.008    0.011    0.001   100.00   305.21    0.006
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.580      100    0.015    0.016    0.016    0.019    0.001    12.58    26.38        .
  base                     5.990      100    0.057    0.060    0.060    0.067    0.001    47.70   100.00        .
  init                     6.311      100    0.059    0.063    0.063    0.070    0.002    50.26   105.36        .
  parse                    0.060      100    0.000    0.001    0.001    0.001    0.000     0.48     1.00        .
  check                    0.137      100    0.001    0.001    0.001    0.004    0.001     1.09     2.29        .
  - usefulness             0.069      100    0.000    0.001    0.001    0.003    0.001     0.55     1.15        .
    - is_useful() 1        0.059      100    0.000    0.001    0.001    0.003    0.001     0.47     0.98        .
  - combine                0.005      100    0.000    0.000    0.000    0.001    0.000     0.04     0.08        .
  - exhaustiveness         0.061      100    0.000    0.001    0.001    0.001    0.000     0.49     1.02        .
    - is_useful() 2        0.055      100    0.000    0.001    0.001    0.001    0.000     0.44     0.92        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.02        .
  + Overlap()              0.057      100    0.000    0.001    0.000    0.002    0.001     0.45     0.95        .
  + Difference()           0.023      100    0.000    0.000    0.000    0.002    0.000     0.18     0.38        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     6.048      100    0.058    0.060    0.060    0.064    0.001    48.16   100.97        .
  total                   12.557      100    0.121    0.126    0.125    0.133    0.002   100.00   209.63    0.066
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.899       10    0.184    0.190    0.187    0.200    0.006    29.94    70.88        .
  base                     2.679       10    0.262    0.268    0.268    0.272    0.003    42.24   100.00        .
  init                     3.657       10    0.359    0.366    0.366    0.371    0.004    57.65   136.51        .
  parse                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.13     0.30        .
  check                    0.014       10    0.001    0.001    0.001    0.002    0.001     0.22     0.52        .
  - usefulness             0.007       10    0.000    0.001    0.001    0.001    0.000     0.11     0.26        .
    - is_useful() 1        0.007       10    0.000    0.001    0.001    0.001    0.000     0.11     0.26        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.004       10    0.000    0.000    0.000    0.001    0.001     0.06     0.15        .
    - is_useful() 2        0.004       10    0.000    0.000    0.000    0.001    0.001     0.06     0.15        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.002       10    0.000    0.000    0.000    0.001    0.000     0.03     0.07        .
  + Overlap()              0.006       10    0.000    0.001    0.001    0.001    0.001     0.09     0.22        .
  + Difference()           0.002       10    0.000    0.000    0.000    0.001    0.000     0.03     0.07        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.664       10    0.256    0.266    0.265    0.280    0.006    42.00    99.44        .
  total                    6.343       10    0.618    0.634    0.634    0.648    0.008   100.00   236.77    0.366
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.041        1    3.041    3.041    3.041    3.041        .    47.93   115.15        .
  base                     2.641        1    2.641    2.641    2.641    2.641        .    41.62   100.00        .
  init                     3.706        1    3.706    3.706    3.706    3.706        .    58.41   140.33        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.08        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
    - is_useful() 1        0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
    - is_useful() 2        0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.637        1    2.637    2.637    2.637    2.637        .    41.56    99.85        .
  total                    6.345        1    6.345    6.345    6.345    6.345        .   100.00   240.25    3.704
-------------------------------------------------------------------------------------------------------------------

. 
. bench_obs_string,  obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.165     1000    0.000    0.001    0.001    0.003    0.000    62.67   629.73        .
  base                     0.185     1000    0.000    0.000    0.000    0.001    0.000     9.95   100.00        .
  init                     0.507     1000    0.000    0.001    0.001    0.002    0.001    27.27   274.05        .
  parse                    0.372     1000    0.000    0.000    0.000    0.002    0.000    20.01   201.08        .
  check                    0.721     1000    0.000    0.001    0.001    0.001    0.000    38.78   389.73        .
  - usefulness             0.248     1000    0.000    0.000    0.000    0.001    0.000    13.34   134.05        .
    - is_useful() 1        0.218     1000    0.000    0.000    0.000    0.001    0.000    11.73   117.84        .
  - combine                0.016     1000    0.000    0.000    0.000    0.001    0.000     0.86     8.65        .
  - exhaustiveness         0.404     1000    0.000    0.000    0.000    0.001    0.000    21.73   218.38        .
    - is_useful() 2        0.381     1000    0.000    0.000    0.000    0.001    0.000    20.49   205.95        .
  - compress               0.007     1000    0.000    0.000    0.000    0.001    0.000     0.38     3.78        .
  - print                  0.010     1000    0.000    0.000    0.000    0.001    0.000     0.54     5.41        .
  + Overlap()              0.220     1000    0.000    0.000    0.000    0.001    0.000    11.83   118.92        .
  + Difference()           0.215     1000    0.000    0.000    0.000    0.001    0.000    11.57   116.22        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.240     1000    0.000    0.000    0.000    0.001    0.000    12.91   129.73        .
  total                    1.859     1000    0.001    0.002    0.002    0.003    0.000   100.00  1004.86    0.002
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.973     1000    0.006    0.007    0.007    0.011    0.000    94.05   453.68        .
  base                     1.537     1000    0.001    0.002    0.002    0.003    0.001    20.73   100.00        .
  init                     4.691     1000    0.004    0.005    0.005    0.006    0.000    63.27   305.20        .
  parse                    0.378     1000    0.000    0.000    0.000    0.001    0.000     5.10    24.59        .
  check                    0.755     1000    0.000    0.001    0.001    0.001    0.000    10.18    49.12        .
  - usefulness             0.266     1000    0.000    0.000    0.000    0.001    0.000     3.59    17.31        .
    - is_useful() 1        0.226     1000    0.000    0.000    0.000    0.001    0.000     3.05    14.70        .
  - combine                0.017     1000    0.000    0.000    0.000    0.001    0.000     0.23     1.11        .
  - exhaustiveness         0.412     1000    0.000    0.000    0.000    0.001    0.000     5.56    26.81        .
    - is_useful() 2        0.400     1000    0.000    0.000    0.000    0.001    0.000     5.40    26.02        .
  - compress               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.08     0.39        .
  - print                  0.020     1000    0.000    0.000    0.000    0.001    0.000     0.27     1.30        .
  + Overlap()              0.245     1000    0.000    0.000    0.000    0.001    0.000     3.30    15.94        .
  + Difference()           0.228     1000    0.000    0.000    0.000    0.001    0.000     3.08    14.83        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.567     1000    0.001    0.002    0.002    0.003    0.000    21.14   101.95        .
  total                    7.414     1000    0.007    0.007    0.007    0.010    0.001   100.00   482.37    0.006
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.432      100    0.062    0.064    0.064    0.070    0.001    87.31   418.75        .
  base                     1.536      100    0.014    0.015    0.015    0.024    0.001    20.85   100.00        .
  init                     5.691      100    0.054    0.057    0.057    0.065    0.002    77.25   370.51        .
  parse                    0.031      100    0.000    0.000    0.000    0.001    0.000     0.42     2.02        .
  check                    0.085      100    0.000    0.001    0.001    0.001    0.000     1.15     5.53        .
  - usefulness             0.026      100    0.000    0.000    0.000    0.001    0.000     0.35     1.69        .
    - is_useful() 1        0.023      100    0.000    0.000    0.000    0.001    0.000     0.31     1.50        .
  - combine                0.002      100    0.000    0.000    0.000    0.001    0.000     0.03     0.13        .
  - exhaustiveness         0.050      100    0.000    0.001    0.000    0.001    0.001     0.68     3.26        .
    - is_useful() 2        0.049      100    0.000    0.000    0.000    0.001    0.001     0.67     3.19        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.07        .
  + Overlap()              0.029      100    0.000    0.000    0.000    0.001    0.000     0.39     1.89        .
  + Difference()           0.026      100    0.000    0.000    0.000    0.001    0.000     0.35     1.69        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.556      100    0.015    0.016    0.015    0.021    0.001    21.12   101.30        .
  total                    7.367      100    0.071    0.074    0.073    0.082    0.002   100.00   479.62    0.058
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.249       10    0.706    0.725    0.720    0.759    0.017   111.49   466.17        .
  base                     1.555       10    0.153    0.155    0.155    0.158    0.001    23.92   100.00        .
  init                     4.868       10    0.476    0.487    0.480    0.537    0.018    74.87   313.05        .
  parse                    0.004       10    0.000    0.000    0.000    0.001    0.001     0.06     0.26        .
  check                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.12     0.51        .
  - usefulness             0.003       10    0.000    0.000    0.000    0.001    0.000     0.05     0.19        .
    - is_useful() 1        0.003       10    0.000    0.000    0.000    0.001    0.000     0.05     0.19        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.005       10    0.000    0.001    0.000    0.001    0.001     0.08     0.32        .
    - is_useful() 2        0.004       10    0.000    0.000    0.000    0.001    0.001     0.06     0.26        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.06        .
  + Difference()           0.005       10    0.000    0.001    0.000    0.001    0.001     0.08     0.32        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.621       10    0.155    0.162    0.159    0.191    0.011    24.93   104.24        .
  total                    6.502       10    0.632    0.650    0.641    0.729    0.028   100.00   418.14    0.495
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.418        1    8.418    8.418    8.418    8.418        .   130.33   538.92        .
  base                     1.562        1    1.562    1.562    1.562    1.562        .    24.18   100.00        .
  init                     4.864        1    4.864    4.864    4.864    4.864        .    75.31   311.40        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
  check                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
  - usefulness             0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
    - is_useful() 1        0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
    - is_useful() 2        0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.593        1    1.593    1.593    1.593    1.593        .    24.66   101.98        .
  total                    6.459        1    6.459    6.459    6.459    6.459        .   100.00   413.51    4.897
-------------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. bench_obs_integer, obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.085      100    0.000    0.001    0.001    0.002    0.000     1.55    71.43        .
  base                     0.119      100    0.001    0.001    0.001    0.002    0.000     2.17   100.00        .
  init                     0.065      100    0.000    0.001    0.001    0.001    0.000     1.19    54.62        .
  parse                    0.217      100    0.002    0.002    0.002    0.003    0.000     3.96   182.35        .
  check                    5.040      100    0.049    0.050    0.050    0.054    0.001    91.99  4235.29        .
  - usefulness             2.426      100    0.023    0.024    0.024    0.026    0.001    44.28  2038.66        .
    - is_useful() 1        2.318      100    0.020    0.023    0.023    0.025    0.001    42.31  1947.90        .
  - combine                0.086      100    0.000    0.001    0.001    0.002    0.000     1.57    72.27        .
  - exhaustiveness         2.508      100    0.024    0.025    0.025    0.030    0.001    45.77  2107.56        .
    - is_useful() 2        2.499      100    0.024    0.025    0.025    0.030    0.001    45.61  2100.00        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.006      100    0.000    0.000    0.000    0.001    0.000     0.11     5.04        .
  + Overlap()              2.192      100    0.014    0.022    0.022    0.028    0.003    40.01  1842.02        .
  + Difference()           1.798      100    0.013    0.018    0.018    0.023    0.002    32.82  1510.92        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.150      100    0.001    0.002    0.001    0.002    0.001     2.74   126.05        .
  total                    5.479      100    0.053    0.055    0.055    0.058    0.001   100.00  4604.20    0.054
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.204      100    0.001    0.002    0.002    0.003    0.000     3.11    19.05        .
  base                     1.071      100    0.010    0.011    0.011    0.013    0.001    16.30   100.00        .
  init                     0.169      100    0.001    0.002    0.002    0.002    0.000     2.57    15.78        .
  parse                    0.221      100    0.002    0.002    0.002    0.003    0.000     3.36    20.63        .
  check                    5.050      100    0.050    0.050    0.050    0.052    0.001    76.88   471.52        .
  - usefulness             2.436      100    0.023    0.024    0.024    0.026    0.001    37.08   227.45        .
    - is_useful() 1        2.301      100    0.020    0.023    0.023    0.025    0.001    35.03   214.85        .
  - combine                0.085      100    0.000    0.001    0.001    0.002    0.000     1.29     7.94        .
  - exhaustiveness         2.514      100    0.024    0.025    0.025    0.027    0.000    38.27   234.73        .
    - is_useful() 2        2.504      100    0.024    0.025    0.025    0.027    0.000    38.12   233.80        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.004      100    0.000    0.000    0.000    0.001    0.000     0.06     0.37        .
  + Overlap()              2.185      100    0.016    0.022    0.021    0.030    0.003    33.26   204.01        .
  + Difference()           1.842      100    0.013    0.018    0.019    0.023    0.002    28.04   171.99        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.120      100    0.010    0.011    0.011    0.015    0.001    17.05   104.58        .
  total                    6.569      100    0.064    0.066    0.066    0.070    0.001   100.00   613.35    0.055
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.108       10    0.010    0.011    0.011    0.012    0.001     6.19     9.92        .
  base                     1.089       10    0.106    0.109    0.109    0.111    0.002    62.37   100.00        .
  init                     0.134       10    0.013    0.013    0.013    0.014    0.001     7.67    12.30        .
  parse                    0.023       10    0.002    0.002    0.002    0.003    0.000     1.32     2.11        .
  check                    0.509       10    0.050    0.051    0.051    0.052    0.001    29.15    46.74        .
  - usefulness             0.247       10    0.024    0.025    0.025    0.025    0.000    14.15    22.68        .
    - is_useful() 1        0.234       10    0.021    0.023    0.024    0.025    0.001    13.40    21.49        .
  - combine                0.008       10    0.000    0.001    0.001    0.001    0.000     0.46     0.73        .
  - exhaustiveness         0.253       10    0.025    0.025    0.025    0.026    0.000    14.49    23.23        .
    - is_useful() 2        0.251       10    0.025    0.025    0.025    0.026    0.000    14.38    23.05        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.221       10    0.017    0.022    0.021    0.028    0.003    12.66    20.29        .
  + Difference()           0.189       10    0.015    0.019    0.019    0.022    0.002    10.82    17.36        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.080       10    0.105    0.108    0.108    0.110    0.002    61.86    99.17        .
  total                    1.746       10    0.171    0.175    0.175    0.177    0.002   100.00   160.33    0.066
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.188        1    0.188    0.188    0.188    0.188        .    14.84    17.41        .
  base                     1.080        1    1.080    1.080    1.080    1.080        .    85.24   100.00        .
  init                     0.131        1    0.131    0.131    0.131    0.131        .    10.34    12.13        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.16     0.19        .
  check                    0.051        1    0.051    0.051    0.051    0.051        .     4.03     4.72        .
  - usefulness             0.024        1    0.024    0.024    0.024    0.024        .     1.89     2.22        .
    - is_useful() 1        0.023        1    0.023    0.023    0.023    0.023        .     1.82     2.13        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.08     0.09        .
  - exhaustiveness         0.025        1    0.025    0.025    0.025    0.025        .     1.97     2.31        .
    - is_useful() 2        0.025        1    0.025    0.025    0.025    0.025        .     1.97     2.31        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.020        1    0.020    0.020    0.020    0.020        .     1.58     1.85        .
  + Difference()           0.019        1    0.019    0.019    0.019    0.019        .     1.50     1.76        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.083        1    1.083    1.083    1.083    1.083        .    85.48   100.28        .
  total                    1.267        1    1.267    1.267    1.267    1.267        .   100.00   117.31    0.187
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.038        1    3.038    3.038    3.038    3.038        .    25.08    28.19        .
  base                    10.777        1   10.777   10.777   10.777   10.777        .    88.98   100.00        .
  init                     1.293        1    1.293    1.293    1.293    1.293        .    10.68    12.00        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check                    0.049        1    0.049    0.049    0.049    0.049        .     0.40     0.45        .
  - usefulness             0.024        1    0.024    0.024    0.024    0.024        .     0.20     0.22        .
    - is_useful() 1        0.022        1    0.022    0.022    0.022    0.022        .     0.18     0.20        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.024        1    0.024    0.024    0.024    0.024        .     0.20     0.22        .
    - is_useful() 2        0.024        1    0.024    0.024    0.024    0.024        .     0.20     0.22        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.018        1    0.018    0.018    0.018    0.018        .     0.15     0.17        .
  + Difference()           0.020        1    0.020    0.020    0.020    0.020        .     0.17     0.19        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.767        1   10.767   10.767   10.767   10.767        .    88.90    99.91        .
  total                   12.112        1   12.112   12.112   12.112   12.112        .   100.00   112.39    1.335
-------------------------------------------------------------------------------------------------------------------

. 
. bench_obs_float,   obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.088      100    0.000    0.001    0.001    0.003    0.000     1.59    73.33        .
  base                     0.120      100    0.001    0.001    0.001    0.002    0.000     2.17   100.00        .
  init                     0.087      100    0.000    0.001    0.001    0.001    0.000     1.57    72.50        .
  parse                    0.214      100    0.002    0.002    0.002    0.004    0.000     3.87   178.33        .
  check                    5.068      100    0.049    0.051    0.050    0.061    0.002    91.73  4223.33        .
  - usefulness             2.452      100    0.024    0.025    0.024    0.034    0.001    44.38  2043.33        .
    - is_useful() 1        2.331      100    0.020    0.023    0.023    0.034    0.002    42.19  1942.50        .
  - combine                0.083      100    0.000    0.001    0.001    0.001    0.000     1.50    69.17        .
  - exhaustiveness         2.515      100    0.024    0.025    0.025    0.029    0.001    45.52  2095.83        .
    - is_useful() 2        2.504      100    0.024    0.025    0.025    0.029    0.001    45.32  2086.67        .
  - compress               0.003      100    0.000    0.000    0.000    0.001    0.000     0.05     2.50        .
  - print                  0.005      100    0.000    0.000    0.000    0.001    0.000     0.09     4.17        .
  + Overlap()              2.219      100    0.014    0.022    0.022    0.033    0.003    40.16  1849.17        .
  + Difference()           1.837      100    0.013    0.018    0.018    0.025    0.002    33.25  1530.83        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.153      100    0.001    0.002    0.002    0.003    0.001     2.77   127.50        .
  total                    5.525      100    0.054    0.055    0.055    0.065    0.002   100.00  4604.17    0.054
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.232      100    0.002    0.002    0.002    0.005    0.001     3.37    20.59        .
  base                     1.127      100    0.010    0.011    0.011    0.013    0.001    16.39   100.00        .
  init                     0.354      100    0.003    0.004    0.004    0.004    0.001     5.15    31.41        .
  parse                    0.219      100    0.002    0.002    0.002    0.003    0.000     3.18    19.43        .
  check                    5.046      100    0.049    0.050    0.050    0.054    0.001    73.38   447.74        .
  - usefulness             2.432      100    0.024    0.024    0.024    0.026    0.000    35.36   215.79        .
    - is_useful() 1        2.322      100    0.019    0.023    0.023    0.025    0.001    33.76   206.03        .
  - combine                0.087      100    0.000    0.001    0.001    0.002    0.000     1.27     7.72        .
  - exhaustiveness         2.511      100    0.024    0.025    0.025    0.029    0.001    36.51   222.80        .
    - is_useful() 2        2.503      100    0.024    0.025    0.025    0.029    0.001    36.40   222.09        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.007      100    0.000    0.000    0.000    0.001    0.000     0.10     0.62        .
  + Overlap()              2.170      100    0.015    0.022    0.021    0.028    0.003    31.55   192.55        .
  + Difference()           1.879      100    0.014    0.019    0.019    0.026    0.002    27.32   166.73        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.255      100    0.011    0.013    0.013    0.014    0.001    18.25   111.36        .
  total                    6.877      100    0.067    0.069    0.069    0.074    0.001   100.00   610.20    0.058
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.157       10    0.015    0.016    0.016    0.017    0.001     4.08     5.65        .
  base                     2.781       10    0.274    0.278    0.277    0.290    0.004    72.22   100.00        .
  init                     0.581       10    0.055    0.058    0.057    0.061    0.002    15.09    20.89        .
  parse                    0.020       10    0.002    0.002    0.002    0.002    0.000     0.52     0.72        .
  check                    0.500       10    0.049    0.050    0.050    0.051    0.001    12.98    17.98        .
  - usefulness             0.244       10    0.024    0.024    0.024    0.026    0.001     6.34     8.77        .
    - is_useful() 1        0.233       10    0.021    0.023    0.023    0.026    0.002     6.05     8.38        .
  - combine                0.008       10    0.000    0.001    0.001    0.001    0.000     0.21     0.29        .
  - exhaustiveness         0.248       10    0.024    0.025    0.025    0.026    0.001     6.44     8.92        .
    - is_useful() 2        0.245       10    0.024    0.025    0.024    0.025    0.001     6.36     8.81        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.227       10    0.018    0.023    0.022    0.028    0.004     5.89     8.16        .
  + Difference()           0.187       10    0.016    0.019    0.018    0.022    0.002     4.86     6.72        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.749       10    0.271    0.275    0.275    0.282    0.003    71.38    98.85        .
  total                    3.851       10    0.380    0.385    0.384    0.394    0.004   100.00   138.48    0.107
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.210        1    0.210    0.210    0.210    0.210        .    13.82    18.67        .
  base                     1.125        1    1.125    1.125    1.125    1.125        .    74.06   100.00        .
  init                     0.323        1    0.323    0.323    0.323    0.323        .    21.26    28.71        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.13     0.18        .
  check                    0.051        1    0.051    0.051    0.051    0.051        .     3.36     4.53        .
  - usefulness             0.025        1    0.025    0.025    0.025    0.025        .     1.65     2.22        .
    - is_useful() 1        0.024        1    0.024    0.024    0.024    0.024        .     1.58     2.13        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.09        .
  - exhaustiveness         0.024        1    0.024    0.024    0.024    0.024        .     1.58     2.13        .
    - is_useful() 2        0.024        1    0.024    0.024    0.024    0.024        .     1.58     2.13        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.09        .
  + Overlap()              0.024        1    0.024    0.024    0.024    0.024        .     1.58     2.13        .
  + Difference()           0.017        1    0.017    0.017    0.017    0.017        .     1.12     1.51        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.143        1    1.143    1.143    1.143    1.143        .    75.25   101.60        .
  total                    1.519        1    1.519    1.519    1.519    1.519        .   100.00   135.02    0.394
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.078        1    3.078    3.078    3.078    3.078        .    21.46    27.99        .
  base                    10.997        1   10.997   10.997   10.997   10.997        .    76.66   100.00        .
  init                     3.282        1    3.282    3.282    3.282    3.282        .    22.88    29.84        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.02        .
  check                    0.051        1    0.051    0.051    0.051    0.051        .     0.36     0.46        .
  - usefulness             0.025        1    0.025    0.025    0.025    0.025        .     0.17     0.23        .
    - is_useful() 1        0.024        1    0.024    0.024    0.024    0.024        .     0.17     0.22        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.025        1    0.025    0.025    0.025    0.025        .     0.17     0.23        .
    - is_useful() 2        0.025        1    0.025    0.025    0.025    0.025        .     0.17     0.23        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.025        1    0.025    0.025    0.025    0.025        .     0.17     0.23        .
  + Difference()           0.020        1    0.020    0.020    0.020    0.020        .     0.14     0.18        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    11.010        1   11.010   11.010   11.010   11.010        .    76.75   100.12        .
  total                   14.346        1   14.346   14.346   14.346   14.346        .   100.00   130.45    3.349
-------------------------------------------------------------------------------------------------------------------

. 
. bench_obs_string,  obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.138      100    0.001    0.001    0.001    0.002    0.000     2.98   121.05        .
  base                     0.114      100    0.001    0.001    0.001    0.002    0.000     2.46   100.00        .
  init                     0.060      100    0.000    0.001    0.001    0.001    0.000     1.29    52.63        .
  parse                    0.141      100    0.001    0.001    0.001    0.002    0.000     3.04   123.68        .
  check                    4.289      100    0.041    0.043    0.043    0.047    0.001    92.54  3762.28        .
  - usefulness             1.597      100    0.015    0.016    0.016    0.020    0.001    34.46  1400.88        .
    - is_useful() 1        1.545      100    0.013    0.015    0.015    0.020    0.001    33.33  1355.26        .
  - combine                0.027      100    0.000    0.000    0.000    0.001    0.000     0.58    23.68        .
  - exhaustiveness         2.652      100    0.025    0.027    0.026    0.029    0.001    57.22  2326.32        .
    - is_useful() 2        2.642      100    0.025    0.026    0.026    0.028    0.001    57.00  2317.54        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.04     1.75        .
  - print                  0.003      100    0.000    0.000    0.000    0.001    0.000     0.06     2.63        .
  + Overlap()              1.904      100    0.015    0.019    0.019    0.025    0.002    41.08  1670.18        .
  + Difference()           1.828      100    0.013    0.018    0.018    0.023    0.002    39.44  1603.51        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.141      100    0.001    0.001    0.001    0.005    0.001     3.04   123.68        .
  total                    4.635      100    0.044    0.046    0.046    0.051    0.001   100.00  4065.79    0.045
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.731      100    0.007    0.007    0.007    0.008    0.000    12.12    73.10        .
  base                     1.000      100    0.009    0.010    0.010    0.013    0.001    16.58   100.00        .
  init                     0.531      100    0.005    0.005    0.005    0.008    0.001     8.81    53.10        .
  parse                    0.128      100    0.001    0.001    0.001    0.002    0.000     2.12    12.80        .
  check                    4.302      100    0.041    0.043    0.043    0.051    0.001    71.34   430.20        .
  - usefulness             1.596      100    0.015    0.016    0.016    0.019    0.001    26.47   159.60        .
    - is_useful() 1        1.544      100    0.013    0.015    0.016    0.018    0.001    25.61   154.40        .
  - combine                0.038      100    0.000    0.000    0.000    0.001    0.000     0.63     3.80        .
  - exhaustiveness         2.642      100    0.025    0.026    0.026    0.031    0.001    43.81   264.20        .
    - is_useful() 2        2.631      100    0.025    0.026    0.026    0.031    0.001    43.63   263.10        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.03     0.20        .
  - print                  0.012      100    0.000    0.000    0.000    0.001    0.000     0.20     1.20        .
  + Overlap()              1.872      100    0.013    0.019    0.019    0.024    0.002    31.04   187.20        .
  + Difference()           1.825      100    0.013    0.018    0.018    0.026    0.002    30.27   182.50        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.067      100    0.010    0.011    0.011    0.014    0.001    17.69   106.70        .
  total                    6.030      100    0.058    0.060    0.060    0.071    0.001   100.00   603.00    0.050
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.667       10    0.065    0.067    0.066    0.069    0.002    31.33    63.71        .
  base                     1.047       10    0.099    0.105    0.103    0.117    0.005    49.18   100.00        .
  init                     0.625       10    0.061    0.063    0.062    0.065    0.001    29.36    59.69        .
  parse                    0.012       10    0.001    0.001    0.001    0.002    0.000     0.56     1.15        .
  check                    0.430       10    0.042    0.043    0.043    0.044    0.001    20.20    41.07        .
  - usefulness             0.160       10    0.015    0.016    0.016    0.017    0.001     7.52    15.28        .
    - is_useful() 1        0.154       10    0.014    0.015    0.015    0.017    0.001     7.23    14.71        .
  - combine                0.005       10    0.000    0.001    0.000    0.001    0.001     0.23     0.48        .
  - exhaustiveness         0.264       10    0.026    0.026    0.026    0.027    0.001    12.40    25.21        .
    - is_useful() 2        0.264       10    0.026    0.026    0.026    0.027    0.001    12.40    25.21        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.191       10    0.016    0.019    0.019    0.022    0.002     8.97    18.24        .
  + Difference()           0.175       10    0.015    0.018    0.018    0.019    0.001     8.22    16.71        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.062       10    0.104    0.106    0.105    0.113    0.003    49.88   101.43        .
  total                    2.129       10    0.209    0.213    0.211    0.220    0.004   100.00   203.34    0.108
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.737        1    0.737    0.737    0.737    0.737        .    47.64    72.54        .
  base                     1.016        1    1.016    1.016    1.016    1.016        .    65.68   100.00        .
  init                     0.500        1    0.500    0.500    0.500    0.500        .    32.32    49.21        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.10        .
  check                    0.042        1    0.042    0.042    0.042    0.042        .     2.71     4.13        .
  - usefulness             0.016        1    0.016    0.016    0.016    0.016        .     1.03     1.57        .
    - is_useful() 1        0.014        1    0.014    0.014    0.014    0.014        .     0.90     1.38        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.026        1    0.026    0.026    0.026    0.026        .     1.68     2.56        .
    - is_useful() 2        0.026        1    0.026    0.026    0.026    0.026        .     1.68     2.56        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.018        1    0.018    0.018    0.018    0.018        .     1.16     1.77        .
  + Difference()           0.018        1    0.018    0.018    0.018    0.018        .     1.16     1.77        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.004        1    1.004    1.004    1.004    1.004        .    64.90    98.82        .
  total                    1.547        1    1.547    1.547    1.547    1.547        .   100.00   152.26    0.531
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.521        1    8.521    8.521    8.521    8.521        .    55.33    84.73        .
  base                    10.057        1   10.057   10.057   10.057   10.057        .    65.31   100.00        .
  init                     5.133        1    5.133    5.133    5.133    5.133        .    33.33    51.04        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  check                    0.043        1    0.043    0.043    0.043    0.043        .     0.28     0.43        .
  - usefulness             0.016        1    0.016    0.016    0.016    0.016        .     0.10     0.16        .
    - is_useful() 1        0.016        1    0.016    0.016    0.016    0.016        .     0.10     0.16        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.027        1    0.027    0.027    0.027    0.027        .     0.18     0.27        .
    - is_useful() 2        0.027        1    0.027    0.027    0.027    0.027        .     0.18     0.27        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.021        1    0.021    0.021    0.021    0.021        .     0.14     0.21        .
  + Difference()           0.017        1    0.017    0.017    0.017    0.017        .     0.11     0.17        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.223        1   10.223   10.223   10.223   10.223        .    66.38   101.65        .
  total                   15.400        1   15.400   15.400   15.400   15.400        .   100.00   153.13    5.343
-------------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. bench_obs_integer, obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.003        1    0.003    0.003    0.003    0.003        .     0.03    30.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.09   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.132        1    0.132    0.132    0.132    0.132        .     1.16  1320.00        .
  check                   11.209        1   11.209   11.209   11.209   11.209        .    98.73  1.1e+05        .
  - usefulness             8.753        1    8.753    8.753    8.753    8.753        .    77.10 87530.00        .
    - is_useful() 1        8.592        1    8.592    8.592    8.592    8.592        .    75.68 85920.00        .
  - combine                0.118        1    0.118    0.118    0.118    0.118        .     1.04  1180.00        .
  - exhaustiveness         2.336        1    2.336    2.336    2.336    2.336        .    20.58 23360.00        .
    - is_useful() 2        2.335        1    2.335    2.335    2.335    2.335        .    20.57 23350.00        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              5.306        1    5.306    5.306    5.306    5.306        .    46.74 53060.00        .
  + Difference()           1.734        1    1.734    1.734    1.734    1.734        .    15.27 17340.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.012        1    0.012    0.012    0.012    0.012        .     0.11   120.00        .
  total                   11.353        1   11.353   11.353   11.353   11.353        .   100.00  1.1e+05   11.343
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.01        .
  base                     0.099        1    0.099    0.099    0.099    0.099        .     0.87   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.02     2.02        .
  parse                    0.125        1    0.125    0.125    0.125    0.125        .     1.09   126.26        .
  check                   11.204        1   11.204   11.204   11.204   11.204        .    98.06 11317.17        .
  - usefulness             8.761        1    8.761    8.761    8.761    8.761        .    76.68  8849.49        .
    - is_useful() 1        8.594        1    8.594    8.594    8.594    8.594        .    75.21  8680.81        .
  - combine                0.116        1    0.116    0.116    0.116    0.116        .     1.02   117.17        .
  - exhaustiveness         2.325        1    2.325    2.325    2.325    2.325        .    20.35  2348.48        .
    - is_useful() 2        2.324        1    2.324    2.324    2.324    2.324        .    20.34  2347.47        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.01        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              5.291        1    5.291    5.291    5.291    5.291        .    46.31  5344.44        .
  + Difference()           1.788        1    1.788    1.788    1.788    1.788        .    15.65  1806.06        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.095        1    0.095    0.095    0.095    0.095        .     0.83    95.96        .
  total                   11.426        1   11.426   11.426   11.426   11.426        .   100.00 11541.41   11.327
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.017        1    0.017    0.017    0.017    0.017        .     0.14     1.80        .
  base                     0.942        1    0.942    0.942    0.942    0.942        .     7.74   100.00        .
  init                     0.013        1    0.013    0.013    0.013    0.013        .     0.11     1.38        .
  parse                    0.126        1    0.126    0.126    0.126    0.126        .     1.04    13.38        .
  check                   11.101        1   11.101   11.101   11.101   11.101        .    91.26  1178.45        .
  - usefulness             8.683        1    8.683    8.683    8.683    8.683        .    71.38   921.76        .
    - is_useful() 1        8.512        1    8.512    8.512    8.512    8.512        .    69.98   903.61        .
  - combine                0.116        1    0.116    0.116    0.116    0.116        .     0.95    12.31        .
  - exhaustiveness         2.299        1    2.299    2.299    2.299    2.299        .    18.90   244.06        .
    - is_useful() 2        2.299        1    2.299    2.299    2.299    2.299        .    18.90   244.06        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.11        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              5.146        1    5.146    5.146    5.146    5.146        .    42.31   546.28        .
  + Difference()           1.715        1    1.715    1.715    1.715    1.715        .    14.10   182.06        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.924        1    0.924    0.924    0.924    0.924        .     7.60    98.09        .
  total                   12.164        1   12.164   12.164   12.164   12.164        .   100.00  1291.30   11.222
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.185        1    0.185    0.185    0.185    0.185        .     0.90     1.95        .
  base                     9.464        1    9.464    9.464    9.464    9.464        .    46.02   100.00        .
  init                     0.125        1    0.125    0.125    0.125    0.125        .     0.61     1.32        .
  parse                    0.127        1    0.127    0.127    0.127    0.127        .     0.62     1.34        .
  check                   11.093        1   11.093   11.093   11.093   11.093        .    53.94   117.21        .
  - usefulness             8.655        1    8.655    8.655    8.655    8.655        .    42.09    91.45        .
    - is_useful() 1        8.468        1    8.468    8.468    8.468    8.468        .    41.18    89.48        .
  - combine                0.117        1    0.117    0.117    0.117    0.117        .     0.57     1.24        .
  - exhaustiveness         2.320        1    2.320    2.320    2.320    2.320        .    11.28    24.51        .
    - is_useful() 2        2.319        1    2.319    2.319    2.319    2.319        .    11.28    24.50        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()              5.155        1    5.155    5.155    5.155    5.155        .    25.07    54.47        .
  + Difference()           1.756        1    1.756    1.756    1.756    1.756        .     8.54    18.55        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     9.220        1    9.220    9.220    9.220    9.220        .    44.83    97.42        .
  total                   20.565        1   20.565   20.565   20.565   20.565        .   100.00   217.30   11.101
-------------------------------------------------------------------------------------------------------------------

. // bench_obs_integer, obs(10000000) levels(1000) rep(1)
. 
. bench_obs_float,   obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.011        1    0.011    0.011    0.011    0.011        .     0.10   122.22        .
  base                     0.009        1    0.009    0.009    0.009    0.009        .     0.08   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.131        1    0.131    0.131    0.131    0.131        .     1.16  1455.56        .
  check                   11.155        1   11.155   11.155   11.155   11.155        .    98.73  1.2e+05        .
  - usefulness             8.724        1    8.724    8.724    8.724    8.724        .    77.21 96933.33        .
    - is_useful() 1        8.572        1    8.572    8.572    8.572    8.572        .    75.87 95244.44        .
  - combine                0.114        1    0.114    0.114    0.114    0.114        .     1.01  1266.67        .
  - exhaustiveness         2.314        1    2.314    2.314    2.314    2.314        .    20.48 25711.11        .
    - is_useful() 2        2.313        1    2.313    2.313    2.313    2.313        .    20.47 25700.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              5.275        1    5.275    5.275    5.275    5.275        .    46.69 58611.11        .
  + Difference()           1.754        1    1.754    1.754    1.754    1.754        .    15.52 19488.89        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.12   144.44        .
  total                   11.299        1   11.299   11.299   11.299   11.299        .   100.00  1.3e+05   11.290
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.02     1.92        .
  base                     0.104        1    0.104    0.104    0.104    0.104        .     0.91   100.00        .
  init                     0.004        1    0.004    0.004    0.004    0.004        .     0.03     3.85        .
  parse                    0.126        1    0.126    0.126    0.126    0.126        .     1.10   121.15        .
  check                   11.241        1   11.241   11.241   11.241   11.241        .    97.94 10808.65        .
  - usefulness             8.803        1    8.803    8.803    8.803    8.803        .    76.69  8464.42        .
    - is_useful() 1        8.640        1    8.640    8.640    8.640    8.640        .    75.27  8307.69        .
  - combine                0.114        1    0.114    0.114    0.114    0.114        .     0.99   109.62        .
  - exhaustiveness         2.321        1    2.321    2.321    2.321    2.321        .    20.22  2231.73        .
    - is_useful() 2        2.321        1    2.321    2.321    2.321    2.321        .    20.22  2231.73        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              5.138        1    5.138    5.138    5.138    5.138        .    44.76  4940.38        .
  + Difference()           1.746        1    1.746    1.746    1.746    1.746        .    15.21  1678.85        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.107        1    0.107    0.107    0.107    0.107        .     0.93   102.88        .
  total                   11.478        1   11.478   11.478   11.478   11.478        .   100.00 11036.54   11.374
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.014        1    0.014    0.014    0.014    0.014        .     0.11     1.26        .
  base                     1.114        1    1.114    1.114    1.114    1.114        .     8.97   100.00        .
  init                     0.058        1    0.058    0.058    0.058    0.058        .     0.47     5.21        .
  parse                    0.125        1    0.125    0.125    0.125    0.125        .     1.01    11.22        .
  check                   11.148        1   11.148   11.148   11.148   11.148        .    89.78  1000.72        .
  - usefulness             8.723        1    8.723    8.723    8.723    8.723        .    70.25   783.03        .
    - is_useful() 1        8.554        1    8.554    8.554    8.554    8.554        .    68.89   767.86        .
  - combine                0.116        1    0.116    0.116    0.116    0.116        .     0.93    10.41        .
  - exhaustiveness         2.307        1    2.307    2.307    2.307    2.307        .    18.58   207.09        .
    - is_useful() 2        2.305        1    2.305    2.305    2.305    2.305        .    18.56   206.91        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              5.229        1    5.229    5.229    5.229    5.229        .    42.11   469.39        .
  + Difference()           1.732        1    1.732    1.732    1.732    1.732        .    13.95   155.48        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.086        1    1.086    1.086    1.086    1.086        .     8.75    97.49        .
  total                   12.417        1   12.417   12.417   12.417   12.417        .   100.00  1114.63   11.303
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.203        1    0.203    0.203    0.203    0.203        .     0.96     2.11        .
  base                     9.631        1    9.631    9.631    9.631    9.631        .    45.48   100.00        .
  init                     0.333        1    0.333    0.333    0.333    0.333        .     1.57     3.46        .
  parse                    0.126        1    0.126    0.126    0.126    0.126        .     0.59     1.31        .
  check                   11.174        1   11.174   11.174   11.174   11.174        .    52.76   116.02        .
  - usefulness             8.727        1    8.727    8.727    8.727    8.727        .    41.21    90.61        .
    - is_useful() 1        8.545        1    8.545    8.545    8.545    8.545        .    40.35    88.72        .
  - combine                0.116        1    0.116    0.116    0.116    0.116        .     0.55     1.20        .
  - exhaustiveness         2.329        1    2.329    2.329    2.329    2.329        .    11.00    24.18        .
    - is_useful() 2        2.328        1    2.328    2.328    2.328    2.328        .    10.99    24.17        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              5.152        1    5.152    5.152    5.152    5.152        .    24.33    53.49        .
  + Difference()           1.743        1    1.743    1.743    1.743    1.743        .     8.23    18.10        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     9.545        1    9.545    9.545    9.545    9.545        .    45.07    99.11        .
  total                   21.178        1   21.178   21.178   21.178   21.178        .   100.00   219.89   11.547
-------------------------------------------------------------------------------------------------------------------

. // bench_obs_float,   obs(10000000) levels(1000) rep(1)
. 
. bench_obs_string,  obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.04    20.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.19   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.02    10.00        .
  parse                    0.061        1    0.061    0.061    0.061    0.061        .     1.15   610.00        .
  check                    5.245        1    5.245    5.245    5.245    5.245        .    98.59 52450.00        .
  - usefulness             2.670        1    2.670    2.670    2.670    2.670        .    50.19 26700.00        .
    - is_useful() 1        2.599        1    2.599    2.599    2.599    2.599        .    48.85 25990.00        .
  - combine                0.047        1    0.047    0.047    0.047    0.047        .     0.88   470.00        .
  - exhaustiveness         2.527        1    2.527    2.527    2.527    2.527        .    47.50 25270.00        .
    - is_useful() 2        2.526        1    2.526    2.526    2.526    2.526        .    47.48 25260.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.02    10.00        .
  + Overlap()              2.377        1    2.377    2.377    2.377    2.377        .    44.68 23770.00        .
  + Difference()           1.736        1    1.736    1.736    1.736    1.736        .    32.63 17360.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.24   130.00        .
  total                    5.320        1    5.320    5.320    5.320    5.320        .   100.00 53200.00    5.310
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.008        1    0.008    0.008    0.008    0.008        .     0.15     7.84        .
  base                     0.102        1    0.102    0.102    0.102    0.102        .     1.95   100.00        .
  init                     0.006        1    0.006    0.006    0.006    0.006        .     0.11     5.88        .
  parse                    0.056        1    0.056    0.056    0.056    0.056        .     1.07    54.90        .
  check                    5.076        1    5.076    5.076    5.076    5.076        .    96.93  4976.47        .
  - usefulness             2.537        1    2.537    2.537    2.537    2.537        .    48.44  2487.25        .
    - is_useful() 1        2.471        1    2.471    2.471    2.471    2.471        .    47.18  2422.55        .
  - combine                0.047        1    0.047    0.047    0.047    0.047        .     0.90    46.08        .
  - exhaustiveness         2.491        1    2.491    2.491    2.491    2.491        .    47.57  2442.16        .
    - is_useful() 2        2.490        1    2.490    2.490    2.490    2.490        .    47.55  2441.18        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              2.314        1    2.314    2.314    2.314    2.314        .    44.19  2268.63        .
  + Difference()           1.711        1    1.711    1.711    1.711    1.711        .    32.67  1677.45        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.099        1    0.099    0.099    0.099    0.099        .     1.89    97.06        .
  total                    5.237        1    5.237    5.237    5.237    5.237        .   100.00  5134.31    5.135
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.070        1    0.070    0.070    0.070    0.070        .     1.12     7.14        .
  base                     0.980        1    0.980    0.980    0.980    0.980        .    15.64   100.00        .
  init                     0.069        1    0.069    0.069    0.069    0.069        .     1.10     7.04        .
  parse                    0.056        1    0.056    0.056    0.056    0.056        .     0.89     5.71        .
  check                    5.147        1    5.147    5.147    5.147    5.147        .    82.14   525.20        .
  - usefulness             2.587        1    2.587    2.587    2.587    2.587        .    41.29   263.98        .
    - is_useful() 1        2.520        1    2.520    2.520    2.520    2.520        .    40.22   257.14        .
  - combine                0.047        1    0.047    0.047    0.047    0.047        .     0.75     4.80        .
  - exhaustiveness         2.512        1    2.512    2.512    2.512    2.512        .    40.09   256.33        .
    - is_useful() 2        2.511        1    2.511    2.511    2.511    2.511        .    40.07   256.22        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              2.372        1    2.372    2.372    2.372    2.372        .    37.86   242.04        .
  + Difference()           1.735        1    1.735    1.735    1.735    1.735        .    27.69   177.04        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.994        1    0.994    0.994    0.994    0.994        .    15.86   101.43        .
  total                    6.266        1    6.266    6.266    6.266    6.266        .   100.00   639.39    5.286
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.748        1    0.748    0.748    0.748    0.748        .     4.78     7.63        .
  base                     9.799        1    9.799    9.799    9.799    9.799        .    62.68   100.00        .
  init                     0.547        1    0.547    0.547    0.547    0.547        .     3.50     5.58        .
  parse                    0.056        1    0.056    0.056    0.056    0.056        .     0.36     0.57        .
  check                    5.114        1    5.114    5.114    5.114    5.114        .    32.71    52.19        .
  - usefulness             2.541        1    2.541    2.541    2.541    2.541        .    16.25    25.93        .
    - is_useful() 1        2.486        1    2.486    2.486    2.486    2.486        .    15.90    25.37        .
  - combine                0.046        1    0.046    0.046    0.046    0.046        .     0.29     0.47        .
  - exhaustiveness         2.526        1    2.526    2.526    2.526    2.526        .    16.16    25.78        .
    - is_useful() 2        2.525        1    2.525    2.525    2.525    2.525        .    16.15    25.77        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  + Overlap()              2.329        1    2.329    2.329    2.329    2.329        .    14.90    23.77        .
  + Difference()           1.732        1    1.732    1.732    1.732    1.732        .    11.08    17.68        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     9.916        1    9.916    9.916    9.916    9.916        .    63.43   101.19        .
  total                   15.633        1   15.633   15.633   15.633   15.633        .   100.00   159.54    5.834
-------------------------------------------------------------------------------------------------------------------

. // bench_obs_string,  obs(10000000) levels(1000) rep(1)
. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. bench_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.554     1000    0.000    0.001    0.001    0.004    0.001    58.56   204.43        .
  base                     0.271     1000    0.000    0.000    0.000    0.001    0.000    28.65   100.00        .
  init                     0.055     1000    0.000    0.000    0.000    0.001    0.000     5.81    20.30        .
  parse                    0.498     1000    0.000    0.000    0.000    0.001    0.001    52.64   183.76        .
  check                    0.011     1000    0.000    0.000    0.000    0.001    0.000     1.16     4.06        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.342     1000    0.000    0.000    0.000    0.001    0.000    36.15   126.20        .
  total                    0.946     1000    0.000    0.001    0.001    0.002    0.000   100.00   349.08    0.001
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.895     1000    0.001    0.002    0.002    0.003    0.000    56.03    72.74        .
  base                     2.605     1000    0.002    0.003    0.003    0.006    0.001    77.03   100.00        .
  init                     0.135     1000    0.000    0.000    0.000    0.001    0.000     3.99     5.18        .
  parse                    0.600     1000    0.000    0.001    0.001    0.001    0.000    17.74    23.03        .
  check                    0.006     1000    0.000    0.000    0.000    0.001    0.000     0.18     0.23        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.604     1000    0.002    0.003    0.003    0.006    0.001    77.00    99.96        .
  total                    3.382     1000    0.003    0.003    0.003    0.007    0.001   100.00   129.83    0.001
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.076      100    0.010    0.011    0.011    0.013    0.001    39.85    42.00        .
  base                     2.562      100    0.024    0.026    0.026    0.031    0.001    94.89   100.00        .
  init                     0.011      100    0.000    0.000    0.000    0.001    0.000     0.41     0.43        .
  parse                    0.059      100    0.000    0.001    0.001    0.001    0.000     2.19     2.30        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.626      100    0.024    0.026    0.026    0.028    0.001    97.26   102.50        .
  total                    2.700      100    0.025    0.027    0.027    0.029    0.001   100.00   105.39    0.001
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.952       10    0.182    0.195    0.191    0.232    0.014    74.48    74.42        .
  base                     2.623       10    0.255    0.262    0.260    0.277    0.006   100.08   100.00        .
  init                     0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  parse                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.31     0.30        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.613       10    0.255    0.261    0.261    0.269    0.004    99.69    99.62        .
  total                    2.621       10    0.255    0.262    0.262    0.270    0.004   100.00    99.92   -0.000
-------------------------------------------------------------------------------------------------------------------

. bench_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.118        1    3.118    3.118    3.118    3.118        .   118.51   121.42        .
  base                     2.568        1    2.568    2.568    2.568    2.568        .    97.61   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.630        1    2.630    2.630    2.630    2.630        .    99.96   102.41        .
  total                    2.631        1    2.631    2.631    2.631    2.631        .   100.00   102.45    0.063
-------------------------------------------------------------------------------------------------------------------

. 
. bench_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.488     1000    0.000    0.000    0.000    0.002    0.001    44.08   160.00        .
  base                     0.305     1000    0.000    0.000    0.000    0.001    0.000    27.55   100.00        .
  init                     0.085     1000    0.000    0.000    0.000    0.001    0.000     7.68    27.87        .
  parse                    0.598     1000    0.000    0.001    0.001    0.001    0.000    54.02   196.07        .
  check                    0.006     1000    0.000    0.000    0.000    0.001    0.000     0.54     1.97        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.384     1000    0.000    0.000    0.000    0.001    0.000    34.69   125.90        .
  total                    1.107     1000    0.001    0.001    0.001    0.002    0.000   100.00   362.95    0.001
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.105     1000    0.001    0.002    0.002    0.003    0.000    57.17    75.86        .
  base                     2.775     1000    0.002    0.003    0.003    0.007    0.001    75.37   100.00        .
  init                     0.120     1000    0.000    0.000    0.000    0.001    0.000     3.26     4.32        .
  parse                    0.611     1000    0.000    0.001    0.001    0.001    0.000    16.59    22.02        .
  check                    0.003     1000    0.000    0.000    0.000    0.001    0.000     0.08     0.11        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.920     1000    0.002    0.003    0.003    0.004    0.000    79.30   105.23        .
  total                    3.682     1000    0.003    0.004    0.004    0.005    0.000   100.00   132.68    0.001
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.563      100    0.014    0.016    0.016    0.017    0.001    25.75    26.30        .
  base                     5.944      100    0.058    0.059    0.059    0.067    0.001    97.91   100.00        .
  init                     0.012      100    0.000    0.000    0.000    0.001    0.000     0.20     0.20        .
  parse                    0.058      100    0.000    0.001    0.001    0.001    0.000     0.96     0.98        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     5.995      100    0.058    0.060    0.060    0.063    0.001    98.75   100.86        .
  total                    6.071      100    0.059    0.061    0.061    0.064    0.001   100.00   102.14    0.001
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.937       10    0.187    0.194    0.191    0.205    0.005    72.25    72.33        .
  base                     2.678       10    0.266    0.268    0.267    0.271    0.002    99.89   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  parse                    0.006       10    0.000    0.001    0.001    0.001    0.001     0.22     0.22        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.674       10    0.264    0.267    0.267    0.271    0.002    99.74    99.85        .
  total                    2.681       10    0.264    0.268    0.267    0.272    0.003   100.00   100.11    0.000
-------------------------------------------------------------------------------------------------------------------

. bench_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.064        1    3.064    3.064    3.064    3.064        .   113.69   116.41        .
  base                     2.632        1    2.632    2.632    2.632    2.632        .    97.66   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.695        1    2.695    2.695    2.695    2.695        .   100.00   102.39        .
  total                    2.695        1    2.695    2.695    2.695    2.695        .   100.00   102.39    0.063
-------------------------------------------------------------------------------------------------------------------

.  
. bench_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.067     1000    0.001    0.001    0.001    0.003    0.000   129.02   602.82        .
  base                     0.177     1000    0.000    0.000    0.000    0.001    0.000    21.40   100.00        .
  init                     0.103     1000    0.000    0.000    0.000    0.001    0.000    12.45    58.19        .
  parse                    0.475     1000    0.000    0.000    0.000    0.001    0.000    57.44   268.36        .
  check                    0.002     1000    0.000    0.000    0.000    0.001    0.000     0.24     1.13        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.220     1000    0.000    0.000    0.000    0.001    0.000    26.60   124.29        .
  total                    0.827     1000    0.000    0.001    0.001    0.002    0.000   100.00   467.23    0.001
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.051     1000    0.006    0.007    0.007    0.010    0.000   314.22   453.73        .
  base                     1.554     1000    0.001    0.002    0.002    0.003    0.001    69.25   100.00        .
  init                     0.111     1000    0.000    0.000    0.000    0.001    0.000     4.95     7.14        .
  parse                    0.514     1000    0.000    0.001    0.001    0.002    0.001    22.91    33.08        .
  check                    0.003     1000    0.000    0.000    0.000    0.001    0.000     0.13     0.19        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.585     1000    0.001    0.002    0.002    0.003    0.000    70.63   101.99        .
  total                    2.244     1000    0.002    0.002    0.002    0.004    0.000   100.00   144.40    0.001
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.502      100    0.063    0.065    0.065    0.068    0.001   389.34   420.03        .
  base                     1.548      100    0.014    0.015    0.015    0.016    0.001    92.69   100.00        .
  init                     0.015      100    0.000    0.000    0.000    0.001    0.000     0.90     0.97        .
  parse                    0.051      100    0.000    0.001    0.001    0.001    0.001     3.05     3.29        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.600      100    0.015    0.016    0.016    0.018    0.000    95.81   103.36        .
  total                    1.670      100    0.016    0.017    0.017    0.018    0.001   100.00   107.88    0.001
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.491       10    0.723    0.749    0.734    0.836    0.034   461.55   464.13        .
  base                     1.614       10    0.154    0.161    0.160    0.168    0.004    99.45   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.06     0.06        .
  parse                    0.006       10    0.000    0.001    0.001    0.001    0.001     0.37     0.37        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.616       10    0.155    0.162    0.162    0.168    0.005    99.57   100.12        .
  total                    1.623       10    0.155    0.162    0.163    0.169    0.005   100.00   100.56    0.001
-------------------------------------------------------------------------------------------------------------------

. bench_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.438        1    8.438    8.438    8.438    8.438        .   523.45   542.64        .
  base                     1.555        1    1.555    1.555    1.555    1.555        .    96.46   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.06        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.611        1    1.611    1.611    1.611    1.611        .    99.94   103.60        .
  total                    1.612        1    1.612    1.612    1.612    1.612        .   100.00   103.67    0.057
-------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:   9 Mar 2025, 15:22:18
----------------------------------------------------------------------------------------------------------------------------------------------------------
