---------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  22 Aug 2024, 18:28:19

. 
. dis "`c(current_date)'"
22 Aug 2024

. dis "`c(current_time)'"
18:28:19

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. profile_obs_integer, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.359     1000    0.000    0.000    0.000    0.002    0.000     5.61   100.00        .
        init          0.414     1000    0.000    0.000    0.000    0.004    0.001     6.47   115.32        .
       parse          0.813     1000    0.000    0.001    0.001    0.004    0.000    12.71   226.46        .
       check          4.724     1000    0.004    0.005    0.004    0.013    0.001    73.87  1315.88        .
        eval          0.406     1000    0.000    0.000    0.000    0.002    0.000     6.35   113.09        .
       total          6.395     1000    0.005    0.006    0.006    0.015    0.001   100.00  1781.34    0.006
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.665     1000    0.002    0.003    0.002    0.013    0.001    24.96   100.00        .
        init          2.316     1000    0.001    0.002    0.002    0.007    0.001    21.69    86.90        .
       parse          0.808     1000    0.000    0.001    0.001    0.006    0.001     7.57    30.32        .
       check          4.641     1000    0.004    0.005    0.004    0.030    0.001    43.47   174.15        .
        eval          2.862     1000    0.002    0.003    0.003    0.007    0.001    26.81   107.39        .
       total         10.676     1000    0.009    0.011    0.010    0.042    0.002   100.00   400.60    0.008
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.160      100    0.029    0.032    0.031    0.043    0.002    49.08   100.00        .
        init          2.473      100    0.022    0.025    0.024    0.032    0.002    38.41    78.26        .
       parse          0.087      100    0.000    0.001    0.001    0.002    0.000     1.35     2.75        .
       check          0.461      100    0.004    0.005    0.004    0.009    0.001     7.16    14.59        .
        eval          3.409      100    0.031    0.034    0.033    0.044    0.002    52.95   107.88        .
       total          6.438      100    0.060    0.064    0.064    0.080    0.003   100.00   203.73    0.033
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.144       10    0.207    0.214    0.211    0.225    0.006    51.38   100.00        .
        init          1.892       10    0.182    0.189    0.186    0.197    0.005    45.34    88.25        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.14     0.28        .
       check          0.049       10    0.004    0.005    0.005    0.007    0.001     1.17     2.29        .
        eval          2.226       10    0.215    0.223    0.222    0.231    0.005    53.34   103.82        .
       total          4.173       10    0.406    0.417    0.417    0.429    0.007   100.00   194.64    0.203
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.186        1    2.186    2.186    2.186    2.186        .    53.08   100.00        .
        init          1.859        1    1.859    1.859    1.859    1.859        .    45.14    85.04        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.05        .
       check          0.006        1    0.006    0.006    0.006    0.006        .     0.15     0.27        .
        eval          2.252        1    2.252    2.252    2.252    2.252        .    54.69   103.02        .
       total          4.118        1    4.118    4.118    4.118    4.118        .   100.00   188.38    1.932
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.371     1000    0.000    0.000    0.000    0.002    0.000     6.49   100.00        .
        init          0.199     1000    0.000    0.000    0.000    0.001    0.000     3.48    53.64        .
       parse          0.743     1000    0.000    0.001    0.001    0.004    0.000    12.99   200.27        .
       check          4.365     1000    0.003    0.004    0.004    0.010    0.001    76.34  1176.55        .
        eval          0.374     1000    0.000    0.000    0.000    0.003    0.000     6.54   100.81        .
       total          5.718     1000    0.005    0.006    0.005    0.011    0.001   100.00  1541.24    0.005
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.622     1000    0.002    0.003    0.002    0.012    0.001    31.11   100.00        .
        init          0.323     1000    0.000    0.000    0.000    0.003    0.000     3.83    12.32        .
       parse          0.739     1000    0.000    0.001    0.001    0.003    0.001     8.77    28.18        .
       check          4.425     1000    0.003    0.004    0.004    0.013    0.001    52.50   168.76        .
        eval          2.882     1000    0.002    0.003    0.003    0.007    0.001    34.20   109.92        .
       total          8.428     1000    0.007    0.008    0.008    0.024    0.001   100.00   321.43    0.006
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.941      100    0.037    0.039    0.039    0.050    0.002    78.55   100.00        .
        init          0.292      100    0.002    0.003    0.003    0.005    0.001     5.82     7.41        .
       parse          0.091      100    0.000    0.001    0.001    0.003    0.000     1.81     2.31        .
       check          0.460      100    0.004    0.005    0.004    0.007    0.001     9.17    11.67        .
        eval          4.173      100    0.038    0.042    0.041    0.057    0.002    83.18   105.89        .
       total          5.017      100    0.046    0.050    0.050    0.069    0.003   100.00   127.30    0.011
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.197       10    0.211    0.220    0.216    0.243    0.009    89.38   100.00        .
        init          0.086       10    0.008    0.009    0.008    0.010    0.001     3.50     3.91        .
       parse          0.010       10    0.001    0.001    0.001    0.001    0.000     0.41     0.46        .
       check          0.046       10    0.004    0.005    0.004    0.008    0.001     1.87     2.09        .
        eval          2.316       10    0.221    0.232    0.226    0.261    0.013    94.22   105.42        .
       total          2.458       10    0.234    0.246    0.241    0.278    0.014   100.00   111.88    0.026
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.177        1    2.177    2.177    2.177    2.177        .    94.98   100.00        .
        init          0.062        1    0.062    0.062    0.062    0.062        .     2.71     2.85        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.05        .
       check          0.004        1    0.004    0.004    0.004    0.004        .     0.17     0.18        .
        eval          2.225        1    2.225    2.225    2.225    2.225        .    97.08   102.20        .
       total          2.292        1    2.292    2.292    2.292    2.292        .   100.00   105.28    0.115
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.289     1000    0.000    0.000    0.000    0.003    0.000     6.36   100.00        .
        init          0.867     1000    0.000    0.001    0.001    0.004    0.000    19.08   300.00        .
       parse          0.609     1000    0.000    0.001    0.001    0.004    0.001    13.40   210.73        .
       check          2.698     1000    0.002    0.003    0.003    0.006    0.001    59.37   933.56        .
        eval          0.321     1000    0.000    0.000    0.000    0.002    0.000     7.06   111.07        .
       total          4.544     1000    0.003    0.005    0.004    0.009    0.001   100.00  1572.32    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.103     1000    0.001    0.002    0.002    0.006    0.001    16.69   100.00        .
        init          7.055     1000    0.006    0.007    0.007    0.013    0.001    55.99   335.47        .
       parse          0.695     1000    0.000    0.001    0.001    0.004    0.001     5.52    33.05        .
       check          2.611     1000    0.002    0.003    0.003    0.006    0.001    20.72   124.16        .
        eval          2.193     1000    0.001    0.002    0.002    0.009    0.001    17.40   104.28        .
       total         12.601     1000    0.011    0.013    0.012    0.021    0.001   100.00   599.19    0.010
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.044      100    0.018    0.020    0.020    0.028    0.002    18.68   100.00        .
        init          8.549      100    0.079    0.085    0.084    0.119    0.006    78.11   418.25        .
       parse          0.085      100    0.000    0.001    0.001    0.002    0.000     0.78     4.16        .
       check          0.255      100    0.002    0.003    0.002    0.006    0.001     2.33    12.48        .
        eval          2.056      100    0.019    0.021    0.020    0.033    0.002    18.78   100.59        .
       total         10.945      100    0.102    0.109    0.108    0.143    0.007   100.00   535.47    0.089
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.009       10    0.193    0.201    0.199    0.210    0.005    10.77   100.00        .
        init         16.461       10    1.583    1.646    1.634    1.781    0.057    88.23   819.36        .
       parse          0.010       10    0.001    0.001    0.001    0.001    0.000     0.05     0.50        .
       check          0.030       10    0.002    0.003    0.002    0.006    0.001     0.16     1.49        .
        eval          2.154       10    0.201    0.215    0.207    0.287    0.026    11.55   107.22        .
       total         18.656       10    1.799    1.866    1.847    1.994    0.059   100.00   928.62    1.665
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.086        1    2.086    2.086    2.086    2.086        .     5.12   100.00        .
        init         38.487        1   38.487   38.487   38.487   38.487        .    94.46  1845.01        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.05        .
       check          0.002        1    0.002    0.002    0.002    0.002        .     0.00     0.10        .
        eval          2.255        1    2.255    2.255    2.255    2.255        .     5.53   108.10        .
       total         40.745        1   40.745   40.745   40.745   40.745        .   100.00  1953.26   38.659
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.313     1000    0.000    0.000    0.000    0.003    0.000    23.87   100.00        .
        init          0.152     1000    0.000    0.000    0.000    0.001    0.000    11.59    48.56        .
       parse          0.753     1000    0.000    0.001    0.001    0.005    0.001    57.44   240.58        .
       check          0.007     1000    0.000    0.000    0.000    0.001    0.000     0.53     2.24        .
        eval          0.361     1000    0.000    0.000    0.000    0.002    0.000    27.54   115.34        .
       total          1.311     1000    0.001    0.001    0.001    0.006    0.001   100.00   418.85    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.344     1000    0.001    0.002    0.002    0.006    0.001    71.68   100.00        .
        init          0.126     1000    0.000    0.000    0.000    0.002    0.000     3.85     5.38        .
       parse          0.644     1000    0.000    0.001    0.001    0.004    0.001    19.69    27.47        .
       check          0.007     1000    0.000    0.000    0.000    0.001    0.000     0.21     0.30        .
        eval          2.454     1000    0.002    0.002    0.002    0.007    0.001    75.05   104.69        .
       total          3.270     1000    0.002    0.003    0.003    0.008    0.001   100.00   139.51    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.156      100    0.019    0.022    0.021    0.027    0.002    92.10   100.00        .
        init          0.012      100    0.000    0.000    0.000    0.001    0.000     0.51     0.56        .
       parse          0.077      100    0.000    0.001    0.001    0.002    0.000     3.29     3.57        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.249      100    0.020    0.022    0.022    0.028    0.002    96.07   104.31        .
       total          2.341      100    0.021    0.023    0.023    0.029    0.002   100.00   108.58    0.002
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.162       10    0.208    0.216    0.210    0.257    0.015    96.39   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.05        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.27     0.28        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.235       10    0.218    0.223    0.222    0.233    0.005    99.64   103.38        .
       total          2.243       10    0.219    0.224    0.223    0.234    0.005   100.00   103.75    0.008
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.131        1    2.131    2.131    2.131    2.131        .    96.34   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          2.212        1    2.212    2.212    2.212    2.212        .   100.00   103.80        .
       total          2.212        1    2.212    2.212    2.212    2.212        .   100.00   103.80    0.081
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.315     1000    0.000    0.000    0.000    0.006    0.001    24.34   100.00        .
        init          0.129     1000    0.000    0.000    0.000    0.002    0.000     9.97    40.95        .
       parse          0.749     1000    0.000    0.001    0.001    0.003    0.000    57.88   237.78        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.31     1.27        .
        eval          0.377     1000    0.000    0.000    0.000    0.002    0.001    29.13   119.68        .
       total          1.294     1000    0.001    0.001    0.001    0.004    0.001   100.00   410.79    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.722     1000    0.002    0.003    0.003    0.027    0.001    72.07   100.00        .
        init          0.123     1000    0.000    0.000    0.000    0.001    0.000     3.26     4.52        .
       parse          0.711     1000    0.000    0.001    0.001    0.011    0.001    18.82    26.12        .
       check          0.009     1000    0.000    0.000    0.000    0.001    0.000     0.24     0.33        .
        eval          2.883     1000    0.002    0.003    0.003    0.022    0.001    76.33   105.91        .
       total          3.777     1000    0.003    0.004    0.004    0.034    0.001   100.00   138.76    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.045      100    0.037    0.040    0.040    0.053    0.003    92.16   100.00        .
        init          0.012      100    0.000    0.000    0.000    0.001    0.000     0.27     0.30        .
       parse          0.085      100    0.000    0.001    0.001    0.002    0.000     1.94     2.10        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          4.289      100    0.039    0.043    0.042    0.052    0.002    97.72   106.03        .
       total          4.389      100    0.040    0.044    0.043    0.053    0.002   100.00   108.50    0.003
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.246       10    0.217    0.225    0.221    0.244    0.008    95.21   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.30     0.31        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.350       10    0.225    0.235    0.232    0.262    0.011    99.62   104.63        .
       total          2.359       10    0.226    0.236    0.233    0.263    0.011   100.00   105.03    0.011
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.203        1    2.203    2.203    2.203    2.203        .    98.61   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          2.234        1    2.234    2.234    2.234    2.234        .   100.00   101.41        .
       total          2.234        1    2.234    2.234    2.234    2.234        .   100.00   101.41    0.031
---------------------------------------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.348     1000    0.000    0.000    0.000    0.002    0.000    29.34   100.00        .
        init          0.122     1000    0.000    0.000    0.000    0.002    0.000    10.29    35.06        .
       parse          0.667     1000    0.000    0.001    0.001    0.004    0.001    56.24   191.67        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.51     1.72        .
        eval          0.349     1000    0.000    0.000    0.000    0.002    0.000    29.43   100.29        .
       total          1.186     1000    0.000    0.001    0.001    0.004    0.001   100.00   340.80    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.422     1000    0.001    0.002    0.002    0.011    0.001    71.57   100.00        .
        init          0.125     1000    0.000    0.000    0.000    0.001    0.000     3.69     5.16        .
       parse          0.610     1000    0.000    0.001    0.001    0.002    0.001    18.03    25.19        .
       check          0.008     1000    0.000    0.000    0.000    0.001    0.000     0.24     0.33        .
        eval          2.603     1000    0.002    0.003    0.002    0.008    0.001    76.92   107.47        .
       total          3.384     1000    0.002    0.003    0.003    0.008    0.001   100.00   139.72    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.378      100    0.020    0.024    0.023    0.038    0.003    95.93   100.00        .
        init          0.014      100    0.000    0.000    0.000    0.001    0.000     0.56     0.59        .
       parse          0.063      100    0.000    0.001    0.001    0.004    0.001     2.54     2.65        .
       check          0.001      100    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
        eval          2.397      100    0.021    0.024    0.023    0.038    0.003    96.69   100.80        .
       total          2.479      100    0.022    0.025    0.024    0.039    0.003   100.00   104.25    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.037       10    0.197    0.204    0.205    0.212    0.005    96.91   100.00        .
        init          0.002       10    0.000    0.000    0.000    0.001    0.000     0.10     0.10        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.33     0.34        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.093       10    0.204    0.209    0.209    0.216    0.004    99.57   102.75        .
       total          2.102       10    0.205    0.210    0.211    0.216    0.004   100.00   103.19    0.007
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.090        1    2.090    2.090    2.090    2.090        .    97.71   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.05     0.05        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          2.138        1    2.138    2.138    2.138    2.138        .    99.95   102.30        .
       total          2.139        1    2.139    2.139    2.139    2.139        .   100.00   102.34    0.049
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  22 Aug 2024, 18:33:25
---------------------------------------------------------------------------------------------------------------------------------------------------
