--------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  27 Sep 2024, 18:43:58

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.642     1000    0.001    0.002    0.002    0.005    0.001    30.37   416.75        .
  base                     0.394     1000    0.000    0.000    0.000    0.007    0.001     7.29   100.00        .
  init                     0.663     1000    0.000    0.001    0.001    0.006    0.001    12.26   168.27        .
  parse                    0.868     1000    0.000    0.001    0.001    0.005    0.001    16.05   220.30        .
  check                    3.391     1000    0.002    0.003    0.003    0.012    0.001    62.71   860.66        .
  - usefulness             1.189     1000    0.000    0.001    0.001    0.006    0.001    21.99   301.78        .
  - combine                0.069     1000    0.000    0.000    0.000    0.001    0.000     1.28    17.51        .
  - exhaustiveness         2.038     1000    0.001    0.002    0.002    0.009    0.001    37.69   517.26        .
  - compress               0.007     1000    0.000    0.000    0.000    0.001    0.000     0.13     1.78        .
  - print                  0.028     1000    0.000    0.000    0.000    0.001    0.000     0.52     7.11        .
  eval                     0.446     1000    0.000    0.000    0.000    0.004    0.001     8.25   113.20        .
  total                    5.407     1000    0.004    0.005    0.005    0.015    0.002   100.00  1372.34    0.005
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.859     1000    0.004    0.007    0.007    0.014    0.001    75.94   176.23        .
  base                     3.892     1000    0.002    0.004    0.003    0.012    0.001    43.09   100.00        .
  init                     1.157     1000    0.000    0.001    0.001    0.004    0.001    12.81    29.73        .
  parse                    0.875     1000    0.000    0.001    0.001    0.004    0.001     9.69    22.48        .
  check                    3.342     1000    0.002    0.003    0.003    0.011    0.001    37.00    85.87        .
  - usefulness             1.187     1000    0.000    0.001    0.001    0.006    0.001    13.14    30.50        .
  - combine                0.051     1000    0.000    0.000    0.000    0.003    0.000     0.56     1.31        .
  - exhaustiveness         2.027     1000    0.001    0.002    0.002    0.008    0.001    22.44    52.08        .
  - compress               0.003     1000    0.000    0.000    0.000    0.001    0.000     0.03     0.08        .
  - print                  0.022     1000    0.000    0.000    0.000    0.001    0.000     0.24     0.57        .
  eval                     3.624     1000    0.002    0.004    0.003    0.011    0.001    40.12    93.11        .
  total                    9.032     1000    0.007    0.009    0.008    0.025    0.003   100.00   232.07    0.005
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               4.472      100    0.037    0.045    0.043    0.061    0.005    90.53   117.19        .
  base                     3.816      100    0.030    0.038    0.035    0.063    0.008    77.25   100.00        .
  init                     0.692      100    0.005    0.007    0.006    0.016    0.003    14.01    18.13        .
  parse                    0.094      100    0.000    0.001    0.001    0.003    0.001     1.90     2.46        .
  check                    0.332      100    0.002    0.003    0.003    0.008    0.001     6.72     8.70        .
  - usefulness             0.115      100    0.000    0.001    0.001    0.003    0.001     2.33     3.01        .
  - combine                0.008      100    0.000    0.000    0.000    0.001    0.000     0.16     0.21        .
  - exhaustiveness         0.200      100    0.001    0.002    0.002    0.005    0.001     4.05     5.24        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.004      100    0.000    0.000    0.000    0.001    0.000     0.08     0.10        .
  eval                     3.817      100    0.030    0.038    0.037    0.056    0.006    77.27   100.03        .
  total                    4.940      100    0.039    0.049    0.051    0.076    0.007   100.00   129.45    0.011
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               4.205       10    0.390    0.420    0.412    0.462    0.020   119.12   139.47        .
  base                     3.015       10    0.266    0.301    0.287    0.356    0.031    85.41   100.00        .
  init                     0.534       10    0.046    0.053    0.049    0.075    0.009    15.13    17.71        .
  parse                    0.010       10    0.000    0.001    0.001    0.002    0.000     0.28     0.33        .
  check                    0.038       10    0.002    0.004    0.003    0.008    0.002     1.08     1.26        .
  - usefulness             0.013       10    0.001    0.001    0.001    0.003    0.001     0.37     0.43        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.022       10    0.001    0.002    0.002    0.005    0.001     0.62     0.73        .
  - compress               0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.03        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.03        .
  eval                     2.947       10    0.257    0.295    0.295    0.327    0.022    83.48    97.74        .
  total                    3.530       10    0.308    0.353    0.346    0.389    0.025   100.00   117.08    0.052
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.713        1    5.713    5.713    5.713    5.713        .   156.48   187.31        .
  base                     3.050        1    3.050    3.050    3.050    3.050        .    83.54   100.00        .
  init                     0.585        1    0.585    0.585    0.585    0.585        .    16.02    19.18        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.03        .
  check                    0.004        1    0.004    0.004    0.004    0.004        .     0.11     0.13        .
  - usefulness             0.002        1    0.002    0.002    0.002    0.002        .     0.05     0.07        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.05     0.07        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     3.061        1    3.061    3.061    3.061    3.061        .    83.84   100.36        .
  total                    3.651        1    3.651    3.651    3.651    3.651        .   100.00   119.70    0.601
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.507     1000    0.000    0.002    0.001    0.006    0.001    25.98   359.67        .
  base                     0.419     1000    0.000    0.000    0.000    0.006    0.001     7.22   100.00        .
  init                     0.987     1000    0.000    0.001    0.001    0.004    0.001    17.02   235.56        .
  parse                    0.856     1000    0.000    0.001    0.001    0.004    0.001    14.76   204.30        .
  check                    3.495     1000    0.002    0.003    0.003    0.010    0.001    60.26   834.13        .
  - usefulness             1.237     1000    0.000    0.001    0.001    0.004    0.001    21.33   295.23        .
  - combine                0.064     1000    0.000    0.000    0.000    0.001    0.000     1.10    15.27        .
  - exhaustiveness         2.072     1000    0.001    0.002    0.002    0.006    0.001    35.72   494.51        .
  - compress               0.013     1000    0.000    0.000    0.000    0.001    0.000     0.22     3.10        .
  - print                  0.038     1000    0.000    0.000    0.000    0.002    0.000     0.66     9.07        .
  eval                     0.423     1000    0.000    0.000    0.000    0.003    0.001     7.29   100.95        .
  total                    5.800     1000    0.004    0.006    0.005    0.019    0.002   100.00  1384.25    0.005
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.687     1000    0.003    0.006    0.005    0.016    0.001    46.52   162.21        .
  base                     3.506     1000    0.002    0.004    0.003    0.009    0.001    28.68   100.00        .
  init                     4.188     1000    0.003    0.004    0.004    0.010    0.001    34.26   119.45        .
  parse                    0.879     1000    0.000    0.001    0.001    0.005    0.001     7.19    25.07        .
  check                    3.714     1000    0.002    0.004    0.003    0.010    0.001    30.38   105.93        .
  - usefulness             1.321     1000    0.000    0.001    0.001    0.006    0.001    10.81    37.68        .
  - combine                0.074     1000    0.000    0.000    0.000    0.001    0.000     0.61     2.11        .
  - exhaustiveness         2.205     1000    0.001    0.002    0.002    0.007    0.001    18.04    62.89        .
  - compress               0.008     1000    0.000    0.000    0.000    0.001    0.000     0.07     0.23        .
  - print                  0.025     1000    0.000    0.000    0.000    0.001    0.000     0.20     0.71        .
  eval                     3.408     1000    0.002    0.003    0.003    0.017    0.001    27.88    97.20        .
  total                   12.224     1000    0.009    0.012    0.011    0.024    0.003   100.00   348.66    0.009
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.743      100    0.026    0.037    0.035    0.220    0.019    42.23   114.64        .
  base                     3.265      100    0.025    0.033    0.032    0.067    0.007    36.83   100.00        .
  init                     5.012      100    0.037    0.050    0.047    0.085    0.012    56.54   153.51        .
  parse                    0.117      100    0.000    0.001    0.001    0.005    0.001     1.32     3.58        .
  check                    0.425      100    0.002    0.004    0.004    0.010    0.002     4.79    13.02        .
  - usefulness             0.158      100    0.000    0.002    0.001    0.003    0.001     1.78     4.84        .
  - combine                0.006      100    0.000    0.000    0.000    0.001    0.000     0.07     0.18        .
  - exhaustiveness         0.247      100    0.001    0.002    0.002    0.006    0.001     2.79     7.57        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.02     0.06        .
  - print                  0.004      100    0.000    0.000    0.000    0.001    0.000     0.05     0.12        .
  eval                     3.306      100    0.025    0.033    0.032    0.052    0.007    37.30   101.26        .
  total                    8.864      100    0.066    0.089    0.088    0.128    0.015   100.00   271.49    0.056
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.702       10    0.356    0.370    0.367    0.400    0.013    57.81   137.26        .
  base                     2.697       10    0.261    0.270    0.270    0.282    0.008    42.11   100.00        .
  init                     3.706       10    0.360    0.371    0.370    0.392    0.010    57.87   137.41        .
  parse                    0.010       10    0.001    0.001    0.001    0.001    0.000     0.16     0.37        .
  check                    0.029       10    0.002    0.003    0.003    0.005    0.001     0.45     1.08        .
  - usefulness             0.010       10    0.001    0.001    0.001    0.001    0.000     0.16     0.37        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.018       10    0.001    0.002    0.002    0.004    0.001     0.28     0.67        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     2.659       10    0.258    0.266    0.266    0.276    0.006    41.52    98.59        .
  total                    6.404       10    0.626    0.640    0.634    0.670    0.014   100.00   237.45    0.371
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.016        1    5.016    5.016    5.016    5.016        .    77.89   186.26        .
  base                     2.693        1    2.693    2.693    2.693    2.693        .    41.82   100.00        .
  init                     3.774        1    3.774    3.774    3.774    3.774        .    58.60   140.14        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  check                    0.003        1    0.003    0.003    0.003    0.003        .     0.05     0.11        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.07        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     2.662        1    2.662    2.662    2.662    2.662        .    41.34    98.85        .
  total                    6.440        1    6.440    6.440    6.440    6.440        .   100.00   239.14    3.747
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.843     1000    0.001    0.002    0.002    0.005    0.001    41.39   642.16        .
  base                     0.287     1000    0.000    0.000    0.000    0.001    0.000     6.45   100.00        .
  init                     0.553     1000    0.000    0.001    0.001    0.002    0.000    12.42   192.68        .
  parse                    0.568     1000    0.000    0.001    0.001    0.002    0.001    12.76   197.91        .
  check                    2.983     1000    0.002    0.003    0.003    0.008    0.001    66.99  1039.37        .
  - usefulness             0.994     1000    0.000    0.001    0.001    0.003    0.000    22.32   346.34        .
  - combine                0.032     1000    0.000    0.000    0.000    0.001    0.000     0.72    11.15        .
  - exhaustiveness         1.885     1000    0.001    0.002    0.002    0.005    0.000    42.33   656.79        .
  - compress               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.13     2.09        .
  - print                  0.016     1000    0.000    0.000    0.000    0.001    0.000     0.36     5.57        .
  eval                     0.314     1000    0.000    0.000    0.000    0.003    0.000     7.05   109.41        .
  total                    4.453     1000    0.004    0.004    0.004    0.010    0.001   100.00  1551.57    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.921     1000    0.005    0.007    0.007    0.012    0.001    65.08   305.02        .
  base                     2.269     1000    0.002    0.002    0.002    0.006    0.001    21.34   100.00        .
  init                     4.822     1000    0.004    0.005    0.005    0.009    0.001    45.35   212.52        .
  parse                    0.557     1000    0.000    0.001    0.001    0.002    0.000     5.24    24.55        .
  check                    2.962     1000    0.002    0.003    0.003    0.007    0.001    27.85   130.54        .
  - usefulness             0.962     1000    0.000    0.001    0.001    0.003    0.000     9.05    42.40        .
  - combine                0.038     1000    0.000    0.000    0.000    0.001    0.000     0.36     1.67        .
  - exhaustiveness         1.887     1000    0.001    0.002    0.002    0.006    0.000    17.74    83.16        .
  - compress               0.003     1000    0.000    0.000    0.000    0.001    0.000     0.03     0.13        .
  - print                  0.021     1000    0.000    0.000    0.000    0.001    0.000     0.20     0.93        .
  eval                     2.264     1000    0.002    0.002    0.002    0.007    0.001    21.29    99.78        .
  total                   10.634     1000    0.010    0.011    0.010    0.020    0.001   100.00   468.66    0.008
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.274      100    0.049    0.053    0.052    0.064    0.003    59.82   237.25        .
  base                     2.223      100    0.020    0.022    0.022    0.028    0.002    25.22   100.00        .
  init                     6.199      100    0.058    0.062    0.061    0.078    0.003    70.32   278.86        .
  parse                    0.060      100    0.000    0.001    0.001    0.001    0.000     0.68     2.70        .
  check                    0.294      100    0.002    0.003    0.003    0.004    0.000     3.33    13.23        .
  - usefulness             0.100      100    0.000    0.001    0.001    0.002    0.000     1.13     4.50        .
  - combine                0.002      100    0.000    0.000    0.000    0.001    0.000     0.02     0.09        .
  - exhaustiveness         0.184      100    0.001    0.002    0.002    0.003    0.000     2.09     8.28        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.003      100    0.000    0.000    0.000    0.001    0.000     0.03     0.13        .
  eval                     2.257      100    0.021    0.023    0.022    0.032    0.002    25.60   101.53        .
  total                    8.816      100    0.083    0.088    0.087    0.106    0.004   100.00   396.58    0.066
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.051       10    0.582    0.605    0.601    0.644    0.017    83.30   265.74        .
  base                     2.277       10    0.220    0.228    0.227    0.240    0.006    31.35   100.00        .
  init                     4.901       10    0.482    0.490    0.486    0.505    0.008    67.47   215.24        .
  parse                    0.007       10    0.000    0.001    0.001    0.001    0.000     0.10     0.31        .
  check                    0.032       10    0.003    0.003    0.003    0.004    0.000     0.44     1.41        .
  - usefulness             0.010       10    0.000    0.001    0.001    0.002    0.000     0.14     0.44        .
  - combine                0.001       10    0.000    0.000    0.000    0.001    0.000     0.01     0.04        .
  - exhaustiveness         0.020       10    0.001    0.002    0.002    0.003    0.000     0.28     0.88        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     2.324       10    0.221    0.232    0.230    0.252    0.009    31.99   102.06        .
  total                    7.264       10    0.710    0.726    0.724    0.749    0.012   100.00   319.02    0.499
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.213        1    7.213    7.213    7.213    7.213        .   100.43   326.82        .
  base                     2.207        1    2.207    2.207    2.207    2.207        .    30.73   100.00        .
  init                     4.865        1    4.865    4.865    4.865    4.865        .    67.74   220.43        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.05        .
  check                    0.003        1    0.003    0.003    0.003    0.003        .     0.04     0.14        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.05        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.09        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     2.313        1    2.313    2.313    2.313    2.313        .    32.21   104.80        .
  total                    7.182        1    7.182    7.182    7.182    7.182        .   100.00   325.42    4.975
-------------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.160      100    0.001    0.002    0.002    0.003    0.001     1.23   115.11        .
  base                     0.139      100    0.001    0.001    0.001    0.002    0.000     1.07   100.00        .
  init                     0.072      100    0.000    0.001    0.001    0.002    0.000     0.55    51.80        .
  parse                    0.372      100    0.003    0.004    0.004    0.005    0.001     2.86   267.63        .
  check                   12.373      100    0.117    0.124    0.123    0.137    0.004    95.27  8901.44        .
  - usefulness             3.722      100    0.035    0.037    0.036    0.047    0.002    28.66  2677.70        .
  - combine                0.093      100    0.000    0.001    0.001    0.002    0.000     0.72    66.91        .
  - exhaustiveness         8.524      100    0.080    0.085    0.084    0.096    0.003    65.63  6132.37        .
  - compress               0.004      100    0.000    0.000    0.000    0.001    0.000     0.03     2.88        .
  - print                  0.010      100    0.000    0.000    0.000    0.002    0.000     0.08     7.19        .
  eval                     0.168      100    0.001    0.002    0.002    0.004    0.001     1.29   120.86        .
  total                   12.987      100    0.123    0.130    0.129    0.143    0.004   100.00  9343.17    0.128
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.492      100    0.004    0.005    0.005    0.007    0.001     3.49    43.08        .
  base                     1.142      100    0.010    0.011    0.011    0.016    0.001     8.10   100.00        .
  init                     0.164      100    0.001    0.002    0.002    0.004    0.001     1.16    14.36        .
  parse                    0.352      100    0.003    0.004    0.003    0.010    0.001     2.50    30.82        .
  check                   12.409      100    0.118    0.124    0.123    0.134    0.004    87.98  1086.60        .
  - usefulness             3.707      100    0.035    0.037    0.037    0.047    0.002    26.28   324.61        .
  - combine                0.090      100    0.000    0.001    0.001    0.005    0.001     0.64     7.88        .
  - exhaustiveness         8.574      100    0.080    0.086    0.085    0.097    0.003    60.79   750.79        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.01     0.18        .
  - print                  0.014      100    0.000    0.000    0.000    0.001    0.000     0.10     1.23        .
  eval                     1.174      100    0.010    0.012    0.011    0.020    0.002     8.32   102.80        .
  total                   14.104      100    0.135    0.141    0.140    0.151    0.004   100.00  1235.03    0.130
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.295       10    0.028    0.029    0.029    0.032    0.002    11.60    26.36        .
  base                     1.119       10    0.108    0.112    0.110    0.119    0.004    43.99   100.00        .
  init                     0.131       10    0.012    0.013    0.013    0.014    0.001     5.15    11.71        .
  parse                    0.037       10    0.003    0.004    0.004    0.004    0.000     1.45     3.31        .
  check                    1.244       10    0.119    0.124    0.122    0.131    0.005    48.90   111.17        .
  - usefulness             0.370       10    0.035    0.037    0.036    0.043    0.002    14.54    33.07        .
  - combine                0.011       10    0.000    0.001    0.001    0.002    0.001     0.43     0.98        .
  - exhaustiveness         0.861       10    0.082    0.086    0.085    0.092    0.004    33.84    76.94        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.09        .
  eval                     1.132       10    0.108    0.113    0.111    0.123    0.005    44.50   101.16        .
  total                    2.544       10    0.246    0.254    0.252    0.267    0.007   100.00   227.35    0.143
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.375        1    0.375    0.375    0.375    0.375        .    27.08    34.03        .
  base                     1.102        1    1.102    1.102    1.102    1.102        .    79.57   100.00        .
  init                     0.126        1    0.126    0.126    0.126    0.126        .     9.10    11.43        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.29     0.36        .
  check                    0.121        1    0.121    0.121    0.121    0.121        .     8.74    10.98        .
  - usefulness             0.037        1    0.037    0.037    0.037    0.037        .     2.67     3.36        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.09        .
  - exhaustiveness         0.083        1    0.083    0.083    0.083    0.083        .     5.99     7.53        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.134        1    1.134    1.134    1.134    1.134        .    81.88   102.90        .
  total                    1.385        1    1.385    1.385    1.385    1.385        .   100.00   125.68    0.283
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               4.867        1    4.867    4.867    4.867    4.867        .    38.37    43.46        .
  base                    11.199        1   11.199   11.199   11.199   11.199        .    88.29   100.00        .
  init                     1.262        1    1.262    1.262    1.262    1.262        .     9.95    11.27        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check                    0.119        1    0.119    0.119    0.119    0.119        .     0.94     1.06        .
  - usefulness             0.036        1    0.036    0.036    0.036    0.036        .     0.28     0.32        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.081        1    0.081    0.081    0.081    0.081        .     0.64     0.72        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  eval                    11.300        1   11.300   11.300   11.300   11.300        .    89.09   100.90        .
  total                   12.684        1   12.684   12.684   12.684   12.684        .   100.00   113.26    1.485
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.159      100    0.001    0.002    0.002    0.003    0.001     1.22   108.16        .
  base                     0.147      100    0.001    0.001    0.001    0.003    0.001     1.13   100.00        .
  init                     0.100      100    0.000    0.001    0.001    0.004    0.000     0.77    68.03        .
  parse                    0.367      100    0.003    0.004    0.004    0.006    0.001     2.82   249.66        .
  check                   12.360      100    0.119    0.124    0.123    0.140    0.004    95.02  8408.16        .
  - usefulness             3.725      100    0.035    0.037    0.037    0.051    0.002    28.64  2534.01        .
  - combine                0.098      100    0.000    0.001    0.001    0.004    0.001     0.75    66.67        .
  - exhaustiveness         8.505      100    0.080    0.085    0.085    0.092    0.002    65.38  5785.71        .
  - compress               0.004      100    0.000    0.000    0.000    0.001    0.000     0.03     2.72        .
  - print                  0.007      100    0.000    0.000    0.000    0.001    0.000     0.05     4.76        .
  eval                     0.176      100    0.001    0.002    0.002    0.004    0.001     1.35   119.73        .
  total                   13.008      100    0.125    0.130    0.129    0.147    0.004   100.00  8848.98    0.129
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.586      100    0.004    0.006    0.006    0.008    0.001     4.02    48.03        .
  base                     1.220      100    0.010    0.012    0.012    0.025    0.002     8.37   100.00        .
  init                     0.379      100    0.003    0.004    0.004    0.008    0.001     2.60    31.07        .
  parse                    0.390      100    0.003    0.004    0.004    0.006    0.001     2.68    31.97        .
  check                   12.424      100    0.118    0.124    0.124    0.142    0.004    85.27  1018.36        .
  - usefulness             3.746      100    0.035    0.037    0.037    0.055    0.003    25.71   307.05        .
  - combine                0.095      100    0.000    0.001    0.001    0.002    0.000     0.65     7.79        .
  - exhaustiveness         8.560      100    0.080    0.086    0.085    0.104    0.003    58.75   701.64        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.08        .
  - print                  0.010      100    0.000    0.000    0.000    0.002    0.000     0.07     0.82        .
  eval                     1.372      100    0.012    0.014    0.013    0.017    0.001     9.42   112.46        .
  total                   14.570      100    0.139    0.146    0.145    0.163    0.004   100.00  1194.26    0.134
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.578       10    0.056    0.058    0.057    0.063    0.002    11.66    19.20        .
  base                     3.011       10    0.294    0.301    0.300    0.309    0.005    60.74   100.00        .
  init                     0.653       10    0.061    0.065    0.063    0.076    0.005    13.17    21.69        .
  parse                    0.042       10    0.003    0.004    0.004    0.005    0.001     0.85     1.39        .
  check                    1.265       10    0.120    0.127    0.125    0.132    0.004    25.52    42.01        .
  - usefulness             0.380       10    0.036    0.038    0.037    0.044    0.003     7.67    12.62        .
  - combine                0.010       10    0.001    0.001    0.001    0.001    0.000     0.20     0.33        .
  - exhaustiveness         0.870       10    0.082    0.087    0.086    0.094    0.003    17.55    28.89        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.002       10    0.000    0.000    0.000    0.001    0.000     0.04     0.07        .
  eval                     2.996       10    0.291    0.300    0.300    0.306    0.004    60.44    99.50        .
  total                    4.957       10    0.486    0.496    0.495    0.505    0.006   100.00   164.63    0.195
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.399        1    0.399    0.399    0.399    0.399        .    24.92    34.40        .
  base                     1.160        1    1.160    1.160    1.160    1.160        .    72.45   100.00        .
  init                     0.333        1    0.333    0.333    0.333    0.333        .    20.80    28.71        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.19     0.26        .
  check                    0.121        1    0.121    0.121    0.121    0.121        .     7.56    10.43        .
  - usefulness             0.037        1    0.037    0.037    0.037    0.037        .     2.31     3.19        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.09        .
  - exhaustiveness         0.083        1    0.083    0.083    0.083    0.083        .     5.18     7.16        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.144        1    1.144    1.144    1.144    1.144        .    71.46    98.62        .
  total                    1.601        1    1.601    1.601    1.601    1.601        .   100.00   138.02    0.441
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.017        1    5.017    5.017    5.017    5.017        .    33.78    43.95        .
  base                    11.414        1   11.414   11.414   11.414   11.414        .    76.85   100.00        .
  init                     3.335        1    3.335    3.335    3.335    3.335        .    22.45    29.22        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.03     0.04        .
  check                    0.126        1    0.126    0.126    0.126    0.126        .     0.85     1.10        .
  - usefulness             0.036        1    0.036    0.036    0.036    0.036        .     0.24     0.32        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.089        1    0.089    0.089    0.089    0.089        .     0.60     0.78        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    11.387        1   11.387   11.387   11.387   11.387        .    76.67    99.76        .
  total                   14.852        1   14.852   14.852   14.852   14.852        .   100.00   130.12    3.438
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.190      100    0.001    0.002    0.002    0.003    0.000     1.34   129.25        .
  base                     0.147      100    0.001    0.001    0.001    0.003    0.001     1.03   100.00        .
  init                     0.072      100    0.000    0.001    0.001    0.002    0.000     0.51    48.98        .
  parse                    0.272      100    0.002    0.003    0.003    0.004    0.001     1.91   185.03        .
  check                   13.711      100    0.130    0.137    0.137    0.149    0.003    96.47  9327.21        .
  - usefulness             3.479      100    0.033    0.035    0.034    0.039    0.002    24.48  2366.67        .
  - combine                0.046      100    0.000    0.000    0.000    0.001    0.001     0.32    31.29        .
  - exhaustiveness        10.155      100    0.096    0.102    0.101    0.110    0.003    71.45  6908.16        .
  - compress               0.004      100    0.000    0.000    0.000    0.001    0.000     0.03     2.72        .
  - print                  0.011      100    0.000    0.000    0.000    0.001    0.000     0.08     7.48        .
  eval                     0.151      100    0.001    0.002    0.001    0.003    0.001     1.06   102.72        .
  total                   14.212      100    0.135    0.142    0.142    0.154    0.003   100.00  9668.03    0.141
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.766      100    0.006    0.008    0.008    0.010    0.001     4.91    67.85        .
  base                     1.129      100    0.010    0.011    0.011    0.016    0.001     7.23   100.00        .
  init                     0.563      100    0.005    0.006    0.005    0.014    0.001     3.61    49.87        .
  parse                    0.236      100    0.002    0.002    0.002    0.005    0.001     1.51    20.90        .
  check                   13.643      100    0.131    0.136    0.136    0.146    0.003    87.39  1208.41        .
  - usefulness             3.447      100    0.033    0.034    0.034    0.041    0.002    22.08   305.31        .
  - combine                0.036      100    0.000    0.000    0.000    0.001    0.000     0.23     3.19        .
  - exhaustiveness        10.133      100    0.097    0.101    0.101    0.113    0.003    64.91   897.52        .
  - compress               0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     0.27        .
  - print                  0.006      100    0.000    0.000    0.000    0.001    0.000     0.04     0.53        .
  eval                     1.164      100    0.011    0.012    0.011    0.015    0.001     7.46   103.10        .
  total                   15.611      100    0.150    0.156    0.155    0.165    0.003   100.00  1382.73    0.145
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.569       10    0.054    0.057    0.057    0.061    0.002    17.49    51.17        .
  base                     1.112       10    0.110    0.111    0.111    0.113    0.001    34.18   100.00        .
  init                     0.677       10    0.065    0.068    0.067    0.072    0.002    20.81    60.88        .
  parse                    0.024       10    0.002    0.002    0.002    0.003    0.001     0.74     2.16        .
  check                    1.359       10    0.131    0.136    0.135    0.140    0.003    41.78   122.21        .
  - usefulness             0.350       10    0.033    0.035    0.034    0.040    0.002    10.76    31.47        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         1.005       10    0.097    0.100    0.100    0.105    0.003    30.89    90.38        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     1.193       10    0.110    0.119    0.116    0.138    0.008    36.67   107.28        .
  total                    3.253       10    0.313    0.325    0.322    0.348    0.009   100.00   292.54    0.214
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.645        1    0.645    0.645    0.645    0.645        .    35.27    56.73        .
  base                     1.137        1    1.137    1.137    1.137    1.137        .    62.17   100.00        .
  init                     0.514        1    0.514    0.514    0.514    0.514        .    28.10    45.21        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.11     0.18        .
  check                    0.131        1    0.131    0.131    0.131    0.131        .     7.16    11.52        .
  - usefulness             0.034        1    0.034    0.034    0.034    0.034        .     1.86     2.99        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.097        1    0.097    0.097    0.097    0.097        .     5.30     8.53        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.182        1    1.182    1.182    1.182    1.182        .    64.63   103.96        .
  total                    1.829        1    1.829    1.829    1.829    1.829        .   100.00   160.86    0.692
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.947        1    7.947    7.947    7.947    7.947        .    47.31    67.74        .
  base                    11.731        1   11.731   11.731   11.731   11.731        .    69.84   100.00        .
  init                     5.221        1    5.221    5.221    5.221    5.221        .    31.08    44.51        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check                    0.141        1    0.141    0.141    0.141    0.141        .     0.84     1.20        .
  - usefulness             0.037        1    0.037    0.037    0.037    0.037        .     0.22     0.32        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.104        1    0.104    0.104    0.104    0.104        .     0.62     0.89        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    11.432        1   11.432   11.432   11.432   11.432        .    68.06    97.45        .
  total                   16.797        1   16.797   16.797   16.797   16.797        .   100.00   143.18    5.066
-------------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.14   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  parse                    0.149        1    0.149    0.149    0.149    0.149        .     2.02  1490.00        .
  check                    7.221        1    7.221    7.221    7.221    7.221        .    97.78 72210.00        .
  - usefulness             2.714        1    2.714    2.714    2.714    2.714        .    36.75 27140.00        .
  - combine                0.127        1    0.127    0.127    0.127    0.127        .     1.72  1270.00        .
  - exhaustiveness         4.375        1    4.375    4.375    4.375    4.375        .    59.24 43750.00        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  eval                     0.014        1    0.014    0.014    0.014    0.014        .     0.19   140.00        .
  total                    7.385        1    7.385    7.385    7.385    7.385        .   100.00 73850.00    7.375
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.004        1    0.004    0.004    0.004    0.004        .     0.03     4.04        .
  base                     0.099        1    0.099    0.099    0.099    0.099        .     0.84   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.02     2.02        .
  parse                    0.147        1    0.147    0.147    0.147    0.147        .     1.24   148.48        .
  check                   11.586        1   11.586   11.586   11.586   11.586        .    97.91 11703.03        .
  - usefulness             3.456        1    3.456    3.456    3.456    3.456        .    29.21  3490.91        .
  - combine                0.129        1    0.129    0.129    0.129    0.129        .     1.09   130.30        .
  - exhaustiveness         7.994        1    7.994    7.994    7.994    7.994        .    67.56  8074.75        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.01        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.01        .
  eval                     0.098        1    0.098    0.098    0.098    0.098        .     0.83    98.99        .
  total                   11.833        1   11.833   11.833   11.833   11.833        .   100.00 11952.53   11.734
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.031        1    0.031    0.031    0.031    0.031        .     0.24     3.22        .
  base                     0.964        1    0.964    0.964    0.964    0.964        .     7.58   100.00        .
  init                     0.013        1    0.013    0.013    0.013    0.013        .     0.10     1.35        .
  parse                    0.151        1    0.151    0.151    0.151    0.151        .     1.19    15.66        .
  check                   11.574        1   11.574   11.574   11.574   11.574        .    90.97  1200.62        .
  - usefulness             3.495        1    3.495    3.495    3.495    3.495        .    27.47   362.55        .
  - combine                0.126        1    0.126    0.126    0.126    0.126        .     0.99    13.07        .
  - exhaustiveness         7.948        1    7.948    7.948    7.948    7.948        .    62.47   824.48        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     0.984        1    0.984    0.984    0.984    0.984        .     7.73   102.07        .
  total                   12.723        1   12.723   12.723   12.723   12.723        .   100.00  1319.81   11.759
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.376        1    0.376    0.376    0.376    0.376        .     1.76     3.91        .
  base                     9.619        1    9.619    9.619    9.619    9.619        .    44.95   100.00        .
  init                     0.129        1    0.129    0.129    0.129    0.129        .     0.60     1.34        .
  parse                    0.145        1    0.145    0.145    0.145    0.145        .     0.68     1.51        .
  check                   11.461        1   11.461   11.461   11.461   11.461        .    53.56   119.15        .
  - usefulness             3.439        1    3.439    3.439    3.439    3.439        .    16.07    35.75        .
  - combine                0.126        1    0.126    0.126    0.126    0.126        .     0.59     1.31        .
  - exhaustiveness         7.890        1    7.890    7.890    7.890    7.890        .    36.87    82.03        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  eval                     9.664        1    9.664    9.664    9.664    9.664        .    45.16   100.47        .
  total                   21.399        1   21.399   21.399   21.399   21.399        .   100.00   222.47   11.780
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_integer, obs(10000000) levels(1000) rep(1)
. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.03    20.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.14   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  parse                    0.153        1    0.153    0.153    0.153    0.153        .     2.18  1530.00        .
  check                    6.846        1    6.846    6.846    6.846    6.846        .    97.56 68460.00        .
  - usefulness             2.666        1    2.666    2.666    2.666    2.666        .    37.99 26660.00        .
  - combine                0.130        1    0.130    0.130    0.130    0.130        .     1.85  1300.00        .
  - exhaustiveness         4.046        1    4.046    4.046    4.046    4.046        .    57.66 40460.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  eval                     0.016        1    0.016    0.016    0.016    0.016        .     0.23   160.00        .
  total                    7.017        1    7.017    7.017    7.017    7.017        .   100.00 70170.00    7.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.005        1    0.005    0.005    0.005    0.005        .     0.04     5.00        .
  base                     0.100        1    0.100    0.100    0.100    0.100        .     0.85   100.00        .
  init                     0.004        1    0.004    0.004    0.004    0.004        .     0.03     4.00        .
  parse                    0.146        1    0.146    0.146    0.146    0.146        .     1.24   146.00        .
  check                   11.489        1   11.489   11.489   11.489   11.489        .    97.85 11489.00        .
  - usefulness             3.463        1    3.463    3.463    3.463    3.463        .    29.49  3463.00        .
  - combine                0.128        1    0.128    0.128    0.128    0.128        .     1.09   128.00        .
  - exhaustiveness         7.894        1    7.894    7.894    7.894    7.894        .    67.23  7894.00        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.00        .
  eval                     0.101        1    0.101    0.101    0.101    0.101        .     0.86   101.00        .
  total                   11.741        1   11.741   11.741   11.741   11.741        .   100.00 11741.00   11.641
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.028        1    0.028    0.028    0.028    0.028        .     0.22     2.86        .
  base                     0.980        1    0.980    0.980    0.980    0.980        .     7.72   100.00        .
  init                     0.043        1    0.043    0.043    0.043    0.043        .     0.34     4.39        .
  parse                    0.162        1    0.162    0.162    0.162    0.162        .     1.28    16.53        .
  check                   11.517        1   11.517   11.517   11.517   11.517        .    90.72  1175.20        .
  - usefulness             3.500        1    3.500    3.500    3.500    3.500        .    27.57   357.14        .
  - combine                0.129        1    0.129    0.129    0.129    0.129        .     1.02    13.16        .
  - exhaustiveness         7.885        1    7.885    7.885    7.885    7.885        .    62.11   804.59        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.10        .
  eval                     0.972        1    0.972    0.972    0.972    0.972        .     7.66    99.18        .
  total                   12.695        1   12.695   12.695   12.695   12.695        .   100.00  1295.41   11.715
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.363        1    0.363    0.363    0.363    0.363        .     1.67     3.72        .
  base                     9.771        1    9.771    9.771    9.771    9.771        .    45.07   100.00        .
  init                     0.341        1    0.341    0.341    0.341    0.341        .     1.57     3.49        .
  parse                    0.146        1    0.146    0.146    0.146    0.146        .     0.67     1.49        .
  check                   11.523        1   11.523   11.523   11.523   11.523        .    53.15   117.93        .
  - usefulness             3.515        1    3.515    3.515    3.515    3.515        .    16.21    35.97        .
  - combine                0.126        1    0.126    0.126    0.126    0.126        .     0.58     1.29        .
  - exhaustiveness         7.876        1    7.876    7.876    7.876    7.876        .    36.33    80.61        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  eval                     9.670        1    9.670    9.670    9.670    9.670        .    44.60    98.97        .
  total                   21.681        1   21.681   21.681   21.681   21.681        .   100.00   221.89   11.910
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_float,   obs(10000000) levels(1000) rep(1)
. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.01     9.09        .
  base                     0.011        1    0.011    0.011    0.011    0.011        .     0.16   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01     9.09        .
  parse                    0.073        1    0.073    0.073    0.073    0.073        .     1.04   663.64        .
  check                    6.931        1    6.931    6.931    6.931    6.931        .    98.76 63009.09        .
  - usefulness             2.268        1    2.268    2.268    2.268    2.268        .    32.32 20618.18        .
  - combine                0.053        1    0.053    0.053    0.053    0.053        .     0.76   481.82        .
  - exhaustiveness         4.608        1    4.608    4.608    4.608    4.608        .    65.66 41890.91        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     9.09        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.19   118.18        .
  total                    7.018        1    7.018    7.018    7.018    7.018        .   100.00 63800.00    7.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.008        1    0.008    0.008    0.008    0.008        .     0.06     7.62        .
  base                     0.105        1    0.105    0.105    0.105    0.105        .     0.82   100.00        .
  init                     0.007        1    0.007    0.007    0.007    0.007        .     0.05     6.67        .
  parse                    0.068        1    0.068    0.068    0.068    0.068        .     0.53    64.76        .
  check                   12.669        1   12.669   12.669   12.669   12.669        .    98.61 12065.71        .
  - usefulness             3.139        1    3.139    3.139    3.139    3.139        .    24.43  2989.52        .
  - combine                0.051        1    0.051    0.051    0.051    0.051        .     0.40    48.57        .
  - exhaustiveness         9.476        1    9.476    9.476    9.476    9.476        .    73.76  9024.76        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     0.103        1    0.103    0.103    0.103    0.103        .     0.80    98.10        .
  total                   12.847        1   12.847   12.847   12.847   12.847        .   100.00 12235.24   12.742
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.062        1    0.062    0.062    0.062    0.062        .     0.45     6.08        .
  base                     1.020        1    1.020    1.020    1.020    1.020        .     7.37   100.00        .
  init                     0.073        1    0.073    0.073    0.073    0.073        .     0.53     7.16        .
  parse                    0.068        1    0.068    0.068    0.068    0.068        .     0.49     6.67        .
  check                   12.674        1   12.674   12.674   12.674   12.674        .    91.56  1242.55        .
  - usefulness             3.137        1    3.137    3.137    3.137    3.137        .    22.66   307.55        .
  - combine                0.052        1    0.052    0.052    0.052    0.052        .     0.38     5.10        .
  - exhaustiveness         9.482        1    9.482    9.482    9.482    9.482        .    68.50   929.61        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.10        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.028        1    1.028    1.028    1.028    1.028        .     7.43   100.78        .
  total                   13.843        1   13.843   13.843   13.843   13.843        .   100.00  1357.16   12.823
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.682        1    0.682    0.682    0.682    0.682        .     2.89     6.51        .
  base                    10.479        1   10.479   10.479   10.479   10.479        .    44.36   100.00        .
  init                     0.547        1    0.547    0.547    0.547    0.547        .     2.32     5.22        .
  parse                    0.071        1    0.071    0.071    0.071    0.071        .     0.30     0.68        .
  check                   12.813        1   12.813   12.813   12.813   12.813        .    54.24   122.27        .
  - usefulness             3.239        1    3.239    3.239    3.239    3.239        .    13.71    30.91        .
  - combine                0.055        1    0.055    0.055    0.055    0.055        .     0.23     0.52        .
  - exhaustiveness         9.515        1    9.515    9.515    9.515    9.515        .    40.28    90.80        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    10.189        1   10.189   10.189   10.189   10.189        .    43.13    97.23        .
  total                   23.622        1   23.622   23.622   23.622   23.622        .   100.00   225.42   13.143
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_string,  obs(10000000) levels(1000) rep(1)
. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.836     1000    0.000    0.002    0.002    0.005    0.001   162.05   523.08        .
  base                     0.351     1000    0.000    0.000    0.000    0.003    0.000    30.98   100.00        .
  init                     0.075     1000    0.000    0.000    0.000    0.001    0.000     6.62    21.37        .
  parse                    0.646     1000    0.000    0.001    0.001    0.002    0.000    57.02   184.05        .
  check                    0.003     1000    0.000    0.000    0.000    0.001    0.000     0.26     0.85        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.379     1000    0.000    0.000    0.000    0.004    0.000    33.45   107.98        .
  total                    1.133     1000    0.001    0.001    0.001    0.004    0.000   100.00   322.79    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               4.863     1000    0.003    0.005    0.005    0.009    0.001   140.22   182.68        .
  base                     2.662     1000    0.002    0.003    0.003    0.006    0.001    76.76   100.00        .
  init                     0.079     1000    0.000    0.000    0.000    0.001    0.000     2.28     2.97        .
  parse                    0.698     1000    0.000    0.001    0.001    0.002    0.000    20.13    26.22        .
  check                    0.003     1000    0.000    0.000    0.000    0.001    0.000     0.09     0.11        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.656     1000    0.002    0.003    0.003    0.008    0.001    76.59    99.77        .
  total                    3.468     1000    0.003    0.003    0.003    0.009    0.001   100.00   130.28    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.894      100    0.026    0.029    0.029    0.041    0.002   106.79   110.84        .
  base                     2.611      100    0.024    0.026    0.025    0.036    0.002    96.35   100.00        .
  init                     0.011      100    0.000    0.000    0.000    0.001    0.000     0.41     0.42        .
  parse                    0.072      100    0.000    0.001    0.001    0.001    0.000     2.66     2.76        .
  check                    0.002      100    0.000    0.000    0.000    0.001    0.000     0.07     0.08        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.624      100    0.024    0.026    0.026    0.033    0.002    96.83   100.50        .
  total                    2.710      100    0.025    0.027    0.027    0.034    0.002   100.00   103.79    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.677       10    0.360    0.368    0.368    0.377    0.006   140.02   139.54        .
  base                     2.635       10    0.254    0.264    0.261    0.280    0.008   100.34   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  parse                    0.009       10    0.000    0.001    0.001    0.001    0.000     0.34     0.34        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.616       10    0.258    0.262    0.262    0.267    0.003    99.62    99.28        .
  total                    2.626       10    0.259    0.263    0.263    0.268    0.003   100.00    99.66   -0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               4.951        1    4.951    4.951    4.951    4.951        .   188.18   188.25        .
  base                     2.630        1    2.630    2.630    2.630    2.630        .    99.96   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.631        1    2.631    2.631    2.631    2.631        .   100.00   100.04        .
  total                    2.631        1    2.631    2.631    2.631    2.631        .   100.00   100.04    0.001
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.783     1000    0.000    0.002    0.002    0.004    0.001   157.79   555.45        .
  base                     0.321     1000    0.000    0.000    0.000    0.003    0.000    28.41   100.00        .
  init                     0.070     1000    0.000    0.000    0.000    0.001    0.000     6.19    21.81        .
  parse                    0.672     1000    0.000    0.001    0.001    0.003    0.000    59.47   209.35        .
  check                    0.002     1000    0.000    0.000    0.000    0.001    0.000     0.18     0.62        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.366     1000    0.000    0.000    0.000    0.002    0.000    32.39   114.02        .
  total                    1.130     1000    0.001    0.001    0.001    0.004    0.000   100.00   352.02    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               4.858     1000    0.003    0.005    0.005    0.009    0.001   141.14   179.79        .
  base                     2.702     1000    0.002    0.003    0.003    0.007    0.001    78.50   100.00        .
  init                     0.077     1000    0.000    0.000    0.000    0.001    0.000     2.24     2.85        .
  parse                    0.672     1000    0.000    0.001    0.001    0.002    0.000    19.52    24.87        .
  check                    0.002     1000    0.000    0.000    0.000    0.001    0.000     0.06     0.07        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.665     1000    0.002    0.003    0.003    0.007    0.001    77.43    98.63        .
  total                    3.442     1000    0.003    0.003    0.003    0.009    0.001   100.00   127.39    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.878      100    0.026    0.029    0.028    0.036    0.002   105.73   109.35        .
  base                     2.632      100    0.025    0.026    0.026    0.033    0.002    96.69   100.00        .
  init                     0.009      100    0.000    0.000    0.000    0.001    0.000     0.33     0.34        .
  parse                    0.069      100    0.000    0.001    0.001    0.002    0.000     2.53     2.62        .
  check                    0.001      100    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.640      100    0.025    0.026    0.026    0.033    0.001    96.99   100.30        .
  total                    2.722      100    0.026    0.027    0.027    0.034    0.001   100.00   103.42    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.697       10    0.356    0.370    0.365    0.393    0.011   136.77   138.78        .
  base                     2.664       10    0.259    0.266    0.266    0.279    0.005    98.56   100.00        .
  init                     0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  parse                    0.007       10    0.000    0.001    0.001    0.001    0.000     0.26     0.26        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.696       10    0.261    0.270    0.267    0.285    0.007    99.74   101.20        .
  total                    2.703       10    0.261    0.270    0.268    0.285    0.007   100.00   101.46    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               4.797        1    4.797    4.797    4.797    4.797        .   182.74   180.20        .
  base                     2.662        1    2.662    2.662    2.662    2.662        .   101.41   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.624        1    2.624    2.624    2.624    2.624        .    99.96    98.57        .
  total                    2.625        1    2.625    2.625    2.625    2.625        .   100.00    98.61   -0.037
-------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.067     1000    0.001    0.002    0.002    0.009    0.001   221.07   782.95        .
  base                     0.264     1000    0.000    0.000    0.000    0.002    0.000    28.24   100.00        .
  init                     0.076     1000    0.000    0.000    0.000    0.001    0.000     8.13    28.79        .
  parse                    0.513     1000    0.000    0.001    0.001    0.004    0.001    54.87   194.32        .
  check                    0.002     1000    0.000    0.000    0.000    0.001    0.000     0.21     0.76        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.315     1000    0.000    0.000    0.000    0.001    0.000    33.69   119.32        .
  total                    0.935     1000    0.000    0.001    0.001    0.005    0.000   100.00   354.17    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.402     1000    0.006    0.008    0.008    0.024    0.002   245.53   301.69        .
  base                     2.785     1000    0.002    0.003    0.002    0.013    0.001    81.39   100.00        .
  init                     0.126     1000    0.000    0.000    0.000    0.001    0.000     3.68     4.52        .
  parse                    0.630     1000    0.000    0.001    0.001    0.003    0.001    18.41    22.62        .
  check                    0.005     1000    0.000    0.000    0.000    0.001    0.000     0.15     0.18        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.629     1000    0.002    0.003    0.002    0.035    0.001    76.83    94.40        .
  total                    3.422     1000    0.002    0.003    0.003    0.036    0.001   100.00   122.87    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.610      100    0.050    0.066    0.065    0.102    0.010   245.54   258.61        .
  base                     2.556      100    0.021    0.026    0.023    0.039    0.005    94.95   100.00        .
  init                     0.018      100    0.000    0.000    0.000    0.001    0.000     0.67     0.70        .
  parse                    0.059      100    0.000    0.001    0.001    0.002    0.001     2.19     2.31        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.611      100    0.020    0.026    0.023    0.046    0.006    96.99   102.15        .
  total                    2.692      100    0.021    0.027    0.024    0.049    0.006   100.00   105.32    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.166       10    0.667    0.717    0.718    0.761    0.031   271.95   280.25        .
  base                     2.557       10    0.225    0.256    0.246    0.289    0.023    97.04   100.00        .
  init                     0.002       10    0.000    0.000    0.000    0.001    0.000     0.08     0.08        .
  parse                    0.006       10    0.000    0.001    0.000    0.002    0.001     0.23     0.23        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.627       10    0.226    0.263    0.255    0.303    0.023    99.70   102.74        .
  total                    2.635       10    0.226    0.263    0.256    0.304    0.023   100.00   103.05    0.008
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.285        1    8.285    8.285    8.285    8.285        .   328.64   334.75        .
  base                     2.475        1    2.475    2.475    2.475    2.475        .    98.18   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.520        1    2.520    2.520    2.520    2.520        .    99.96   101.82        .
  total                    2.521        1    2.521    2.521    2.521    2.521        .   100.00   101.86    0.046
-------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  27 Sep 2024, 18:56:56
--------------------------------------------------------------------------------------------------------------------------------
