-----------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:   6 Oct 2024, 19:02:55

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.751     1000    0.000    0.001    0.001    0.002    0.000    17.71   243.83        .
  base                     0.308     1000    0.000    0.000    0.000    0.002    0.000     7.26   100.00        .
  init                     0.515     1000    0.000    0.001    0.001    0.002    0.001    12.14   167.21        .
  parse                    0.684     1000    0.000    0.001    0.001    0.002    0.000    16.13   222.08        .
  check                    2.647     1000    0.002    0.003    0.003    0.004    0.000    62.41   859.42        .
  - usefulness             1.094     1000    0.001    0.001    0.001    0.002    0.000    25.80   355.19        .
    - is_useful() 1        1.010     1000    0.000    0.001    0.001    0.002    0.000    23.82   327.92        .
  - combine                0.060     1000    0.000    0.000    0.000    0.001    0.000     1.41    19.48        .
  - exhaustiveness         1.439     1000    0.001    0.001    0.001    0.003    0.000    33.93   467.21        .
    - is_useful() 2        1.376     1000    0.001    0.001    0.001    0.003    0.000    32.45   446.75        .
  - compress               0.007     1000    0.000    0.000    0.000    0.001    0.000     0.17     2.27        .
  - print                  0.016     1000    0.000    0.000    0.000    0.002    0.000     0.38     5.19        .
  + Overlap()              1.281     1000    0.000    0.001    0.001    0.004    0.001    30.21   415.91        .
  + Difference()           0.775     1000    0.000    0.001    0.001    0.003    0.001    18.27   251.62        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.367     1000    0.000    0.000    0.000    0.004    0.000     8.65   119.16        .
  total                    4.241     1000    0.004    0.004    0.004    0.008    0.000   100.00  1376.95    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.138     1000    0.001    0.002    0.002    0.004    0.000    30.23    79.81        .
  base                     2.679     1000    0.002    0.003    0.003    0.006    0.001    37.88   100.00        .
  init                     0.881     1000    0.000    0.001    0.001    0.002    0.000    12.46    32.89        .
  parse                    0.693     1000    0.000    0.001    0.001    0.001    0.000     9.80    25.87        .
  check                    2.650     1000    0.002    0.003    0.003    0.005    0.000    37.47    98.92        .
  - usefulness             1.110     1000    0.001    0.001    0.001    0.002    0.000    15.70    41.43        .
    - is_useful() 1        1.015     1000    0.000    0.001    0.001    0.002    0.000    14.35    37.89        .
  - combine                0.057     1000    0.000    0.000    0.000    0.001    0.000     0.81     2.13        .
  - exhaustiveness         1.410     1000    0.001    0.001    0.001    0.003    0.000    19.94    52.63        .
    - is_useful() 2        1.350     1000    0.001    0.001    0.001    0.003    0.000    19.09    50.39        .
  - compress               0.007     1000    0.000    0.000    0.000    0.001    0.000     0.10     0.26        .
  - print                  0.015     1000    0.000    0.000    0.000    0.001    0.000     0.21     0.56        .
  + Overlap()              1.300     1000    0.000    0.001    0.001    0.004    0.001    18.38    48.53        .
  + Difference()           0.737     1000    0.000    0.001    0.001    0.002    0.001    10.42    27.51        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.818     1000    0.002    0.003    0.003    0.005    0.000    39.85   105.19        .
  total                    7.072     1000    0.006    0.007    0.007    0.011    0.000   100.00   263.98    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.363      100    0.012    0.014    0.013    0.018    0.001    35.59    46.58        .
  base                     2.926      100    0.028    0.029    0.029    0.032    0.001    76.40   100.00        .
  init                     0.537      100    0.005    0.005    0.005    0.006    0.000    14.02    18.35        .
  parse                    0.071      100    0.000    0.001    0.001    0.002    0.000     1.85     2.43        .
  check                    0.277      100    0.002    0.003    0.003    0.011    0.001     7.23     9.47        .
  - usefulness             0.113      100    0.001    0.001    0.001    0.004    0.000     2.95     3.86        .
    - is_useful() 1        0.106      100    0.000    0.001    0.001    0.004    0.000     2.77     3.62        .
  - combine                0.009      100    0.000    0.000    0.000    0.001    0.000     0.23     0.31        .
  - exhaustiveness         0.148      100    0.001    0.001    0.001    0.006    0.001     3.86     5.06        .
    - is_useful() 2        0.140      100    0.001    0.001    0.001    0.005    0.001     3.66     4.78        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.144      100    0.000    0.001    0.001    0.007    0.001     3.76     4.92        .
  + Difference()           0.067      100    0.000    0.001    0.000    0.002    0.001     1.75     2.29        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.943      100    0.029    0.029    0.029    0.031    0.001    76.84   100.58        .
  total                    3.830      100    0.037    0.038    0.038    0.050    0.001   100.00   130.90    0.009
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.843       10    0.179    0.184    0.183    0.190    0.004    63.20    75.94        .
  base                     2.427       10    0.241    0.243    0.242    0.248    0.002    83.23   100.00        .
  init                     0.450       10    0.044    0.045    0.045    0.047    0.001    15.43    18.54        .
  parse                    0.010       10    0.001    0.001    0.001    0.001    0.000     0.34     0.41        .
  check                    0.026       10    0.002    0.003    0.003    0.003    0.001     0.89     1.07        .
  - usefulness             0.010       10    0.001    0.001    0.001    0.001    0.000     0.34     0.41        .
    - is_useful() 1        0.010       10    0.001    0.001    0.001    0.001    0.000     0.34     0.41        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.014       10    0.001    0.001    0.001    0.002    0.001     0.48     0.58        .
    - is_useful() 2        0.014       10    0.001    0.001    0.001    0.002    0.001     0.48     0.58        .
  - compress               0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.04        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.013       10    0.000    0.001    0.001    0.003    0.001     0.45     0.54        .
  + Difference()           0.008       10    0.000    0.001    0.000    0.002    0.001     0.27     0.33        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.430       10    0.242    0.243    0.243    0.244    0.001    83.33   100.12        .
  total                    2.916       10    0.290    0.292    0.291    0.293    0.001   100.00   120.15    0.049
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.057        1    3.057    3.057    3.057    3.057        .   104.44   126.43        .
  base                     2.418        1    2.418    2.418    2.418    2.418        .    82.61   100.00        .
  init                     0.451        1    0.451    0.451    0.451    0.451        .    15.41    18.65        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  check                    0.003        1    0.003    0.003    0.003    0.003        .     0.10     0.12        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
    - is_useful() 1        0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.07     0.08        .
    - is_useful() 2        0.002        1    0.002    0.002    0.002    0.002        .     0.07     0.08        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.002        1    0.002    0.002    0.002    0.002        .     0.07     0.08        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.472        1    2.472    2.472    2.472    2.472        .    84.46   102.23        .
  total                    2.927        1    2.927    2.927    2.927    2.927        .   100.00   121.05    0.509
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.791     1000    0.000    0.001    0.001    0.003    0.000    17.37   266.33        .
  base                     0.297     1000    0.000    0.000    0.000    0.001    0.000     6.52   100.00        .
  init                     0.797     1000    0.000    0.001    0.001    0.002    0.000    17.50   268.35        .
  parse                    0.695     1000    0.000    0.001    0.001    0.003    0.000    15.26   234.01        .
  check                    2.645     1000    0.002    0.003    0.003    0.005    0.000    58.09   890.57        .
  - usefulness             1.101     1000    0.001    0.001    0.001    0.003    0.000    24.18   370.71        .
    - is_useful() 1        1.005     1000    0.000    0.001    0.001    0.003    0.000    22.07   338.38        .
  - combine                0.051     1000    0.000    0.000    0.000    0.001    0.000     1.12    17.17        .
  - exhaustiveness         1.428     1000    0.001    0.001    0.001    0.003    0.000    31.36   480.81        .
    - is_useful() 2        1.360     1000    0.001    0.001    0.001    0.002    0.000    29.87   457.91        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.11     1.68        .
  - print                  0.025     1000    0.000    0.000    0.000    0.001    0.000     0.55     8.42        .
  + Overlap()              1.289     1000    0.000    0.001    0.001    0.003    0.001    28.31   434.01        .
  + Difference()           0.769     1000    0.000    0.001    0.001    0.003    0.001    16.89   258.92        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.384     1000    0.000    0.000    0.000    0.001    0.000     8.43   129.29        .
  total                    4.553     1000    0.004    0.005    0.005    0.008    0.001   100.00  1533.00    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.112     1000    0.001    0.002    0.002    0.003    0.000    21.06    76.86        .
  base                     2.748     1000    0.002    0.003    0.003    0.006    0.001    27.41   100.00        .
  init                     3.507     1000    0.003    0.004    0.003    0.005    0.001    34.98   127.62        .
  parse                    0.746     1000    0.000    0.001    0.001    0.002    0.000     7.44    27.15        .
  check                    2.676     1000    0.002    0.003    0.003    0.004    0.000    26.69    97.38        .
  - usefulness             1.113     1000    0.001    0.001    0.001    0.002    0.000    11.10    40.50        .
    - is_useful() 1        1.019     1000    0.000    0.001    0.001    0.002    0.000    10.16    37.08        .
  - combine                0.042     1000    0.000    0.000    0.000    0.001    0.000     0.42     1.53        .
  - exhaustiveness         1.444     1000    0.001    0.001    0.001    0.003    0.000    14.40    52.55        .
    - is_useful() 2        1.387     1000    0.001    0.001    0.001    0.003    0.000    13.83    50.47        .
  - compress               0.007     1000    0.000    0.000    0.000    0.001    0.000     0.07     0.25        .
  - print                  0.018     1000    0.000    0.000    0.000    0.001    0.000     0.18     0.66        .
  + Overlap()              1.286     1000    0.000    0.001    0.001    0.004    0.001    12.83    46.80        .
  + Difference()           0.744     1000    0.000    0.001    0.001    0.002    0.001     7.42    27.07        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.069     1000    0.002    0.003    0.003    0.005    0.000    30.61   111.68        .
  total                   10.027     1000    0.009    0.010    0.010    0.012    0.001   100.00   364.88    0.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.577      100    0.014    0.016    0.016    0.019    0.001    12.59    27.15        .
  base                     5.808      100    0.056    0.058    0.058    0.065    0.001    46.36   100.00        .
  init                     6.214      100    0.059    0.062    0.062    0.070    0.002    49.60   106.99        .
  parse                    0.071      100    0.000    0.001    0.001    0.001    0.000     0.57     1.22        .
  check                    0.264      100    0.002    0.003    0.003    0.004    0.001     2.11     4.55        .
  - usefulness             0.110      100    0.001    0.001    0.001    0.002    0.000     0.88     1.89        .
    - is_useful() 1        0.096      100    0.000    0.001    0.001    0.002    0.000     0.77     1.65        .
  - combine                0.007      100    0.000    0.000    0.000    0.001    0.000     0.06     0.12        .
  - exhaustiveness         0.138      100    0.001    0.001    0.001    0.003    0.001     1.10     2.38        .
    - is_useful() 2        0.133      100    0.001    0.001    0.001    0.003    0.001     1.06     2.29        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.02        .
  + Overlap()              0.117      100    0.000    0.001    0.001    0.003    0.001     0.93     2.01        .
  + Difference()           0.080      100    0.000    0.001    0.001    0.004    0.001     0.64     1.38        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     5.974      100    0.057    0.060    0.060    0.064    0.001    47.69   102.86        .
  total                   12.527      100    0.121    0.125    0.125    0.134    0.002   100.00   215.69    0.067
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.879       10    0.176    0.188    0.187    0.202    0.007    30.55    74.98        .
  base                     2.506       10    0.249    0.251    0.250    0.253    0.001    40.74   100.00        .
  init                     3.608       10    0.354    0.361    0.360    0.369    0.004    58.66   143.97        .
  parse                    0.009       10    0.000    0.001    0.001    0.001    0.000     0.15     0.36        .
  check                    0.025       10    0.002    0.003    0.002    0.003    0.001     0.41     1.00        .
  - usefulness             0.011       10    0.001    0.001    0.001    0.002    0.000     0.18     0.44        .
    - is_useful() 1        0.008       10    0.000    0.001    0.001    0.001    0.000     0.13     0.32        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.014       10    0.001    0.001    0.001    0.002    0.001     0.23     0.56        .
    - is_useful() 2        0.014       10    0.001    0.001    0.001    0.002    0.001     0.23     0.56        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.012       10    0.000    0.001    0.001    0.003    0.001     0.20     0.48        .
  + Difference()           0.008       10    0.000    0.001    0.001    0.002    0.001     0.13     0.32        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.509       10    0.248    0.251    0.250    0.256    0.002    40.79   100.12        .
  total                    6.151       10    0.606    0.615    0.615    0.625    0.006   100.00   245.45    0.364
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.016        1    3.016    3.016    3.016    3.016        .    49.83   121.91        .
  base                     2.474        1    2.474    2.474    2.474    2.474        .    40.87   100.00        .
  init                     3.554        1    3.554    3.554    3.554    3.554        .    58.71   143.65        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  check                    0.003        1    0.003    0.003    0.003    0.003        .     0.05     0.12        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
    - is_useful() 1        0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.08        .
    - is_useful() 2        0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.08        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.003        1    0.003    0.003    0.003    0.003        .     0.05     0.12        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.495        1    2.495    2.495    2.495    2.495        .    41.22   100.85        .
  total                    6.053        1    6.053    6.053    6.053    6.053        .   100.00   244.66    3.579
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.272     1000    0.001    0.001    0.001    0.004    0.000    45.62   645.69        .
  base                     0.197     1000    0.000    0.000    0.000    0.001    0.000     7.07   100.00        .
  init                     0.512     1000    0.000    0.001    0.001    0.001    0.001    18.36   259.90        .
  parse                    0.452     1000    0.000    0.000    0.000    0.001    0.000    16.21   229.44        .
  check                    1.590     1000    0.001    0.002    0.002    0.003    0.001    57.03   807.11        .
  - usefulness             0.409     1000    0.000    0.000    0.000    0.001    0.000    14.67   207.61        .
    - is_useful() 1        0.364     1000    0.000    0.000    0.000    0.001    0.000    13.06   184.77        .
  - combine                0.020     1000    0.000    0.000    0.000    0.001    0.000     0.72    10.15        .
  - exhaustiveness         1.107     1000    0.001    0.001    0.001    0.002    0.000    39.71   561.93        .
    - is_useful() 2        1.040     1000    0.001    0.001    0.001    0.002    0.000    37.30   527.92        .
  - compress               0.003     1000    0.000    0.000    0.000    0.001    0.000     0.11     1.52        .
  - print                  0.009     1000    0.000    0.000    0.000    0.001    0.000     0.32     4.57        .
  + Overlap()              0.642     1000    0.000    0.001    0.001    0.002    0.001    23.03   325.89        .
  + Difference()           0.636     1000    0.000    0.001    0.001    0.002    0.001    22.81   322.84        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.205     1000    0.000    0.000    0.000    0.002    0.000     7.35   104.06        .
  total                    2.788     1000    0.002    0.003    0.003    0.005    0.000   100.00  1415.23    0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.995     1000    0.006    0.007    0.007    0.011    0.000    85.32   451.00        .
  base                     1.551     1000    0.001    0.002    0.002    0.003    0.001    18.92   100.00        .
  init                     4.553     1000    0.004    0.005    0.005    0.008    0.001    55.53   293.55        .
  parse                    0.443     1000    0.000    0.000    0.000    0.001    0.000     5.40    28.56        .
  check                    1.642     1000    0.001    0.002    0.002    0.003    0.000    20.03   105.87        .
  - usefulness             0.428     1000    0.000    0.000    0.000    0.001    0.000     5.22    27.60        .
    - is_useful() 1        0.384     1000    0.000    0.000    0.000    0.001    0.000     4.68    24.76        .
  - combine                0.024     1000    0.000    0.000    0.000    0.001    0.000     0.29     1.55        .
  - exhaustiveness         1.111     1000    0.001    0.001    0.001    0.003    0.000    13.55    71.63        .
    - is_useful() 2        1.057     1000    0.001    0.001    0.001    0.003    0.000    12.89    68.15        .
  - compress               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.07     0.39        .
  - print                  0.023     1000    0.000    0.000    0.000    0.001    0.000     0.28     1.48        .
  + Overlap()              0.689     1000    0.000    0.001    0.001    0.003    0.001     8.40    44.42        .
  + Difference()           0.626     1000    0.000    0.001    0.001    0.003    0.001     7.64    40.36        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.521     1000    0.001    0.002    0.002    0.004    0.001    18.55    98.07        .
  total                    8.199     1000    0.007    0.008    0.008    0.013    0.000   100.00   528.63    0.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.286      100    0.061    0.063    0.063    0.068    0.001    86.87   419.07        .
  base                     1.500      100    0.014    0.015    0.015    0.017    0.001    20.73   100.00        .
  init                     5.531      100    0.054    0.055    0.055    0.068    0.002    76.44   368.73        .
  parse                    0.052      100    0.000    0.001    0.001    0.001    0.001     0.72     3.47        .
  check                    0.157      100    0.001    0.002    0.002    0.002    0.000     2.17    10.47        .
  - usefulness             0.042      100    0.000    0.000    0.000    0.001    0.000     0.58     2.80        .
    - is_useful() 1        0.036      100    0.000    0.000    0.000    0.001    0.000     0.50     2.40        .
  - combine                0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.07        .
  - exhaustiveness         0.109      100    0.001    0.001    0.001    0.002    0.000     1.51     7.27        .
    - is_useful() 2        0.103      100    0.001    0.001    0.001    0.002    0.000     1.42     6.87        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.07        .
  + Overlap()              0.063      100    0.000    0.001    0.001    0.002    0.001     0.87     4.20        .
  + Difference()           0.060      100    0.000    0.001    0.001    0.002    0.001     0.83     4.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.494      100    0.014    0.015    0.015    0.018    0.001    20.65    99.60        .
  total                    7.236      100    0.070    0.072    0.072    0.084    0.002   100.00   482.40    0.057
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.059       10    0.692    0.706    0.705    0.728    0.011   115.91   472.17        .
  base                     1.495       10    0.148    0.149    0.150    0.151    0.001    24.55   100.00        .
  init                     4.592       10    0.451    0.459    0.459    0.463    0.004    75.40   307.16        .
  parse                    0.004       10    0.000    0.000    0.000    0.001    0.001     0.07     0.27        .
  check                    0.016       10    0.001    0.002    0.002    0.002    0.001     0.26     1.07        .
  - usefulness             0.006       10    0.000    0.001    0.001    0.001    0.001     0.10     0.40        .
    - is_useful() 1        0.006       10    0.000    0.001    0.001    0.001    0.001     0.10     0.40        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.010       10    0.001    0.001    0.001    0.001    0.000     0.16     0.67        .
    - is_useful() 2        0.010       10    0.001    0.001    0.001    0.001    0.000     0.16     0.67        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.008       10    0.000    0.001    0.001    0.002    0.001     0.13     0.54        .
  + Difference()           0.006       10    0.000    0.001    0.001    0.001    0.001     0.10     0.40        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.478       10    0.146    0.148    0.148    0.149    0.001    24.27    98.86        .
  total                    6.090       10    0.602    0.609    0.608    0.613    0.004   100.00   407.36    0.460
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.260        1    8.260    8.260    8.260    8.260        .   135.28   541.99        .
  base                     1.524        1    1.524    1.524    1.524    1.524        .    24.96   100.00        .
  init                     4.594        1    4.594    4.594    4.594    4.594        .    75.24   301.44        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.07        .
  check                    0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.13        .
  - usefulness             0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
    - is_useful() 1        0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.13        .
    - is_useful() 2        0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.13        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.509        1    1.509    1.509    1.509    1.509        .    24.71    99.02        .
  total                    6.106        1    6.106    6.106    6.106    6.106        .   100.00   400.66    4.582
-------------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.089      100    0.000    0.001    0.001    0.002    0.000     0.70    80.18        .
  base                     0.111      100    0.001    0.001    0.001    0.002    0.000     0.88   100.00        .
  init                     0.065      100    0.000    0.001    0.001    0.001    0.000     0.51    58.56        .
  parse                    0.320      100    0.003    0.003    0.003    0.005    0.000     2.52   288.29        .
  check                   12.129      100    0.118    0.121    0.121    0.127    0.002    95.67 10927.03        .
  - usefulness             4.542      100    0.044    0.045    0.045    0.052    0.001    35.83  4091.89        .
    - is_useful() 1        4.416      100    0.041    0.044    0.044    0.051    0.002    34.83  3978.38        .
  - combine                0.089      100    0.000    0.001    0.001    0.002    0.000     0.70    80.18        .
  - exhaustiveness         7.479      100    0.073    0.075    0.074    0.078    0.001    58.99  6737.84        .
    - is_useful() 2        7.422      100    0.072    0.074    0.074    0.078    0.001    58.54  6686.49        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.02     1.80        .
  - print                  0.009      100    0.000    0.000    0.000    0.001    0.000     0.07     8.11        .
  + Overlap()              5.808      100    0.050    0.058    0.058    0.070    0.004    45.81  5232.43        .
  + Difference()           5.045      100    0.044    0.050    0.050    0.058    0.003    39.79  4545.05        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.158      100    0.001    0.002    0.002    0.002    0.000     1.25   142.34        .
  total                   12.678      100    0.124    0.127    0.126    0.132    0.002   100.00 11421.62    0.126
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.196      100    0.001    0.002    0.002    0.003    0.000     1.46    18.60        .
  base                     1.054      100    0.010    0.011    0.010    0.012    0.001     7.88   100.00        .
  init                     0.163      100    0.001    0.002    0.002    0.002    0.000     1.22    15.46        .
  parse                    0.330      100    0.003    0.003    0.003    0.005    0.000     2.47    31.31        .
  check                   11.805      100    0.116    0.118    0.118    0.123    0.001    88.20  1120.02        .
  - usefulness             4.539      100    0.044    0.045    0.045    0.049    0.001    33.91   430.65        .
    - is_useful() 1        4.412      100    0.041    0.044    0.044    0.048    0.001    32.96   418.60        .
  - combine                0.087      100    0.000    0.001    0.001    0.002    0.000     0.65     8.25        .
  - exhaustiveness         7.158      100    0.070    0.072    0.071    0.077    0.001    53.48   679.13        .
    - is_useful() 2        7.094      100    0.069    0.071    0.071    0.076    0.001    53.00   673.06        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.01     0.19        .
  - print                  0.009      100    0.000    0.000    0.000    0.001    0.000     0.07     0.85        .
  + Overlap()              5.611      100    0.046    0.056    0.056    0.067    0.004    41.92   532.35        .
  + Difference()           4.926      100    0.042    0.049    0.050    0.056    0.003    36.81   467.36        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.082      100    0.010    0.011    0.011    0.013    0.001     8.08   102.66        .
  total                   13.384      100    0.131    0.134    0.133    0.139    0.002   100.00  1269.83    0.123
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.108       10    0.010    0.011    0.011    0.012    0.001     4.54    10.53        .
  base                     1.026       10    0.101    0.103    0.102    0.106    0.001    43.11   100.00        .
  init                     0.127       10    0.012    0.013    0.013    0.013    0.000     5.34    12.38        .
  parse                    0.034       10    0.003    0.003    0.003    0.004    0.001     1.43     3.31        .
  check                    1.181       10    0.116    0.118    0.118    0.120    0.001    49.62   115.11        .
  - usefulness             0.452       10    0.045    0.045    0.045    0.046    0.000    18.99    44.05        .
    - is_useful() 1        0.445       10    0.043    0.045    0.045    0.045    0.001    18.70    43.37        .
  - combine                0.009       10    0.000    0.001    0.001    0.001    0.000     0.38     0.88        .
  - exhaustiveness         0.716       10    0.070    0.072    0.072    0.073    0.001    30.08    69.79        .
    - is_useful() 2        0.710       10    0.069    0.071    0.071    0.073    0.001    29.83    69.20        .
  - compress               0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.10        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.10        .
  + Overlap()              0.555       10    0.050    0.056    0.055    0.062    0.004    23.32    54.09        .
  + Difference()           0.493       10    0.044    0.049    0.049    0.056    0.003    20.71    48.05        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.038       10    0.102    0.104    0.103    0.111    0.003    43.61   101.17        .
  total                    2.380       10    0.235    0.238    0.237    0.246    0.003   100.00   231.97    0.135
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.177        1    0.177    0.177    0.177    0.177        .    13.96    17.08        .
  base                     1.036        1    1.036    1.036    1.036    1.036        .    81.70   100.00        .
  init                     0.121        1    0.121    0.121    0.121    0.121        .     9.54    11.68        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.32     0.39        .
  check                    0.117        1    0.117    0.117    0.117    0.117        .     9.23    11.29        .
  - usefulness             0.045        1    0.045    0.045    0.045    0.045        .     3.55     4.34        .
    - is_useful() 1        0.043        1    0.043    0.043    0.043    0.043        .     3.39     4.15        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.08     0.10        .
  - exhaustiveness         0.071        1    0.071    0.071    0.071    0.071        .     5.60     6.85        .
    - is_useful() 2        0.071        1    0.071    0.071    0.071    0.071        .     5.60     6.85        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.054        1    0.054    0.054    0.054    0.054        .     4.26     5.21        .
  + Difference()           0.047        1    0.047    0.047    0.047    0.047        .     3.71     4.54        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.026        1    1.026    1.026    1.026    1.026        .    80.91    99.03        .
  total                    1.268        1    1.268    1.268    1.268    1.268        .   100.00   122.39    0.232
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.020        1    3.020    3.020    3.020    3.020        .    25.88    29.11        .
  base                    10.374        1   10.374   10.374   10.374   10.374        .    88.92   100.00        .
  init                     1.232        1    1.232    1.232    1.232    1.232        .    10.56    11.88        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.03     0.03        .
  check                    0.119        1    0.119    0.119    0.119    0.119        .     1.02     1.15        .
  - usefulness             0.048        1    0.048    0.048    0.048    0.048        .     0.41     0.46        .
    - is_useful() 1        0.047        1    0.047    0.047    0.047    0.047        .     0.40     0.45        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.070        1    0.070    0.070    0.070    0.070        .     0.60     0.67        .
    - is_useful() 2        0.070        1    0.070    0.070    0.070    0.070        .     0.60     0.67        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.064        1    0.064    0.064    0.064    0.064        .     0.55     0.62        .
  + Difference()           0.042        1    0.042    0.042    0.042    0.042        .     0.36     0.40        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.313        1   10.313   10.313   10.313   10.313        .    88.39    99.41        .
  total                   11.667        1   11.667   11.667   11.667   11.667        .   100.00   112.46    1.293
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.090      100    0.000    0.001    0.001    0.002    0.000     0.73    76.27        .
  base                     0.118      100    0.001    0.001    0.001    0.002    0.000     0.96   100.00        .
  init                     0.077      100    0.000    0.001    0.001    0.001    0.000     0.62    65.25        .
  parse                    0.327      100    0.003    0.003    0.003    0.004    0.000     2.65   277.12        .
  check                   11.773      100    0.115    0.118    0.117    0.123    0.002    95.37  9977.12        .
  - usefulness             4.515      100    0.044    0.045    0.045    0.049    0.001    36.57  3826.27        .
    - is_useful() 1        4.361      100    0.039    0.044    0.044    0.047    0.001    35.33  3695.76        .
  - combine                0.089      100    0.000    0.001    0.001    0.002    0.000     0.72    75.42        .
  - exhaustiveness         7.149      100    0.069    0.071    0.071    0.077    0.001    57.91  6058.47        .
    - is_useful() 2        7.101      100    0.069    0.071    0.071    0.077    0.001    57.52  6017.80        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.008      100    0.000    0.000    0.000    0.001    0.000     0.06     6.78        .
  + Overlap()              5.575      100    0.048    0.056    0.056    0.064    0.003    45.16  4724.58        .
  + Difference()           4.921      100    0.043    0.049    0.049    0.059    0.003    39.86  4170.34        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.165      100    0.001    0.002    0.002    0.003    0.001     1.34   139.83        .
  total                   12.345      100    0.121    0.123    0.123    0.129    0.002   100.00 10461.86    0.122
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.234      100    0.002    0.002    0.002    0.003    0.000     1.70    21.20        .
  base                     1.104      100    0.010    0.011    0.011    0.013    0.001     8.02   100.00        .
  init                     0.345      100    0.003    0.003    0.003    0.005    0.001     2.51    31.25        .
  parse                    0.332      100    0.003    0.003    0.003    0.004    0.000     2.41    30.07        .
  check                   11.807      100    0.115    0.118    0.118    0.124    0.002    85.75  1069.47        .
  - usefulness             4.547      100    0.044    0.045    0.045    0.049    0.001    33.02   411.87        .
    - is_useful() 1        4.425      100    0.041    0.044    0.044    0.048    0.002    32.14   400.82        .
  - combine                0.085      100    0.000    0.001    0.001    0.002    0.000     0.62     7.70        .
  - exhaustiveness         7.153      100    0.069    0.072    0.071    0.076    0.001    51.95   647.92        .
    - is_useful() 2        7.100      100    0.069    0.071    0.071    0.076    0.001    51.57   643.12        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.09        .
  - print                  0.005      100    0.000    0.000    0.000    0.001    0.000     0.04     0.45        .
  + Overlap()              5.546      100    0.042    0.055    0.056    0.067    0.004    40.28   502.36        .
  + Difference()           4.983      100    0.042    0.050    0.050    0.057    0.003    36.19   451.36        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.281      100    0.012    0.013    0.013    0.016    0.001     9.30   116.03        .
  total                   13.769      100    0.135    0.138    0.137    0.144    0.002   100.00  1247.19    0.127
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.162       10    0.016    0.016    0.016    0.017    0.000     3.55     5.98        .
  base                     2.709       10    0.266    0.271    0.270    0.284    0.005    59.38   100.00        .
  init                     0.590       10    0.055    0.059    0.059    0.062    0.002    12.93    21.78        .
  parse                    0.034       10    0.003    0.003    0.003    0.004    0.001     0.75     1.26        .
  check                    1.184       10    0.116    0.118    0.118    0.122    0.002    25.95    43.71        .
  - usefulness             0.458       10    0.044    0.046    0.045    0.048    0.001    10.04    16.91        .
    - is_useful() 1        0.445       10    0.042    0.045    0.044    0.048    0.002     9.75    16.43        .
  - combine                0.009       10    0.000    0.001    0.001    0.001    0.000     0.20     0.33        .
  - exhaustiveness         0.715       10    0.070    0.071    0.071    0.074    0.001    15.67    26.39        .
    - is_useful() 2        0.711       10    0.070    0.071    0.071    0.074    0.001    15.59    26.25        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.04        .
  + Overlap()              0.552       10    0.052    0.055    0.053    0.063    0.004    12.10    20.38        .
  + Difference()           0.498       10    0.046    0.050    0.049    0.053    0.003    10.92    18.38        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.751       10    0.272    0.275    0.274    0.280    0.003    60.30   101.55        .
  total                    4.562       10    0.451    0.456    0.455    0.460    0.003   100.00   168.40    0.185
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.202        1    0.202    0.202    0.202    0.202        .    13.56    19.02        .
  base                     1.062        1    1.062    1.062    1.062    1.062        .    71.28   100.00        .
  init                     0.321        1    0.321    0.321    0.321    0.321        .    21.54    30.23        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.27     0.38        .
  check                    0.117        1    0.117    0.117    0.117    0.117        .     7.85    11.02        .
  - usefulness             0.045        1    0.045    0.045    0.045    0.045        .     3.02     4.24        .
    - is_useful() 1        0.043        1    0.043    0.043    0.043    0.043        .     2.89     4.05        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.09        .
  - exhaustiveness         0.071        1    0.071    0.071    0.071    0.071        .     4.77     6.69        .
    - is_useful() 2        0.071        1    0.071    0.071    0.071    0.071        .     4.77     6.69        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.056        1    0.056    0.056    0.056    0.056        .     3.76     5.27        .
  + Difference()           0.050        1    0.050    0.050    0.050    0.050        .     3.36     4.71        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.048        1    1.048    1.048    1.048    1.048        .    70.34    98.68        .
  total                    1.490        1    1.490    1.490    1.490    1.490        .   100.00   140.30    0.428
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.046        1    3.046    3.046    3.046    3.046        .    22.15    29.24        .
  base                    10.416        1   10.416   10.416   10.416   10.416        .    75.73   100.00        .
  init                     3.268        1    3.268    3.268    3.268    3.268        .    23.76    31.37        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check                    0.118        1    0.118    0.118    0.118    0.118        .     0.86     1.13        .
  - usefulness             0.045        1    0.045    0.045    0.045    0.045        .     0.33     0.43        .
    - is_useful() 1        0.044        1    0.044    0.044    0.044    0.044        .     0.32     0.42        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.072        1    0.072    0.072    0.072    0.072        .     0.52     0.69        .
    - is_useful() 2        0.071        1    0.071    0.071    0.071    0.071        .     0.52     0.68        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.051        1    0.051    0.051    0.051    0.051        .     0.37     0.49        .
  + Difference()           0.050        1    0.050    0.050    0.050    0.050        .     0.36     0.48        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.365        1   10.365   10.365   10.365   10.365        .    75.36    99.51        .
  total                   13.754        1   13.754   13.754   13.754   13.754        .   100.00   132.05    3.338
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.160      100    0.001    0.002    0.002    0.003    0.001     1.15   115.94        .
  base                     0.138      100    0.001    0.001    0.001    0.004    0.001     0.99   100.00        .
  init                     0.092      100    0.000    0.001    0.001    0.005    0.001     0.66    66.67        .
  parse                    0.275      100    0.002    0.003    0.002    0.006    0.001     1.97   199.28        .
  check                   13.408      100    0.106    0.134    0.116    0.256    0.039    96.20  9715.94        .
  - usefulness             3.866      100    0.030    0.039    0.033    0.083    0.013    27.74  2801.45        .
    - is_useful() 1        3.795      100    0.028    0.038    0.033    0.081    0.013    27.23  2750.00        .
  - combine                0.036      100    0.000    0.000    0.000    0.001    0.000     0.26    26.09        .
  - exhaustiveness         9.483      100    0.076    0.095    0.082    0.175    0.027    68.04  6871.74        .
    - is_useful() 2        9.419      100    0.075    0.094    0.082    0.173    0.027    67.58  6825.36        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.01     1.45        .
  - print                  0.007      100    0.000    0.000    0.000    0.001    0.000     0.05     5.07        .
  + Overlap()              6.700      100    0.051    0.067    0.059    0.136    0.020    48.07  4855.07        .
  + Difference()           6.032      100    0.045    0.060    0.053    0.114    0.017    43.28  4371.01        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.161      100    0.001    0.002    0.001    0.005    0.001     1.16   116.67        .
  total                   13.938      100    0.110    0.139    0.120    0.266    0.041   100.00 10100.00    0.138
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.636      100    0.009    0.016    0.018    0.024    0.004     7.62    65.39        .
  base                     2.502      100    0.013    0.025    0.027    0.031    0.005    11.65   100.00        .
  init                     1.061      100    0.006    0.011    0.011    0.016    0.003     4.94    42.41        .
  parse                    0.409      100    0.002    0.004    0.004    0.007    0.001     1.90    16.35        .
  check                   18.217      100    0.134    0.182    0.183    0.243    0.026    84.83   728.10        .
  - usefulness             5.251      100    0.038    0.053    0.046    0.084    0.013    24.45   209.87        .
    - is_useful() 1        5.147      100    0.035    0.051    0.046    0.083    0.013    23.97   205.72        .
  - combine                0.051      100    0.000    0.001    0.001    0.001    0.001     0.24     2.04        .
  - exhaustiveness        12.883      100    0.094    0.129    0.127    0.179    0.021    59.99   514.91        .
    - is_useful() 2       12.799      100    0.094    0.128    0.126    0.178    0.021    59.60   511.55        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.01     0.08        .
  - print                  0.009      100    0.000    0.000    0.000    0.001    0.000     0.04     0.36        .
  + Overlap()              8.987      100    0.062    0.090    0.088    0.121    0.014    41.85   359.19        .
  + Difference()           8.331      100    0.061    0.083    0.083    0.124    0.014    38.79   332.97        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.786      100    0.012    0.018    0.014    0.032    0.006     8.32    71.38        .
  total                   21.475      100    0.157    0.215    0.215    0.290    0.028   100.00   858.31    0.190
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.204       10    0.098    0.120    0.112    0.149    0.017    26.44    69.12        .
  base                     1.742       10    0.148    0.174    0.158    0.247    0.031    38.25   100.00        .
  init                     1.049       10    0.078    0.105    0.098    0.138    0.019    23.03    60.22        .
  parse                    0.037       10    0.002    0.004    0.003    0.007    0.002     0.81     2.12        .
  check                    1.759       10    0.138    0.176    0.163    0.249    0.035    38.63   100.98        .
  - usefulness             0.495       10    0.038    0.050    0.042    0.067    0.012    10.87    28.42        .
    - is_useful() 1        0.486       10    0.036    0.049    0.041    0.066    0.012    10.67    27.90        .
  - combine                0.006       10    0.000    0.001    0.001    0.001    0.001     0.13     0.34        .
  - exhaustiveness         1.254       10    0.098    0.125    0.115    0.181    0.029    27.54    71.99        .
    - is_useful() 2        1.243       10    0.097    0.124    0.113    0.180    0.029    27.29    71.35        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.06        .
  + Overlap()              0.878       10    0.069    0.088    0.079    0.122    0.020    19.28    50.40        .
  + Difference()           0.805       10    0.061    0.081    0.076    0.112    0.015    17.68    46.21        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.708       10    0.125    0.171    0.169    0.202    0.023    37.51    98.05        .
  total                    4.554       10    0.376    0.455    0.442    0.521    0.048   100.00   261.42    0.281
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.251        1    1.251    1.251    1.251    1.251        .    43.27    82.63        .
  base                     1.514        1    1.514    1.514    1.514    1.514        .    52.37   100.00        .
  init                     0.867        1    0.867    0.867    0.867    0.867        .    29.99    57.27        .
  parse                    0.006        1    0.006    0.006    0.006    0.006        .     0.21     0.40        .
  check                    0.170        1    0.170    0.170    0.170    0.170        .     5.88    11.23        .
  - usefulness             0.050        1    0.050    0.050    0.050    0.050        .     1.73     3.30        .
    - is_useful() 1        0.048        1    0.048    0.048    0.048    0.048        .     1.66     3.17        .
  - combine                0.002        1    0.002    0.002    0.002    0.002        .     0.07     0.13        .
  - exhaustiveness         0.118        1    0.118    0.118    0.118    0.118        .     4.08     7.79        .
    - is_useful() 2        0.117        1    0.117    0.117    0.117    0.117        .     4.05     7.73        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.084        1    0.084    0.084    0.084    0.084        .     2.91     5.55        .
  + Difference()           0.074        1    0.074    0.074    0.074    0.074        .     2.56     4.89        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.848        1    1.848    1.848    1.848    1.848        .    63.92   122.06        .
  total                    2.891        1    2.891    2.891    2.891    2.891        .   100.00   190.95    1.377
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              13.601        1   13.601   13.601   13.601   13.601        .    77.16    77.47        .
  base                    17.557        1   17.557   17.557   17.557   17.557        .    99.60   100.00        .
  init                     7.381        1    7.381    7.381    7.381    7.381        .    41.87    42.04        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.01        .
  check                    0.115        1    0.115    0.115    0.115    0.115        .     0.65     0.66        .
  - usefulness             0.031        1    0.031    0.031    0.031    0.031        .     0.18     0.18        .
    - is_useful() 1        0.030        1    0.030    0.030    0.030    0.030        .     0.17     0.17        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.084        1    0.084    0.084    0.084    0.084        .     0.48     0.48        .
    - is_useful() 2        0.084        1    0.084    0.084    0.084    0.084        .     0.48     0.48        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.053        1    0.053    0.053    0.053    0.053        .     0.30     0.30        .
  + Difference()           0.053        1    0.053    0.053    0.053    0.053        .     0.30     0.30        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.130        1   10.130   10.130   10.130   10.130        .    57.47    57.70        .
  total                   17.628        1   17.628   17.628   17.628   17.628        .   100.00   100.40    0.071
-------------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.01    20.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.03   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.00    10.00        .
  parse                    0.152        1    0.152    0.152    0.152    0.152        .     0.45  1520.00        .
  check                   33.608        1   33.608   33.608   33.608   33.608        .    99.49  3.4e+05        .
  - usefulness            20.505        1   20.505   20.505   20.505   20.505        .    60.70  2.1e+05        .
    - is_useful() 1       20.267        1   20.267   20.267   20.267   20.267        .    60.00  2.0e+05        .
  - combine                0.168        1    0.168    0.168    0.168    0.168        .     0.50  1680.00        .
  - exhaustiveness        12.930        1   12.930   12.930   12.930   12.930        .    38.28  1.3e+05        .
    - is_useful() 2       12.922        1   12.922   12.922   12.922   12.922        .    38.25  1.3e+05        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.002        1    0.002    0.002    0.002    0.002        .     0.01    20.00        .
  + Overlap()             15.562        1   15.562   15.562   15.562   15.562        .    46.07  1.6e+05        .
  + Difference()           8.475        1    8.475    8.475    8.475    8.475        .    25.09 84750.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.016        1    0.016    0.016    0.016    0.016        .     0.05   160.00        .
  total                   33.779        1   33.779   33.779   33.779   33.779        .   100.00  3.4e+05   33.769
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.003        1    0.003    0.003    0.003    0.003        .     0.01     2.19        .
  base                     0.137        1    0.137    0.137    0.137    0.137        .     0.30   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.00     1.46        .
  parse                    0.293        1    0.293    0.293    0.293    0.293        .     0.63   213.87        .
  check                   45.759        1   45.759   45.759   45.759   45.759        .    99.02 33400.73        .
  - usefulness            31.955        1   31.955   31.955   31.955   31.955        .    69.15 23324.82        .
    - is_useful() 1       31.610        1   31.610   31.610   31.610   31.610        .    68.40 23072.99        .
  - combine                0.171        1    0.171    0.171    0.171    0.171        .     0.37   124.82        .
  - exhaustiveness        13.629        1   13.629   13.629   13.629   13.629        .    29.49  9948.18        .
    - is_useful() 2       13.619        1   13.619   13.619   13.619   13.619        .    29.47  9940.88        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.73        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.73        .
  + Overlap()             21.363        1   21.363   21.363   21.363   21.363        .    46.23 15593.43        .
  + Difference()           9.454        1    9.454    9.454    9.454    9.454        .    20.46  6900.73        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.158        1    0.158    0.158    0.158    0.158        .     0.34   115.33        .
  total                   46.212        1   46.212   46.212   46.212   46.212        .   100.00 33731.39   46.075
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.028        1    0.028    0.028    0.028    0.028        .     0.06     1.73        .
  base                     1.620        1    1.620    1.620    1.620    1.620        .     3.33   100.00        .
  init                     0.016        1    0.016    0.016    0.016    0.016        .     0.03     0.99        .
  parse                    0.229        1    0.229    0.229    0.229    0.229        .     0.47    14.14        .
  check                   46.844        1   46.844   46.844   46.844   46.844        .    96.28  2891.60        .
  - usefulness            33.635        1   33.635   33.635   33.635   33.635        .    69.13  2076.23        .
    - is_useful() 1       33.273        1   33.273   33.273   33.273   33.273        .    68.39  2053.89        .
  - combine                0.199        1    0.199    0.199    0.199    0.199        .     0.41    12.28        .
  - exhaustiveness        13.006        1   13.006   13.006   13.006   13.006        .    26.73   802.84        .
    - is_useful() 2       12.996        1   12.996   12.996   12.996   12.996        .    26.71   802.22        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.06        .
  + Overlap()             21.900        1   21.900   21.900   21.900   21.900        .    45.01  1351.85        .
  + Difference()           9.351        1    9.351    9.351    9.351    9.351        .    19.22   577.22        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.563        1    1.563    1.563    1.563    1.563        .     3.21    96.48        .
  total                   48.652        1   48.652   48.652   48.652   48.652        .   100.00  3003.21   47.032
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.313        1    0.313    0.313    0.313    0.313        .     0.51     2.04        .
  base                    15.314        1   15.314   15.314   15.314   15.314        .    25.17   100.00        .
  init                     0.236        1    0.236    0.236    0.236    0.236        .     0.39     1.54        .
  parse                    0.255        1    0.255    0.255    0.255    0.255        .     0.42     1.67        .
  check                   45.732        1   45.732   45.732   45.732   45.732        .    75.17   298.63        .
  - usefulness            32.583        1   32.583   32.583   32.583   32.583        .    53.56   212.77        .
    - is_useful() 1       32.222        1   32.222   32.222   32.222   32.222        .    52.97   210.41        .
  - combine                0.238        1    0.238    0.238    0.238    0.238        .     0.39     1.55        .
  - exhaustiveness        12.907        1   12.907   12.907   12.907   12.907        .    21.22    84.28        .
    - is_useful() 2       12.894        1   12.894   12.894   12.894   12.894        .    21.20    84.20        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()             21.331        1   21.331   21.331   21.331   21.331        .    35.06   139.29        .
  + Difference()           9.287        1    9.287    9.287    9.287    9.287        .    15.27    60.64        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    14.612        1   14.612   14.612   14.612   14.612        .    24.02    95.42        .
  total                   60.835        1   60.835   60.835   60.835   60.835        .   100.00   397.25   45.521
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_integer, obs(10000000) levels(1000) rep(1)
. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.00     8.33        .
  base                     0.012        1    0.012    0.012    0.012    0.012        .     0.04   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.00     8.33        .
  parse                    0.200        1    0.200    0.200    0.200    0.200        .     0.59  1666.67        .
  check                   33.972        1   33.972   33.972   33.972   33.972        .    99.37  2.8e+05        .
  - usefulness            26.425        1   26.425   26.425   26.425   26.425        .    77.30  2.2e+05        .
    - is_useful() 1       26.103        1   26.103   26.103   26.103   26.103        .    76.35  2.2e+05        .
  - combine                0.117        1    0.117    0.117    0.117    0.117        .     0.34   975.00        .
  - exhaustiveness         7.427        1    7.427    7.427    7.427    7.427        .    21.72 61891.67        .
    - is_useful() 2        7.420        1    7.420    7.420    7.420    7.420        .    21.70 61833.33        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     8.33        .
  + Overlap()             16.529        1   16.529   16.529   16.529   16.529        .    48.35  1.4e+05        .
  + Difference()           5.205        1    5.205    5.205    5.205    5.205        .    15.23 43375.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.04   108.33        .
  total                   34.187        1   34.187   34.187   34.187   34.187        .   100.00  2.8e+05   34.175
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.003        1    0.003    0.003    0.003    0.003        .     0.01     2.97        .
  base                     0.101        1    0.101    0.101    0.101    0.101        .     0.37   100.00        .
  init                     0.004        1    0.004    0.004    0.004    0.004        .     0.01     3.96        .
  parse                    0.137        1    0.137    0.137    0.137    0.137        .     0.50   135.64        .
  check                   27.333        1   27.333   27.333   27.333   27.333        .    99.10 27062.38        .
  - usefulness            18.973        1   18.973   18.973   18.973   18.973        .    68.79 18785.15        .
    - is_useful() 1       18.739        1   18.739   18.739   18.739   18.739        .    67.94 18553.47        .
  - combine                0.118        1    0.118    0.118    0.118    0.118        .     0.43   116.83        .
  - exhaustiveness         8.239        1    8.239    8.239    8.239    8.239        .    29.87  8157.43        .
    - is_useful() 2        8.232        1    8.232    8.232    8.232    8.232        .    29.85  8150.50        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.99        .
  + Overlap()             12.936        1   12.936   12.936   12.936   12.936        .    46.90 12807.92        .
  + Difference()           5.492        1    5.492    5.492    5.492    5.492        .    19.91  5437.62        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.105        1    0.105    0.105    0.105    0.105        .     0.38   103.96        .
  total                   27.580        1   27.580   27.580   27.580   27.580        .   100.00 27306.93   27.479
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.015        1    0.015    0.015    0.015    0.015        .     0.04     0.90        .
  base                     1.673        1    1.673    1.673    1.673    1.673        .     4.15   100.00        .
  init                     0.083        1    0.083    0.083    0.083    0.083        .     0.21     4.96        .
  parse                    0.239        1    0.239    0.239    0.239    0.239        .     0.59    14.29        .
  check                   38.171        1   38.171   38.171   38.171   38.171        .    94.76  2281.59        .
  - usefulness            25.218        1   25.218   25.218   25.218   25.218        .    62.60  1507.35        .
    - is_useful() 1       24.920        1   24.920   24.920   24.920   24.920        .    61.86  1489.54        .
  - combine                0.164        1    0.164    0.164    0.164    0.164        .     0.41     9.80        .
  - exhaustiveness        12.784        1   12.784   12.784   12.784   12.784        .    31.74   764.14        .
    - is_useful() 2       12.774        1   12.774   12.774   12.774   12.774        .    31.71   763.54        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.06        .
  - print                  0.002        1    0.002    0.002    0.002    0.002        .     0.00     0.12        .
  + Overlap()             17.931        1   17.931   17.931   17.931   17.931        .    44.51  1071.79        .
  + Difference()           8.529        1    8.529    8.529    8.529    8.529        .    21.17   509.80        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.787        1    1.787    1.787    1.787    1.787        .     4.44   106.81        .
  total                   40.283        1   40.283   40.283   40.283   40.283        .   100.00  2407.83   38.610
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.281        1    0.281    0.281    0.281    0.281        .     0.52     1.84        .
  base                    15.270        1   15.270   15.270   15.270   15.270        .    28.06   100.00        .
  init                     0.464        1    0.464    0.464    0.464    0.464        .     0.85     3.04        .
  parse                    0.231        1    0.231    0.231    0.231    0.231        .     0.42     1.51        .
  check                   44.736        1   44.736   44.736   44.736   44.736        .    82.20   292.97        .
  - usefulness            31.423        1   31.423   31.423   31.423   31.423        .    57.74   205.78        .
    - is_useful() 1       31.073        1   31.073   31.073   31.073   31.073        .    57.10   203.49        .
  - combine                0.172        1    0.172    0.172    0.172    0.172        .     0.32     1.13        .
  - exhaustiveness        13.138        1   13.138   13.138   13.138   13.138        .    24.14    86.04        .
    - is_useful() 2       13.130        1   13.130   13.130   13.130   13.130        .    24.13    85.99        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()             20.608        1   20.608   20.608   20.608   20.608        .    37.87   134.96        .
  + Difference()           9.573        1    9.573    9.573    9.573    9.573        .    17.59    62.69        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     8.991        1    8.991    8.991    8.991    8.991        .    16.52    58.88        .
  total                   54.422        1   54.422   54.422   54.422   54.422        .   100.00   356.40   39.152
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_float,   obs(10000000) levels(1000) rep(1)
. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.06   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  parse                    0.069        1    0.069    0.069    0.069    0.069        .     0.44   690.00        .
  check                   15.775        1   15.775   15.775   15.775   15.775        .    99.48  1.6e+05        .
  - usefulness             7.718        1    7.718    7.718    7.718    7.718        .    48.67 77180.00        .
    - is_useful() 1        7.634        1    7.634    7.634    7.634    7.634        .    48.14 76340.00        .
  - combine                0.047        1    0.047    0.047    0.047    0.047        .     0.30   470.00        .
  - exhaustiveness         8.007        1    8.007    8.007    8.007    8.007        .    50.50 80070.00        .
    - is_useful() 2        8.001        1    8.001    8.001    8.001    8.001        .    50.46 80010.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  + Overlap()              7.694        1    7.694    7.694    7.694    7.694        .    48.52 76940.00        .
  + Difference()           5.125        1    5.125    5.125    5.125    5.125        .    32.32 51250.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.012        1    0.012    0.012    0.012    0.012        .     0.08   120.00        .
  total                   15.857        1   15.857   15.857   15.857   15.857        .   100.00  1.6e+05   15.847
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.007        1    0.007    0.007    0.007    0.007        .     0.04     7.00        .
  base                     0.100        1    0.100    0.100    0.100    0.100        .     0.63   100.00        .
  init                     0.006        1    0.006    0.006    0.006    0.006        .     0.04     6.00        .
  parse                    0.065        1    0.065    0.065    0.065    0.065        .     0.41    65.00        .
  check                   15.739        1   15.739   15.739   15.739   15.739        .    98.92 15739.00        .
  - usefulness             7.737        1    7.737    7.737    7.737    7.737        .    48.63  7737.00        .
    - is_useful() 1        7.644        1    7.644    7.644    7.644    7.644        .    48.04  7644.00        .
  - combine                0.049        1    0.049    0.049    0.049    0.049        .     0.31    49.00        .
  - exhaustiveness         7.950        1    7.950    7.950    7.950    7.950        .    49.97  7950.00        .
    - is_useful() 2        7.945        1    7.945    7.945    7.945    7.945        .    49.93  7945.00        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              7.669        1    7.669    7.669    7.669    7.669        .    48.20  7669.00        .
  + Difference()           5.080        1    5.080    5.080    5.080    5.080        .    31.93  5080.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.101        1    0.101    0.101    0.101    0.101        .     0.63   101.00        .
  total                   15.911        1   15.911   15.911   15.911   15.911        .   100.00 15911.00   15.811
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.069        1    0.069    0.069    0.069    0.069        .     0.41     7.12        .
  base                     0.969        1    0.969    0.969    0.969    0.969        .     5.75   100.00        .
  init                     0.067        1    0.067    0.067    0.067    0.067        .     0.40     6.91        .
  parse                    0.064        1    0.064    0.064    0.064    0.064        .     0.38     6.60        .
  check                   15.749        1   15.749   15.749   15.749   15.749        .    93.50  1625.28        .
  - usefulness             7.760        1    7.760    7.760    7.760    7.760        .    46.07   800.83        .
    - is_useful() 1        7.677        1    7.677    7.677    7.677    7.677        .    45.58   792.26        .
  - combine                0.047        1    0.047    0.047    0.047    0.047        .     0.28     4.85        .
  - exhaustiveness         7.940        1    7.940    7.940    7.940    7.940        .    47.14   819.40        .
    - is_useful() 2        7.934        1    7.934    7.934    7.934    7.934        .    47.10   818.78        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.21        .
  + Overlap()              7.774        1    7.774    7.774    7.774    7.774        .    46.15   802.27        .
  + Difference()           5.068        1    5.068    5.068    5.068    5.068        .    30.09   523.01        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.963        1    0.963    0.963    0.963    0.963        .     5.72    99.38        .
  total                   16.844        1   16.844   16.844   16.844   16.844        .   100.00  1738.29   15.875
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.724        1    0.724    0.724    0.724    0.724        .     1.62     7.30        .
  base                     9.917        1    9.917    9.917    9.917    9.917        .    22.15   100.00        .
  init                     0.813        1    0.813    0.813    0.813    0.813        .     1.82     8.20        .
  parse                    0.116        1    0.116    0.116    0.116    0.116        .     0.26     1.17        .
  check                   27.582        1   27.582   27.582   27.582   27.582        .    61.61   278.13        .
  - usefulness            13.290        1   13.290   13.290   13.290   13.290        .    29.69   134.01        .
    - is_useful() 1       13.142        1   13.142   13.142   13.142   13.142        .    29.35   132.52        .
  - combine                0.065        1    0.065    0.065    0.065    0.065        .     0.15     0.66        .
  - exhaustiveness        14.224        1   14.224   14.224   14.224   14.224        .    31.77   143.43        .
    - is_useful() 2       14.214        1   14.214   14.214   14.214   14.214        .    31.75   143.33        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()             13.404        1   13.404   13.404   13.404   13.404        .    29.94   135.16        .
  + Difference()           9.167        1    9.167    9.167    9.167    9.167        .    20.48    92.44        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    16.259        1   16.259   16.259   16.259   16.259        .    36.32   163.95        .
  total                   44.770        1   44.770   44.770   44.770   44.770        .   100.00   451.45   34.853
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_string,  obs(10000000) levels(1000) rep(1)
. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.973     1000    0.000    0.001    0.001    0.004    0.001    41.98   144.79        .
  base                     0.672     1000    0.000    0.001    0.001    0.003    0.001    28.99   100.00        .
  init                     0.159     1000    0.000    0.000    0.000    0.002    0.000     6.86    23.66        .
  parse                    1.331     1000    0.000    0.001    0.001    0.004    0.001    57.42   198.07        .
  check                    0.011     1000    0.000    0.000    0.000    0.001    0.000     0.47     1.64        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.769     1000    0.000    0.001    0.001    0.003    0.000    33.18   114.43        .
  total                    2.318     1000    0.001    0.002    0.002    0.006    0.001   100.00   344.94    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.555     1000    0.002    0.004    0.004    0.006    0.001    41.84    53.39        .
  base                     6.658     1000    0.003    0.007    0.007    0.015    0.001    78.37   100.00        .
  init                     0.207     1000    0.000    0.000    0.000    0.001    0.000     2.44     3.11        .
  parse                    1.613     1000    0.000    0.002    0.002    0.005    0.001    18.99    24.23        .
  check                    0.004     1000    0.000    0.000    0.000    0.001    0.000     0.05     0.06        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     6.603     1000    0.003    0.007    0.007    0.015    0.001    77.72    99.17        .
  total                    8.496     1000    0.004    0.008    0.009    0.019    0.002   100.00   127.61    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.162      100    0.012    0.022    0.023    0.032    0.005    51.31    44.23        .
  base                     4.888      100    0.030    0.049    0.048    0.071    0.011   115.99   100.00        .
  init                     0.007      100    0.000    0.000    0.000    0.001    0.000     0.17     0.14        .
  parse                    0.118      100    0.000    0.001    0.001    0.002    0.001     2.80     2.41        .
  check                    0.001      100    0.000    0.000    0.000    0.001    0.000     0.02     0.02        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     4.085      100    0.029    0.041    0.035    0.066    0.012    96.94    83.57        .
  total                    4.214      100    0.030    0.042    0.037    0.068    0.012   100.00    86.21   -0.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.175       10    0.254    0.318    0.303    0.371    0.043    71.69    69.17        .
  base                     4.590       10    0.399    0.459    0.446    0.520    0.044   103.64   100.00        .
  init                     0.002       10    0.000    0.000    0.000    0.001    0.000     0.05     0.04        .
  parse                    0.014       10    0.001    0.001    0.001    0.003    0.001     0.32     0.31        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     4.413       10    0.371    0.441    0.447    0.499    0.043    99.64    96.14        .
  total                    4.429       10    0.372    0.443    0.449    0.502    0.044   100.00    96.49   -0.016
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               4.463        1    4.463    4.463    4.463    4.463        .    90.71    86.49        .
  base                     5.160        1    5.160    5.160    5.160    5.160        .   104.88   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.02        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     4.919        1    4.919    4.919    4.919    4.919        .    99.98    95.33        .
  total                    4.920        1    4.920    4.920    4.920    4.920        .   100.00    95.35   -0.240
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.037     1000    0.000    0.001    0.001    0.006    0.000    43.23   152.95        .
  base                     0.678     1000    0.000    0.001    0.001    0.003    0.001    28.26   100.00        .
  init                     0.167     1000    0.000    0.000    0.000    0.003    0.000     6.96    24.63        .
  parse                    1.345     1000    0.000    0.001    0.001    0.004    0.001    56.07   198.38        .
  check                    0.015     1000    0.000    0.000    0.000    0.001    0.000     0.63     2.21        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.820     1000    0.000    0.001    0.001    0.006    0.001    34.18   120.94        .
  total                    2.399     1000    0.001    0.002    0.002    0.009    0.001   100.00   353.83    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.940     1000    0.002    0.004    0.004    0.008    0.001    42.32    54.59        .
  base                     7.218     1000    0.003    0.007    0.008    0.016    0.002    77.53   100.00        .
  init                     0.208     1000    0.000    0.000    0.000    0.001    0.000     2.23     2.88        .
  parse                    1.575     1000    0.000    0.002    0.002    0.004    0.001    16.92    21.82        .
  check                    0.007     1000    0.000    0.000    0.000    0.001    0.000     0.08     0.10        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     7.427     1000    0.003    0.007    0.008    0.014    0.002    79.77   102.90        .
  total                    9.310     1000    0.004    0.009    0.010    0.017    0.002   100.00   128.98    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.175      100    0.019    0.032    0.033    0.042    0.006    33.99    32.85        .
  base                     9.664      100    0.067    0.097    0.095    0.141    0.017   103.46   100.00        .
  init                     0.017      100    0.000    0.000    0.000    0.001    0.000     0.18     0.18        .
  parse                    0.129      100    0.000    0.001    0.001    0.003    0.001     1.38     1.33        .
  check                    0.002      100    0.000    0.000    0.000    0.001    0.000     0.02     0.02        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     9.188      100    0.069    0.092    0.090    0.131    0.018    98.36    95.07        .
  total                    9.341      100    0.070    0.093    0.091    0.132    0.018   100.00    96.66   -0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.984       10    0.275    0.298    0.299    0.327    0.019    65.50    66.61        .
  base                     4.480       10    0.338    0.448    0.416    0.545    0.061    98.33   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.02        .
  parse                    0.011       10    0.000    0.001    0.001    0.002    0.001     0.24     0.25        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     4.543       10    0.418    0.454    0.434    0.531    0.041    99.71   101.41        .
  total                    4.556       10    0.419    0.456    0.435    0.532    0.041   100.00   101.70    0.008
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.029        1    5.029    5.029    5.029    5.029        .   121.94   117.97        .
  base                     4.263        1    4.263    4.263    4.263    4.263        .   103.37   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.02        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     4.123        1    4.123    4.123    4.123    4.123        .    99.98    96.72        .
  total                    4.124        1    4.124    4.124    4.124    4.124        .   100.00    96.74   -0.139
-------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.086     1000    0.001    0.002    0.002    0.005    0.001    99.05   541.82        .
  base                     0.385     1000    0.000    0.000    0.000    0.002    0.000    18.28   100.00        .
  init                     0.160     1000    0.000    0.000    0.000    0.003    0.000     7.60    41.56        .
  parse                    1.434     1000    0.000    0.001    0.001    0.005    0.001    68.09   372.47        .
  check                    0.013     1000    0.000    0.000    0.000    0.001    0.000     0.62     3.38        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.450     1000    0.000    0.000    0.000    0.001    0.000    21.37   116.88        .
  total                    2.106     1000    0.001    0.002    0.002    0.006    0.001   100.00   547.01    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              16.971     1000    0.006    0.017    0.019    0.030    0.005   284.99   419.35        .
  base                     4.047     1000    0.001    0.004    0.004    0.009    0.001    67.96   100.00        .
  init                     0.200     1000    0.000    0.000    0.000    0.001    0.000     3.36     4.94        .
  parse                    1.744     1000    0.000    0.002    0.002    0.005    0.001    29.29    43.09        .
  check                    0.009     1000    0.000    0.000    0.000    0.001    0.000     0.15     0.22        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.938     1000    0.001    0.004    0.004    0.009    0.001    66.13    97.31        .
  total                    5.955     1000    0.002    0.006    0.007    0.013    0.002   100.00   147.15    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.325      100    0.061    0.063    0.063    0.071    0.002   400.57   419.71        .
  base                     1.507      100    0.014    0.015    0.015    0.017    0.001    95.44   100.00        .
  init                     0.015      100    0.000    0.000    0.000    0.001    0.000     0.95     1.00        .
  parse                    0.068      100    0.000    0.001    0.001    0.001    0.000     4.31     4.51        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.493      100    0.014    0.015    0.015    0.018    0.001    94.55    99.07        .
  total                    1.579      100    0.015    0.016    0.016    0.019    0.001   100.00   104.78    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.040       10    0.690    0.704    0.702    0.714    0.007   473.44   467.15        .
  base                     1.507       10    0.148    0.151    0.150    0.156    0.003   101.34   100.00        .
  init                     0.002       10    0.000    0.000    0.000    0.001    0.000     0.13     0.13        .
  parse                    0.007       10    0.000    0.001    0.001    0.001    0.000     0.47     0.46        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.478       10    0.146    0.148    0.147    0.151    0.002    99.39    98.08        .
  total                    1.487       10    0.147    0.149    0.148    0.152    0.002   100.00    98.67   -0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.294        1    8.294    8.294    8.294    8.294        .   543.51   538.92        .
  base                     1.539        1    1.539    1.539    1.539    1.539        .   100.85   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.06        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.525        1    1.525    1.525    1.525    1.525        .    99.93    99.09        .
  total                    1.526        1    1.526    1.526    1.526    1.526        .   100.00    99.16   -0.013
-------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:   6 Oct 2024, 19:21:07
-----------------------------------------------------------------------------------------------------------------------------------------------------
