---------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  19 Aug 2024, 18:10:06

. 
. dis "`c(current_date)'"
19 Aug 2024

. dis "`c(current_time)'"
18:10:06

. 
. profile_obs_integer, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.199     1000    0.000    0.000    0.000    0.002    0.000     4.10   100.00        .
        init          0.204     1000    0.000    0.000    0.000    0.002    0.000     4.21   102.51        .
       parse          0.583     1000    0.000    0.001    0.001    0.006    0.001    12.02   292.96        .
       check          3.311     1000    0.002    0.003    0.003    0.008    0.001    68.28  1663.82        .
        eval          0.591     1000    0.000    0.001    0.000    0.042    0.002    12.19   296.98        .
       total          4.849     1000    0.003    0.005    0.004    0.051    0.002   100.00  2436.68    0.005
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.756     1000    0.001    0.002    0.002    0.004    0.001    23.14   100.00        .
        init          1.459     1000    0.001    0.001    0.001    0.003    0.001    19.22    83.09        .
       parse          0.539     1000    0.000    0.001    0.001    0.001    0.000     7.10    30.69        .
       check          3.097     1000    0.002    0.003    0.003    0.005    0.000    40.80   176.37        .
        eval          2.346     1000    0.001    0.002    0.002    0.008    0.001    30.91   133.60        .
       total          7.590     1000    0.006    0.008    0.007    0.013    0.001   100.00   432.23    0.006
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.660      100    0.015    0.017    0.016    0.020    0.001    43.83   100.00        .
        init          1.408      100    0.013    0.014    0.014    0.016    0.001    37.18    84.82        .
       parse          0.062      100    0.000    0.001    0.001    0.001    0.000     1.64     3.73        .
       check          0.309      100    0.002    0.003    0.003    0.007    0.001     8.16    18.61        .
        eval          1.997      100    0.018    0.020    0.020    0.028    0.001    52.73   120.30        .
       total          3.787      100    0.036    0.038    0.038    0.046    0.002   100.00   228.13    0.021
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.460       10    0.140    0.146    0.145    0.154    0.005    51.01   100.00        .
        init          1.230       10    0.119    0.123    0.123    0.127    0.002    42.98    84.25        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.24     0.48        .
       check          0.031       10    0.003    0.003    0.003    0.004    0.000     1.08     2.12        .
        eval          1.592       10    0.156    0.159    0.159    0.162    0.002    55.63   109.04        .
       total          2.862       10    0.281    0.286    0.286    0.291    0.003   100.00   196.03    0.140
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.193       10    1.407    1.419    1.412    1.445    0.012    50.72   100.00        .
        init         12.184       10    1.194    1.218    1.222    1.240    0.016    43.54    85.85        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.02     0.04        .
       check          0.030       10    0.003    0.003    0.003    0.003    0.000     0.11     0.21        .
        eval         15.760       10    1.557    1.576    1.574    1.590    0.010    56.32   111.04        .
       total         27.985       10    2.773    2.798    2.795    2.819    0.015   100.00   197.17    1.379
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.200     1000    0.000    0.000    0.000    0.002    0.000     4.98   100.00        .
        init          0.078     1000    0.000    0.000    0.000    0.001    0.000     1.94    39.00        .
       parse          0.484     1000    0.000    0.000    0.000    0.001    0.000    12.05   242.00        .
       check          2.944     1000    0.002    0.003    0.003    0.005    0.001    73.31  1472.00        .
        eval          0.368     1000    0.000    0.000    0.000    0.004    0.001     9.16   184.00        .
       total          4.016     1000    0.003    0.004    0.004    0.007    0.001   100.00  2008.00    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.921     1000    0.001    0.002    0.002    0.007    0.001    30.16   100.00        .
        init          0.329     1000    0.000    0.000    0.000    0.001    0.000     5.16    17.13        .
       parse          0.493     1000    0.000    0.000    0.000    0.003    0.001     7.74    25.66        .
       check          2.922     1000    0.002    0.003    0.003    0.006    0.000    45.87   152.11        .
        eval          2.473     1000    0.001    0.002    0.002    0.008    0.001    38.82   128.74        .
       total          6.370     1000    0.005    0.006    0.006    0.013    0.001   100.00   331.60    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.681      100    0.015    0.017    0.017    0.024    0.001    62.96   100.00        .
        init          0.355      100    0.003    0.004    0.004    0.005    0.001    13.30    21.12        .
       parse          0.049      100    0.000    0.000    0.000    0.001    0.001     1.84     2.91        .
       check          0.288      100    0.002    0.003    0.003    0.004    0.000    10.79    17.13        .
        eval          1.961      100    0.018    0.020    0.019    0.026    0.001    73.45   116.66        .
       total          2.670      100    0.025    0.027    0.026    0.033    0.001   100.00   158.83    0.010
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.470       10    0.145    0.147    0.147    0.149    0.002    81.76   100.00        .
        init          0.140       10    0.014    0.014    0.014    0.014    0.000     7.79     9.52        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.39     0.48        .
       check          0.027       10    0.002    0.003    0.003    0.003    0.000     1.50     1.84        .
        eval          1.624       10    0.160    0.162    0.162    0.166    0.002    90.32   110.48        .
       total          1.798       10    0.177    0.180    0.179    0.183    0.002   100.00   122.31    0.033
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.639       10    1.453    1.464    1.460    1.494    0.013    83.15   100.00        .
        init          1.416       10    0.139    0.142    0.141    0.144    0.001     8.04     9.67        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.03     0.03        .
       check          0.031       10    0.003    0.003    0.003    0.004    0.000     0.18     0.21        .
        eval         16.152       10    1.604    1.615    1.615    1.630    0.008    91.74   110.34        .
       total         17.606       10    1.747    1.761    1.761    1.776    0.008   100.00   120.27    0.297
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.202     1000    0.000    0.000    0.000    0.002    0.000     6.33   100.00        .
        init          0.492     1000    0.000    0.000    0.000    0.004    0.001    15.41   243.56        .
       parse          0.475     1000    0.000    0.000    0.000    0.001    0.000    14.88   235.15        .
       check          1.783     1000    0.001    0.002    0.002    0.004    0.000    55.86   882.67        .
        eval          0.285     1000    0.000    0.000    0.000    0.003    0.000     8.93   141.09        .
       total          3.192     1000    0.002    0.003    0.003    0.006    0.001   100.00  1580.20    0.003
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.446     1000    0.001    0.001    0.001    0.003    0.001    16.97   100.00        .
        init          4.619     1000    0.004    0.005    0.005    0.009    0.001    54.21   319.43        .
       parse          0.466     1000    0.000    0.000    0.000    0.002    0.001     5.47    32.23        .
       check          1.729     1000    0.001    0.002    0.002    0.004    0.000    20.29   119.57        .
        eval          1.552     1000    0.001    0.002    0.002    0.005    0.001    18.22   107.33        .
       total          8.520     1000    0.008    0.009    0.008    0.014    0.001   100.00   589.21    0.007
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.310      100    0.012    0.013    0.013    0.016    0.001    17.89   100.00        .
        init          5.659      100    0.053    0.057    0.056    0.064    0.002    77.30   431.98        .
       parse          0.057      100    0.000    0.001    0.001    0.002    0.001     0.78     4.35        .
       check          0.173      100    0.001    0.002    0.002    0.004    0.001     2.36    13.21        .
        eval          1.419      100    0.013    0.014    0.014    0.020    0.001    19.38   108.32        .
       total          7.321      100    0.070    0.073    0.072    0.082    0.002   100.00   558.85    0.060
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.321       10    0.129    0.132    0.132    0.135    0.002    11.47   100.00        .
        init         10.066       10    0.990    1.007    0.995    1.033    0.017    87.36   762.00        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.03     0.30        .
       check          0.020       10    0.002    0.002    0.002    0.002    0.000     0.17     1.51        .
        eval          1.428       10    0.139    0.143    0.142    0.148    0.003    12.39   108.10        .
       total         11.522       10    1.137    1.152    1.141    1.180    0.016   100.00   872.22    1.020
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         13.345       10    1.294    1.335    1.334    1.390    0.033     6.37   100.00        .
        init        195.405       10   16.735   19.541   19.969   20.600    1.377    93.23  1464.26        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.00     0.03        .
       check          0.018       10    0.001    0.002    0.002    0.002    0.000     0.01     0.13        .
        eval         14.158       10    1.396    1.416    1.406    1.453    0.018     6.76   106.09        .
       total        209.589       10   18.152   20.959   21.367   22.033    1.380   100.00  1570.54   19.624
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  19 Aug 2024, 18:17:25
---------------------------------------------------------------------------------------------------------------------------------------------------
