------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/benchmark/logs/bench_e2e.log
  log type:  text
 opened on:  15 Aug 2024, 02:08:34

. 
. dis "`c(current_date)'"
15 Aug 2024

. dis "`c(current_time)'"
02:08:34

. 
. profile_obs_integer, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.208     1000    0.000    0.000    0.000    0.001    0.000     3.37   100.00        .
        init          0.306     1000    0.000    0.000    0.000    0.002    0.000     4.95   147.12        .
       parse          0.655     1000    0.000    0.001    0.001    0.002    0.000    10.60   314.90        .
       check          4.721     1000    0.004    0.005    0.005    0.009    0.001    76.39  2269.71        .
        eval          0.344     1000    0.000    0.000    0.000    0.005    0.001     5.57   165.38        .
       total          6.180     1000    0.005    0.006    0.006    0.011    0.001   100.00  2971.15    0.006
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.608     1000    0.001    0.002    0.002    0.003    0.000    17.45   100.00        .
        init          1.494     1000    0.001    0.001    0.001    0.003    0.001    16.21    92.91        .
       parse          0.624     1000    0.000    0.001    0.001    0.001    0.000     6.77    38.81        .
       check          4.502     1000    0.004    0.005    0.004    0.007    0.001    48.84   279.98        .
        eval          2.455     1000    0.002    0.002    0.002    0.006    0.001    26.64   152.67        .
       total          9.217     1000    0.008    0.009    0.009    0.014    0.001   100.00   573.20    0.008
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.556      100    0.015    0.016    0.015    0.026    0.001    38.51   100.00        .
        init          1.370      100    0.013    0.014    0.014    0.017    0.001    33.91    88.05        .
       parse          0.069      100    0.000    0.001    0.001    0.002    0.000     1.71     4.43        .
       check          0.433      100    0.004    0.004    0.004    0.005    0.000    10.72    27.83        .
        eval          2.161      100    0.020    0.022    0.021    0.028    0.001    53.49   138.88        .
       total          4.040      100    0.039    0.040    0.040    0.048    0.001   100.00   259.64    0.025
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.389       10    0.136    0.139    0.139    0.142    0.002    43.53   100.00        .
        init          1.210       10    0.117    0.121    0.120    0.127    0.003    37.92    87.11        .
       parse          0.008       10    0.000    0.001    0.001    0.002    0.001     0.25     0.58        .
       check          0.050       10    0.004    0.005    0.004    0.010    0.002     1.57     3.60        .
        eval          1.922       10    0.190    0.192    0.193    0.193    0.001    60.23   138.37        .
       total          3.191       10    0.315    0.319    0.318    0.325    0.003   100.00   229.73    0.180
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         13.627       10    1.344    1.363    1.355    1.411    0.019    43.80   100.00        .
        init         12.028       10    1.181    1.203    1.197    1.234    0.019    38.66    88.27        .
       parse          0.007       10    0.000    0.001    0.001    0.002    0.001     0.02     0.05        .
       check          0.045       10    0.004    0.004    0.004    0.005    0.001     0.14     0.33        .
        eval         19.029       10    1.877    1.903    1.896    1.987    0.031    61.17   139.64        .
       total         31.110       10    3.070    3.111    3.097    3.226    0.047   100.00   228.30    1.748
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.226     1000    0.000    0.000    0.000    0.002    0.000     5.06   100.00        .
        init          0.245     1000    0.000    0.000    0.000    0.001    0.000     5.48   108.41        .
       parse          0.565     1000    0.000    0.001    0.001    0.002    0.001    12.64   250.00        .
       check          3.086     1000    0.002    0.003    0.003    0.008    0.000    69.04  1365.49        .
        eval          0.445     1000    0.000    0.000    0.000    0.023    0.001     9.96   196.90        .
       total          4.470     1000    0.004    0.004    0.004    0.027    0.001   100.00  1977.88    0.004
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.841     1000    0.001    0.003    0.002    0.009    0.002    24.53   100.00        .
        init          0.613     1000    0.000    0.001    0.001    0.004    0.001     5.29    21.58        .
       parse          0.842     1000    0.000    0.001    0.001    0.005    0.001     7.27    29.64        .
       check          4.857     1000    0.002    0.005    0.003    0.014    0.002    41.94   170.96        .
        eval          5.028     1000    0.002    0.005    0.003    0.015    0.003    43.42   176.98        .
       total         11.580     1000    0.006    0.012    0.007    0.031    0.006   100.00   407.60    0.009
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.700      100    0.020    0.037    0.038    0.055    0.008    65.72   100.00        .
        init          0.516      100    0.003    0.005    0.005    0.009    0.002     9.17    13.95        .
       parse          0.104      100    0.000    0.001    0.001    0.002    0.001     1.85     2.81        .
       check          0.519      100    0.003    0.005    0.004    0.009    0.002     9.22    14.03        .
        eval          4.461      100    0.033    0.045    0.038    0.087    0.013    79.24   120.57        .
       total          5.630      100    0.041    0.056    0.051    0.103    0.015   100.00   152.16    0.019
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.543       10    0.207    0.254    0.236    0.314    0.041    59.91   100.00        .
        init          0.175       10    0.017    0.017    0.017    0.019    0.001     4.12     6.88        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.16     0.28        .
       check          0.038       10    0.003    0.004    0.004    0.004    0.000     0.90     1.49        .
        eval          4.023       10    0.376    0.402    0.395    0.438    0.019    94.77   158.20        .
       total          4.245       10    0.398    0.424    0.416    0.461    0.020   100.00   166.93    0.170
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         23.242       10    2.095    2.324    2.344    2.534    0.143    54.59   100.00        .
        init          2.162       10    0.187    0.216    0.199    0.258    0.026     5.08     9.30        .
       parse          0.011       10    0.000    0.001    0.001    0.002    0.001     0.03     0.05        .
       check          0.050       10    0.003    0.005    0.004    0.010    0.002     0.12     0.22        .
        eval         40.349       10    3.829    4.035    4.033    4.282    0.143    94.77   173.60        .
       total         42.576       10    4.094    4.258    4.232    4.497    0.148   100.00   183.19    1.933
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.459     1000    0.000    0.000    0.000    0.001    0.000     4.81   100.00        .
        init          1.431     1000    0.000    0.001    0.001    0.003    0.001    15.00   311.76        .
       parse          1.105     1000    0.000    0.001    0.001    0.005    0.001    11.58   240.74        .
       check          5.884     1000    0.003    0.006    0.007    0.015    0.002    61.66  1281.92        .
        eval          0.832     1000    0.000    0.001    0.001    0.010    0.001     8.72   181.26        .
       total          9.543     1000    0.004    0.010    0.011    0.020    0.003   100.00  2079.08    0.009
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.442     1000    0.001    0.003    0.004    0.008    0.001    13.80   100.00        .
        init         11.521     1000    0.005    0.012    0.012    0.021    0.003    46.18   334.72        .
       parse          1.235     1000    0.000    0.001    0.001    0.003    0.001     4.95    35.88        .
       check          6.111     1000    0.003    0.006    0.007    0.017    0.002    24.49   177.54        .
        eval          5.732     1000    0.002    0.006    0.006    0.013    0.002    22.97   166.53        .
       total         24.950     1000    0.012    0.025    0.027    0.044    0.005   100.00   724.87    0.022
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.658      100    0.012    0.017    0.014    0.039    0.006    15.91   100.00        .
        init          7.100      100    0.056    0.071    0.064    0.128    0.016    68.15   428.23        .
       parse          0.067      100    0.000    0.001    0.001    0.002    0.001     0.64     4.04        .
       check          0.308      100    0.002    0.003    0.003    0.008    0.001     2.96    18.58        .
        eval          2.924      100    0.023    0.029    0.026    0.057    0.008    28.07   176.36        .
       total         10.418      100    0.082    0.104    0.095    0.175    0.023   100.00   628.35    0.088
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.322       10    0.125    0.132    0.130    0.144    0.007     9.10   100.00        .
        init         11.859       10    0.998    1.186    1.126    1.718    0.217    81.60   897.05        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.04     0.45        .
       check          0.029       10    0.002    0.003    0.003    0.005    0.001     0.20     2.19        .
        eval          2.637       10    0.235    0.264    0.241    0.451    0.066    18.14   199.47        .
       total         14.533       10    1.239    1.453    1.367    2.175    0.278   100.00  1099.32    1.321
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         13.847       10    1.269    1.385    1.308    2.068    0.243     6.31   100.00        .
        init        194.015       10   18.494   19.401   18.812   21.958    1.302    88.46  1401.13        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.00     0.04        .
       check          0.027       10    0.002    0.003    0.003    0.003    0.000     0.01     0.19        .
        eval         25.249       10    2.348    2.525    2.361    3.790    0.447    11.51   182.34        .
       total        219.321       10   20.846   21.932   21.199   25.751    1.663   100.00  1583.89   20.547
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/benchmark/logs/bench_e2e.log
  log type:  text
 closed on:  15 Aug 2024, 02:17:40
------------------------------------------------------------------------------------------------------------------------------------------------------------
