---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  19 Aug 2024, 11:06:58

. 
. dis "`c(current_date)'"
19 Aug 2024

. dis "`c(current_time)'"
11:06:58

. 
. profile_obs_integer, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.244     1000    0.000    0.000    0.000    0.001    0.000     3.54   100.00        .
        init          0.210     1000    0.000    0.000    0.000    0.005    0.000     3.05    86.07        .
       parse          0.709     1000    0.000    0.001    0.001    0.004    0.000    10.30   290.57        .
       check          5.320     1000    0.004    0.005    0.005    0.099    0.003    77.26  2180.33        .
        eval          0.469     1000    0.000    0.000    0.000    0.009    0.001     6.81   192.21        .
       total          6.886     1000    0.005    0.007    0.006    0.102    0.004   100.00  2822.13    0.007
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.019     1000    0.001    0.002    0.002    0.007    0.001    17.92   100.00        .
        init          1.747     1000    0.001    0.002    0.002    0.008    0.001    15.51    86.53        .
       parse          0.768     1000    0.000    0.001    0.001    0.003    0.001     6.82    38.04        .
       check          5.424     1000    0.004    0.005    0.005    0.014    0.002    48.15   268.65        .
        eval          3.165     1000    0.002    0.003    0.003    0.009    0.001    28.10   156.76        .
       total         11.264     1000    0.008    0.011    0.010    0.029    0.003   100.00   557.90    0.009
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.236      100    0.015    0.022    0.018    0.043    0.007    41.05   100.00        .
        init          1.903      100    0.013    0.019    0.016    0.042    0.006    34.94    85.11        .
       parse          0.086      100    0.000    0.001    0.001    0.003    0.001     1.58     3.85        .
       check          0.547      100    0.004    0.005    0.005    0.013    0.002    10.04    24.46        .
        eval          2.893      100    0.021    0.029    0.025    0.062    0.008    53.11   129.38        .
       total          5.447      100    0.041    0.054    0.050    0.111    0.014   100.00   243.60    0.032
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.884       10    0.151    0.188    0.186    0.244    0.026    43.38   100.00        .
        init          1.699       10    0.130    0.170    0.170    0.212    0.026    39.12    90.18        .
       parse          0.011       10    0.000    0.001    0.001    0.002    0.001     0.25     0.58        .
       check          0.067       10    0.004    0.007    0.006    0.010    0.002     1.54     3.56        .
        eval          2.564       10    0.225    0.256    0.237    0.312    0.032    59.04   136.09        .
       total          4.343       10    0.403    0.434    0.431    0.494    0.026   100.00   230.52    0.246
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         16.673       10    1.551    1.667    1.583    1.858    0.128    44.00   100.00        .
        init         14.441       10    1.244    1.444    1.397    1.645    0.114    38.11    86.61        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.02     0.04        .
       check          0.048       10    0.004    0.005    0.005    0.006    0.001     0.13     0.29        .
        eval         23.397       10    2.042    2.340    2.283    2.625    0.196    61.74   140.33        .
       total         37.895       10    3.292    3.790    3.692    4.277    0.304   100.00   227.28    2.122
---------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.272     1000    0.000    0.000    0.000    0.002    0.000     5.60   100.00        .
        init          0.058     1000    0.000    0.000    0.000    0.001    0.000     1.19    21.32        .
       parse          0.670     1000    0.000    0.001    0.001    0.002    0.000    13.79   246.32        .
       check          3.484     1000    0.002    0.003    0.003    0.008    0.001    71.72  1280.88        .
        eval          0.477     1000    0.000    0.000    0.000    0.004    0.001     9.82   175.37        .
       total          4.858     1000    0.003    0.005    0.005    0.011    0.001   100.00  1786.03    0.005
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.888     1000    0.001    0.002    0.002    0.004    0.001    25.02   100.00        .
        init          0.252     1000    0.000    0.000    0.000    0.001    0.000     3.34    13.35        .
       parse          0.618     1000    0.000    0.001    0.001    0.002    0.000     8.19    32.73        .
       check          3.207     1000    0.002    0.003    0.003    0.006    0.001    42.50   169.86        .
        eval          3.327     1000    0.002    0.003    0.003    0.009    0.001    44.09   176.22        .
       total          7.546     1000    0.006    0.008    0.007    0.016    0.001   100.00   399.68    0.006
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.845      100    0.016    0.018    0.018    0.032    0.002    47.70   100.00        .
        init          0.352      100    0.003    0.004    0.004    0.005    0.001     9.10    19.08        .
       parse          0.059      100    0.000    0.001    0.001    0.001    0.000     1.53     3.20        .
       check          0.324      100    0.002    0.003    0.003    0.004    0.000     8.38    17.56        .
        eval          3.108      100    0.027    0.031    0.030    0.045    0.003    80.35   168.46        .
       total          3.868      100    0.034    0.039    0.038    0.054    0.003   100.00   209.65    0.020
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.652       10    0.153    0.165    0.162    0.183    0.010    54.94   100.00        .
        init          0.153       10    0.014    0.015    0.015    0.017    0.001     5.09     9.26        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.17     0.30        .
       check          0.034       10    0.002    0.003    0.003    0.004    0.001     1.13     2.06        .
        eval          2.813       10    0.268    0.281    0.277    0.304    0.012    93.55   170.28        .
       total          3.007       10    0.287    0.301    0.298    0.323    0.012   100.00   182.02    0.135
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         16.219       10    1.585    1.622    1.611    1.704    0.035    55.03   100.00        .
        init          1.550       10    0.148    0.155    0.154    0.162    0.005     5.26     9.56        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.01     0.02        .
       check          0.035       10    0.003    0.004    0.003    0.004    0.001     0.12     0.22        .
        eval         27.884       10    2.703    2.788    2.789    2.849    0.053    94.61   171.92        .
       total         29.473       10    2.864    2.947    2.955    3.010    0.053   100.00   181.72    1.325
---------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.220     1000    0.000    0.000    0.000    0.002    0.000     4.46   100.00        .
        init          0.615     1000    0.000    0.001    0.001    0.002    0.000    12.47   279.55        .
       parse          0.580     1000    0.000    0.001    0.001    0.002    0.000    11.76   263.64        .
       check          3.183     1000    0.002    0.003    0.003    0.007    0.001    64.54  1446.82        .
        eval          0.414     1000    0.000    0.000    0.000    0.004    0.001     8.39   188.18        .
       total          4.932     1000    0.003    0.005    0.005    0.011    0.001   100.00  2241.82    0.005
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.523     1000    0.001    0.002    0.001    0.004    0.001    13.63   100.00        .
        init          4.869     1000    0.004    0.005    0.005    0.012    0.001    43.57   319.70        .
       parse          0.551     1000    0.000    0.001    0.001    0.002    0.001     4.93    36.18        .
       check          2.837     1000    0.002    0.003    0.003    0.006    0.001    25.38   186.28        .
        eval          2.770     1000    0.002    0.003    0.003    0.006    0.001    24.79   181.88        .
       total         11.176     1000    0.009    0.011    0.011    0.021    0.001   100.00   733.81    0.010
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.440      100    0.013    0.014    0.014    0.021    0.001    15.88   100.00        .
        init          5.984      100    0.054    0.060    0.059    0.074    0.003    66.00   415.56        .
       parse          0.063      100    0.000    0.001    0.001    0.001    0.000     0.69     4.38        .
       check          0.294      100    0.002    0.003    0.003    0.005    0.001     3.24    20.42        .
        eval          2.711      100    0.024    0.027    0.027    0.043    0.002    29.90   188.26        .
       total          9.066      100    0.082    0.091    0.090    0.109    0.004   100.00   629.58    0.076
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.448       10    0.140    0.145    0.145    0.151    0.004    10.93   100.00        .
        init         10.655       10    1.038    1.065    1.062    1.111    0.022    80.42   735.84        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.03     0.28        .
       check          0.030       10    0.002    0.003    0.003    0.004    0.000     0.23     2.07        .
        eval          2.558       10    0.249    0.256    0.252    0.275    0.008    19.31   176.66        .
       total         13.249       10    1.292    1.325    1.321    1.370    0.021   100.00   914.99    1.180
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.874       10    1.365    1.487    1.486    1.585    0.068     5.98   100.00        .
        init        222.192       10   19.304   22.219   22.432   23.232    1.155    89.40  1493.83        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.00     0.03        .
       check          0.028       10    0.002    0.003    0.003    0.004    0.001     0.01     0.19        .
        eval         26.305       10    2.504    2.631    2.579    2.745    0.087    10.58   176.85        .
       total        248.532       10   21.883   24.853   25.180   25.923    1.180   100.00  1670.92   23.366
---------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  19 Aug 2024, 11:15:52
---------------------------------------------------------------------------------------------------------------------------------------
