----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:   3 Oct 2024, 19:05:27

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.620     1000    0.000    0.002    0.002    0.006    0.001    40.01   495.41        .
  base                     0.327     1000    0.000    0.000    0.000    0.001    0.000     8.08   100.00        .
  init                     0.533     1000    0.000    0.001    0.001    0.004    0.001    13.16   163.00        .
  parse                    0.695     1000    0.000    0.001    0.001    0.003    0.000    17.16   212.54        .
  check                    2.446     1000    0.002    0.002    0.002    0.004    0.001    60.41   748.01        .
  - usefulness             0.926     1000    0.000    0.001    0.001    0.002    0.000    22.87   283.18        .
  - combine                0.052     1000    0.000    0.000    0.000    0.001    0.000     1.28    15.90        .
  - exhaustiveness         1.378     1000    0.001    0.001    0.001    0.002    0.000    34.03   421.41        .
  - compress               0.007     1000    0.000    0.000    0.000    0.001    0.000     0.17     2.14        .
  - print                  0.020     1000    0.000    0.000    0.000    0.001    0.000     0.49     6.12        .
  eval                     0.348     1000    0.000    0.000    0.000    0.001    0.000     8.59   106.42        .
  total                    4.049     1000    0.003    0.004    0.004    0.008    0.001   100.00  1238.23    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.603     1000    0.002    0.004    0.004    0.006    0.001    51.05   122.26        .
  base                     2.947     1000    0.002    0.003    0.003    0.006    0.001    41.75   100.00        .
  init                     0.909     1000    0.000    0.001    0.001    0.003    0.000    12.88    30.84        .
  parse                    0.728     1000    0.000    0.001    0.001    0.002    0.000    10.31    24.70        .
  check                    2.418     1000    0.002    0.002    0.002    0.008    0.001    34.26    82.05        .
  - usefulness             0.910     1000    0.000    0.001    0.001    0.005    0.000    12.89    30.88        .
  - combine                0.063     1000    0.000    0.000    0.000    0.001    0.000     0.89     2.14        .
  - exhaustiveness         1.354     1000    0.001    0.001    0.001    0.003    0.000    19.18    45.95        .
  - compress               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.09     0.20        .
  - print                  0.026     1000    0.000    0.000    0.000    0.001    0.000     0.37     0.88        .
  eval                     2.980     1000    0.002    0.003    0.003    0.006    0.000    42.22   101.12        .
  total                    7.058     1000    0.006    0.007    0.007    0.012    0.001   100.00   239.50    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.631      100    0.014    0.016    0.016    0.019    0.001    41.18    52.71        .
  base                     3.094      100    0.029    0.031    0.031    0.036    0.001    78.11   100.00        .
  init                     0.553      100    0.005    0.006    0.005    0.007    0.001    13.96    17.87        .
  parse                    0.076      100    0.000    0.001    0.001    0.001    0.000     1.92     2.46        .
  check                    0.237      100    0.002    0.002    0.002    0.004    0.001     5.98     7.66        .
  - usefulness             0.092      100    0.000    0.001    0.001    0.002    0.000     2.32     2.97        .
  - combine                0.003      100    0.000    0.000    0.000    0.001    0.000     0.08     0.10        .
  - exhaustiveness         0.135      100    0.001    0.001    0.001    0.002    0.000     3.41     4.36        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     3.090      100    0.029    0.031    0.031    0.035    0.001    78.01    99.87        .
  total                    3.961      100    0.038    0.040    0.039    0.044    0.001   100.00   128.02    0.009
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.868       10    0.173    0.187    0.183    0.200    0.009    61.55    72.46        .
  base                     2.578       10    0.255    0.258    0.257    0.261    0.002    84.94   100.00        .
  init                     0.471       10    0.045    0.047    0.046    0.053    0.002    15.52    18.27        .
  parse                    0.006       10    0.000    0.001    0.001    0.001    0.001     0.20     0.23        .
  check                    0.024       10    0.002    0.002    0.002    0.003    0.001     0.79     0.93        .
  - usefulness             0.008       10    0.000    0.001    0.001    0.002    0.001     0.26     0.31        .
  - combine                0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.04        .
  - exhaustiveness         0.015       10    0.001    0.002    0.001    0.002    0.001     0.49     0.58        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     2.531       10    0.250    0.253    0.253    0.256    0.002    83.39    98.18        .
  total                    3.035       10    0.300    0.303    0.303    0.311    0.003   100.00   117.73    0.046
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.094        1    3.094    3.094    3.094    3.094        .    97.66   122.05        .
  base                     2.535        1    2.535    2.535    2.535    2.535        .    80.02   100.00        .
  init                     0.461        1    0.461    0.461    0.461    0.461        .    14.55    18.19        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  check                    0.002        1    0.002    0.002    0.002    0.002        .     0.06     0.08        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     2.704        1    2.704    2.704    2.704    2.704        .    85.35   106.67        .
  total                    3.168        1    3.168    3.168    3.168    3.168        .   100.00   124.97    0.633
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.607     1000    0.000    0.001    0.001    0.005    0.001    10.22   120.68        .
  base                     0.503     1000    0.000    0.001    0.001    0.002    0.001     8.47   100.00        .
  init                     1.121     1000    0.000    0.001    0.001    0.004    0.000    18.87   222.86        .
  parse                    0.963     1000    0.000    0.001    0.001    0.004    0.001    16.21   191.45        .
  check                    3.233     1000    0.002    0.003    0.003    0.009    0.001    54.43   642.74        .
  - usefulness             1.197     1000    0.000    0.001    0.001    0.004    0.000    20.15   237.97        .
  - combine                0.080     1000    0.000    0.000    0.000    0.001    0.000     1.35    15.90        .
  - exhaustiveness         1.847     1000    0.001    0.002    0.002    0.006    0.001    31.09   367.20        .
  - compress               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.10     1.19        .
  - print                  0.029     1000    0.000    0.000    0.000    0.001    0.000     0.49     5.77        .
  eval                     0.591     1000    0.000    0.001    0.001    0.003    0.001     9.95   117.50        .
  total                    5.940     1000    0.004    0.006    0.005    0.017    0.002   100.00  1180.91    0.005
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.570     1000    0.001    0.003    0.003    0.006    0.001    18.70    59.18        .
  base                     4.343     1000    0.003    0.004    0.004    0.009    0.001    31.61   100.00        .
  init                     4.845     1000    0.003    0.005    0.004    0.010    0.001    35.26   111.56        .
  parse                    1.017     1000    0.000    0.001    0.001    0.003    0.000     7.40    23.42        .
  check                    3.284     1000    0.002    0.003    0.003    0.009    0.001    23.90    75.62        .
  - usefulness             1.226     1000    0.000    0.001    0.001    0.004    0.000     8.92    28.23        .
  - combine                0.070     1000    0.000    0.000    0.000    0.001    0.000     0.51     1.61        .
  - exhaustiveness         1.881     1000    0.001    0.002    0.002    0.006    0.001    13.69    43.31        .
  - compress               0.004     1000    0.000    0.000    0.000    0.001    0.000     0.03     0.09        .
  - print                  0.026     1000    0.000    0.000    0.000    0.001    0.000     0.19     0.60        .
  eval                     4.543     1000    0.003    0.005    0.004    0.011    0.001    33.06   104.61        .
  total                   13.740     1000    0.009    0.014    0.013    0.027    0.003   100.00   316.37    0.009
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.254      100    0.018    0.023    0.022    0.035    0.003    14.85    31.90        .
  base                     7.065      100    0.063    0.071    0.070    0.082    0.004    46.53   100.00        .
  init                     7.605      100    0.065    0.076    0.074    0.104    0.008    50.09   107.64        .
  parse                    0.100      100    0.000    0.001    0.001    0.003    0.000     0.66     1.42        .
  check                    0.344      100    0.002    0.003    0.003    0.008    0.001     2.27     4.87        .
  - usefulness             0.128      100    0.000    0.001    0.001    0.003    0.001     0.84     1.81        .
  - combine                0.008      100    0.000    0.000    0.000    0.001    0.000     0.05     0.11        .
  - exhaustiveness         0.199      100    0.001    0.002    0.002    0.005    0.001     1.31     2.82        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.002      100    0.000    0.000    0.000    0.001    0.000     0.01     0.03        .
  eval                     7.131      100    0.063    0.071    0.070    0.090    0.005    46.97   100.93        .
  total                   15.183      100    0.132    0.152    0.151    0.182    0.011   100.00   214.90    0.081
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.173       10    0.203    0.217    0.216    0.240    0.010    32.34    75.43        .
  base                     2.881       10    0.277    0.288    0.287    0.302    0.008    42.87   100.00        .
  init                     3.831       10    0.374    0.383    0.380    0.401    0.009    57.01   132.97        .
  parse                    0.009       10    0.000    0.001    0.001    0.001    0.000     0.13     0.31        .
  check                    0.029       10    0.002    0.003    0.002    0.007    0.002     0.43     1.01        .
  - usefulness             0.011       10    0.001    0.001    0.001    0.002    0.000     0.16     0.38        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.017       10    0.001    0.002    0.001    0.005    0.001     0.25     0.59        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     2.850       10    0.272    0.285    0.282    0.315    0.012    42.41    98.92        .
  total                    6.720       10    0.650    0.672    0.668    0.707    0.017   100.00   233.25    0.384
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.270        1    3.270    3.270    3.270    3.270        .    47.77   114.98        .
  base                     2.844        1    2.844    2.844    2.844    2.844        .    41.55   100.00        .
  init                     3.977        1    3.977    3.977    3.977    3.977        .    58.10   139.84        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.04        .
  check                    0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.07        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     2.865        1    2.865    2.865    2.865    2.865        .    41.86   100.74        .
  total                    6.845        1    6.845    6.845    6.845    6.845        .   100.00   240.68    4.001
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.664     1000    0.001    0.002    0.002    0.003    0.001    54.88   749.55        .
  base                     0.222     1000    0.000    0.000    0.000    0.002    0.000     7.32   100.00        .
  init                     0.573     1000    0.000    0.001    0.001    0.002    0.001    18.90   258.11        .
  parse                    0.499     1000    0.000    0.000    0.000    0.004    0.001    16.46   224.77        .
  check                    1.695     1000    0.001    0.002    0.002    0.005    0.001    55.90   763.51        .
  - usefulness             0.407     1000    0.000    0.000    0.000    0.002    0.000    13.42   183.33        .
  - combine                0.011     1000    0.000    0.000    0.000    0.001    0.000     0.36     4.95        .
  - exhaustiveness         1.210     1000    0.001    0.001    0.001    0.003    0.000    39.91   545.05        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.16     2.25        .
  - print                  0.019     1000    0.000    0.000    0.000    0.001    0.000     0.63     8.56        .
  eval                     0.233     1000    0.000    0.000    0.000    0.001    0.000     7.68   104.95        .
  total                    3.032     1000    0.002    0.003    0.003    0.008    0.001   100.00  1365.77    0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.153     1000    0.006    0.008    0.008    0.015    0.001    93.43   489.38        .
  base                     1.666     1000    0.001    0.002    0.002    0.004    0.001    19.09   100.00        .
  init                     4.915     1000    0.004    0.005    0.005    0.008    0.001    56.33   295.02        .
  parse                    0.494     1000    0.000    0.000    0.000    0.003    0.001     5.66    29.65        .
  check                    1.640     1000    0.001    0.002    0.002    0.005    0.001    18.79    98.44        .
  - usefulness             0.402     1000    0.000    0.000    0.000    0.001    0.000     4.61    24.13        .
  - combine                0.015     1000    0.000    0.000    0.000    0.001    0.000     0.17     0.90        .
  - exhaustiveness         1.155     1000    0.001    0.001    0.001    0.003    0.000    13.24    69.33        .
  - compress               0.004     1000    0.000    0.000    0.000    0.001    0.000     0.05     0.24        .
  - print                  0.018     1000    0.000    0.000    0.000    0.001    0.000     0.21     1.08        .
  eval                     1.643     1000    0.001    0.002    0.002    0.004    0.001    18.83    98.62        .
  total                    8.726     1000    0.007    0.009    0.009    0.015    0.001   100.00   523.77    0.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.708      100    0.064    0.067    0.067    0.076    0.002    89.24   431.11        .
  base                     1.556      100    0.015    0.016    0.015    0.017    0.001    20.70   100.00        .
  init                     5.752      100    0.055    0.058    0.057    0.086    0.003    76.52   369.67        .
  parse                    0.051      100    0.000    0.001    0.001    0.001    0.001     0.68     3.28        .
  check                    0.160      100    0.001    0.002    0.002    0.003    0.001     2.13    10.28        .
  - usefulness             0.034      100    0.000    0.000    0.000    0.001    0.000     0.45     2.19        .
  - combine                0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.06        .
  - exhaustiveness         0.114      100    0.001    0.001    0.001    0.002    0.000     1.52     7.33        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.004      100    0.000    0.000    0.000    0.001    0.000     0.05     0.26        .
  eval                     1.549      100    0.015    0.015    0.015    0.024    0.001    20.61    99.55        .
  total                    7.517      100    0.072    0.075    0.074    0.113    0.004   100.00   483.10    0.060
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.233       10    0.706    0.723    0.719    0.773    0.019   113.78   469.37        .
  base                     1.541       10    0.153    0.154    0.153    0.159    0.002    24.24   100.00        .
  init                     4.761       10    0.465    0.476    0.478    0.486    0.006    74.89   308.96        .
  parse                    0.005       10    0.000    0.001    0.000    0.001    0.001     0.08     0.32        .
  check                    0.016       10    0.001    0.002    0.002    0.002    0.001     0.25     1.04        .
  - usefulness             0.004       10    0.000    0.000    0.000    0.001    0.001     0.06     0.26        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.012       10    0.001    0.001    0.001    0.002    0.000     0.19     0.78        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     1.575       10    0.153    0.158    0.157    0.165    0.003    24.78   102.21        .
  total                    6.357       10    0.624    0.636    0.636    0.647    0.008   100.00   412.52    0.482
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.412        1    8.412    8.412    8.412    8.412        .   133.23   533.42        .
  base                     1.577        1    1.577    1.577    1.577    1.577        .    24.98   100.00        .
  init                     4.720        1    4.720    4.720    4.720    4.720        .    74.75   299.30        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
  check                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
  - usefulness             0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.592        1    1.592    1.592    1.592    1.592        .    25.21   100.95        .
  total                    6.314        1    6.314    6.314    6.314    6.314        .   100.00   400.38    4.737
-------------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.139      100    0.001    0.001    0.001    0.002    0.000     1.23   102.96        .
  base                     0.135      100    0.001    0.001    0.001    0.003    0.001     1.19   100.00        .
  init                     0.070      100    0.000    0.001    0.001    0.002    0.000     0.62    51.85        .
  parse                    0.345      100    0.003    0.003    0.003    0.005    0.001     3.05   255.56        .
  check                   10.722      100    0.104    0.107    0.106    0.129    0.004    94.86  7942.22        .
  - usefulness             3.395      100    0.032    0.034    0.033    0.045    0.002    30.04  2514.81        .
  - combine                0.095      100    0.000    0.001    0.001    0.002    0.000     0.84    70.37        .
  - exhaustiveness         7.202      100    0.069    0.072    0.071    0.089    0.003    63.72  5334.81        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.74        .
  - print                  0.007      100    0.000    0.000    0.000    0.001    0.000     0.06     5.19        .
  eval                     0.157      100    0.001    0.002    0.002    0.003    0.001     1.39   116.30        .
  total                   11.303      100    0.109    0.113    0.112    0.135    0.004   100.00  8372.59    0.112
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.337      100    0.002    0.003    0.003    0.005    0.001     2.74    30.25        .
  base                     1.114      100    0.010    0.011    0.011    0.015    0.001     9.06   100.00        .
  init                     0.169      100    0.001    0.002    0.002    0.003    0.000     1.37    15.17        .
  parse                    0.334      100    0.003    0.003    0.003    0.007    0.001     2.72    29.98        .
  check                   10.682      100    0.103    0.107    0.105    0.126    0.004    86.85   958.89        .
  - usefulness             3.361      100    0.032    0.034    0.033    0.041    0.002    27.33   301.71        .
  - combine                0.090      100    0.000    0.001    0.001    0.001    0.000     0.73     8.08        .
  - exhaustiveness         7.191      100    0.069    0.072    0.071    0.083    0.003    58.47   645.51        .
  - compress               0.004      100    0.000    0.000    0.000    0.001    0.000     0.03     0.36        .
  - print                  0.010      100    0.000    0.000    0.000    0.001    0.000     0.08     0.90        .
  eval                     1.107      100    0.010    0.011    0.011    0.017    0.001     9.00    99.37        .
  total                   12.299      100    0.119    0.123    0.122    0.143    0.004   100.00  1104.04    0.112
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.139       10    0.013    0.014    0.014    0.015    0.001     6.00    12.86        .
  base                     1.081       10    0.106    0.108    0.107    0.111    0.002    46.64   100.00        .
  init                     0.126       10    0.012    0.013    0.013    0.013    0.001     5.44    11.66        .
  parse                    0.036       10    0.003    0.004    0.004    0.004    0.001     1.55     3.33        .
  check                    1.071       10    0.104    0.107    0.106    0.118    0.004    46.20    99.07        .
  - usefulness             0.335       10    0.032    0.034    0.033    0.037    0.002    14.45    30.99        .
  - combine                0.008       10    0.000    0.001    0.001    0.001    0.000     0.35     0.74        .
  - exhaustiveness         0.723       10    0.070    0.072    0.071    0.080    0.003    31.19    66.88        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     1.084       10    0.105    0.108    0.107    0.117    0.003    46.76   100.28        .
  total                    2.318       10    0.227    0.232    0.229    0.251    0.007   100.00   214.43    0.124
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.181        1    0.181    0.181    0.181    0.181        .    13.69    16.45        .
  base                     1.100        1    1.100    1.100    1.100    1.100        .    83.21   100.00        .
  init                     0.127        1    0.127    0.127    0.127    0.127        .     9.61    11.55        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.23     0.27        .
  check                    0.106        1    0.106    0.106    0.106    0.106        .     8.02     9.64        .
  - usefulness             0.034        1    0.034    0.034    0.034    0.034        .     2.57     3.09        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.071        1    0.071    0.071    0.071    0.071        .     5.37     6.45        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.086        1    1.086    1.086    1.086    1.086        .    82.15    98.73        .
  total                    1.322        1    1.322    1.322    1.322    1.322        .   100.00   120.18    0.222
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.085        1    3.085    3.085    3.085    3.085        .    25.38    28.23        .
  base                    10.927        1   10.927   10.927   10.927   10.927        .    89.90   100.00        .
  init                     1.240        1    1.240    1.240    1.240    1.240        .    10.20    11.35        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.03     0.04        .
  check                    0.105        1    0.105    0.105    0.105    0.105        .     0.86     0.96        .
  - usefulness             0.033        1    0.033    0.033    0.033    0.033        .     0.27     0.30        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.070        1    0.070    0.070    0.070    0.070        .     0.58     0.64        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  eval                    10.806        1   10.806   10.806   10.806   10.806        .    88.90    98.89        .
  total                   12.155        1   12.155   12.155   12.155   12.155        .   100.00   111.24    1.228
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.156      100    0.001    0.002    0.002    0.003    0.001     1.39   115.56        .
  base                     0.135      100    0.001    0.001    0.001    0.002    0.000     1.21   100.00        .
  init                     0.094      100    0.000    0.001    0.001    0.003    0.000     0.84    69.63        .
  parse                    0.337      100    0.003    0.003    0.003    0.005    0.001     3.01   249.63        .
  check                   10.605      100    0.103    0.106    0.106    0.111    0.002    94.70  7855.56        .
  - usefulness             3.313      100    0.032    0.033    0.033    0.038    0.001    29.58  2454.07        .
  - combine                0.081      100    0.000    0.001    0.001    0.002    0.000     0.72    60.00        .
  - exhaustiveness         7.172      100    0.069    0.072    0.072    0.077    0.002    64.04  5312.59        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.74        .
  - print                  0.010      100    0.000    0.000    0.000    0.001    0.000     0.09     7.41        .
  eval                     0.159      100    0.001    0.002    0.002    0.003    0.001     1.42   117.78        .
  total                   11.199      100    0.109    0.112    0.112    0.119    0.002   100.00  8295.56    0.111
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.349      100    0.003    0.003    0.003    0.005    0.001     2.76    28.21        .
  base                     1.237      100    0.011    0.012    0.012    0.015    0.001     9.78   100.00        .
  init                     0.356      100    0.003    0.004    0.004    0.004    0.000     2.81    28.78        .
  parse                    0.347      100    0.003    0.003    0.003    0.005    0.001     2.74    28.05        .
  check                   10.608      100    0.103    0.106    0.105    0.146    0.004    83.84   857.56        .
  - usefulness             3.298      100    0.032    0.033    0.033    0.046    0.002    26.07   266.61        .
  - combine                0.095      100    0.000    0.001    0.001    0.002    0.000     0.75     7.68        .
  - exhaustiveness         7.185      100    0.069    0.072    0.071    0.099    0.003    56.79   580.84        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.02     0.16        .
  - print                  0.006      100    0.000    0.000    0.000    0.001    0.000     0.05     0.49        .
  eval                     1.334      100    0.012    0.013    0.013    0.015    0.001    10.54   107.84        .
  total                   12.652      100    0.123    0.127    0.126    0.164    0.004   100.00  1022.80    0.114
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.182       10    0.016    0.018    0.018    0.020    0.001     3.95     6.23        .
  base                     2.920       10    0.287    0.292    0.291    0.301    0.004    63.44   100.00        .
  init                     0.605       10    0.056    0.060    0.060    0.068    0.003    13.14    20.72        .
  parse                    0.037       10    0.003    0.004    0.003    0.006    0.001     0.80     1.27        .
  check                    1.060       10    0.104    0.106    0.105    0.112    0.002    23.03    36.30        .
  - usefulness             0.334       10    0.032    0.033    0.033    0.034    0.001     7.26    11.44        .
  - combine                0.007       10    0.000    0.001    0.001    0.001    0.000     0.15     0.24        .
  - exhaustiveness         0.714       10    0.070    0.071    0.070    0.077    0.002    15.51    24.45        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.002       10    0.000    0.000    0.000    0.001    0.000     0.04     0.07        .
  eval                     2.900       10    0.289    0.290    0.290    0.291    0.001    63.00    99.32        .
  total                    4.603       10    0.453    0.460    0.459    0.470    0.005   100.00   157.64    0.168
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.203        1    0.203    0.203    0.203    0.203        .    13.13    17.67        .
  base                     1.149        1    1.149    1.149    1.149    1.149        .    74.32   100.00        .
  init                     0.332        1    0.332    0.332    0.332    0.332        .    21.47    28.89        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.26     0.35        .
  check                    0.105        1    0.105    0.105    0.105    0.105        .     6.79     9.14        .
  - usefulness             0.032        1    0.032    0.032    0.032    0.032        .     2.07     2.79        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.09        .
  - exhaustiveness         0.072        1    0.072    0.072    0.072    0.072        .     4.66     6.27        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.105        1    1.105    1.105    1.105    1.105        .    71.47    96.17        .
  total                    1.546        1    1.546    1.546    1.546    1.546        .   100.00   134.55    0.397
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.089        1    3.089    3.089    3.089    3.089        .    21.69    27.65        .
  base                    11.171        1   11.171   11.171   11.171   11.171        .    78.43   100.00        .
  init                     3.216        1    3.216    3.216    3.216    3.216        .    22.58    28.79        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check                    0.108        1    0.108    0.108    0.108    0.108        .     0.76     0.97        .
  - usefulness             0.036        1    0.036    0.036    0.036    0.036        .     0.25     0.32        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.071        1    0.071    0.071    0.071    0.071        .     0.50     0.64        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  eval                    10.917        1   10.917   10.917   10.917   10.917        .    76.64    97.73        .
  total                   14.244        1   14.244   14.244   14.244   14.244        .   100.00   127.51    3.073
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.198      100    0.001    0.002    0.002    0.003    0.000     1.79   173.68        .
  base                     0.114      100    0.001    0.001    0.001    0.002    0.000     1.03   100.00        .
  init                     0.071      100    0.000    0.001    0.001    0.001    0.000     0.64    62.28        .
  parse                    0.229      100    0.002    0.002    0.002    0.004    0.000     2.07   200.88        .
  check                   10.604      100    0.104    0.106    0.106    0.111    0.001    96.01  9301.75        .
  - usefulness             2.783      100    0.027    0.028    0.028    0.033    0.001    25.20  2441.23        .
  - combine                0.032      100    0.000    0.000    0.000    0.001    0.000     0.29    28.07        .
  - exhaustiveness         7.762      100    0.076    0.078    0.077    0.082    0.001    70.28  6808.77        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.88        .
  - print                  0.010      100    0.000    0.000    0.000    0.001    0.000     0.09     8.77        .
  eval                     0.135      100    0.001    0.001    0.001    0.002    0.000     1.22   118.42        .
  total                   11.045      100    0.108    0.110    0.110    0.116    0.001   100.00  9688.60    0.109
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.930      100    0.008    0.009    0.009    0.012    0.001     7.48    92.17        .
  base                     1.009      100    0.009    0.010    0.010    0.012    0.001     8.12   100.00        .
  init                     0.522      100    0.005    0.005    0.005    0.007    0.000     4.20    51.73        .
  parse                    0.230      100    0.002    0.002    0.002    0.004    0.001     1.85    22.79        .
  check                   10.649      100    0.103    0.106    0.106    0.118    0.002    85.65  1055.40        .
  - usefulness             2.790      100    0.027    0.028    0.027    0.035    0.001    22.44   276.51        .
  - combine                0.036      100    0.000    0.000    0.000    0.001    0.000     0.29     3.57        .
  - exhaustiveness         7.798      100    0.076    0.078    0.078    0.083    0.001    62.72   772.84        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.10        .
  - print                  0.009      100    0.000    0.000    0.000    0.001    0.000     0.07     0.89        .
  eval                     1.026      100    0.009    0.010    0.010    0.013    0.001     8.25   101.68        .
  total                   12.433      100    0.121    0.124    0.124    0.136    0.002   100.00  1232.21    0.114
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.676       10    0.065    0.068    0.068    0.070    0.001    25.04    67.47        .
  base                     1.002       10    0.099    0.100    0.100    0.103    0.001    37.11   100.00        .
  init                     0.615       10    0.060    0.061    0.061    0.063    0.001    22.78    61.38        .
  parse                    0.022       10    0.002    0.002    0.002    0.003    0.000     0.81     2.20        .
  check                    1.059       10    0.104    0.106    0.105    0.108    0.001    39.22   105.69        .
  - usefulness             0.276       10    0.027    0.028    0.028    0.028    0.001    10.22    27.54        .
  - combine                0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.10        .
  - exhaustiveness         0.778       10    0.077    0.078    0.077    0.080    0.001    28.81    77.64        .
  - compress               0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.10        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     1.004       10    0.099    0.100    0.100    0.102    0.001    37.19   100.20        .
  total                    2.700       10    0.268    0.270    0.269    0.273    0.002   100.00   269.46    0.170
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.730        1    0.730    0.730    0.730    0.730        .    45.15    71.57        .
  base                     1.020        1    1.020    1.020    1.020    1.020        .    63.08   100.00        .
  init                     0.498        1    0.498    0.498    0.498    0.498        .    30.80    48.82        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.12     0.20        .
  check                    0.105        1    0.105    0.105    0.105    0.105        .     6.49    10.29        .
  - usefulness             0.027        1    0.027    0.027    0.027    0.027        .     1.67     2.65        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.077        1    0.077    0.077    0.077    0.077        .     4.76     7.55        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.10        .
  eval                     1.012        1    1.012    1.012    1.012    1.012        .    62.59    99.22        .
  total                    1.617        1    1.617    1.617    1.617    1.617        .   100.00   158.53    0.597
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.526        1    8.526    8.526    8.526    8.526        .    56.24    83.98        .
  base                    10.153        1   10.153   10.153   10.153   10.153        .    66.97   100.00        .
  init                     4.925        1    4.925    4.925    4.925    4.925        .    32.48    48.51        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.02        .
  check                    0.108        1    0.108    0.108    0.108    0.108        .     0.71     1.06        .
  - usefulness             0.027        1    0.027    0.027    0.027    0.027        .     0.18     0.27        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.079        1    0.079    0.079    0.079    0.079        .     0.52     0.78        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    10.126        1   10.126   10.126   10.126   10.126        .    66.79    99.73        .
  total                   15.161        1   15.161   15.161   15.161   15.161        .   100.00   149.33    5.008
-------------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.01     9.09        .
  base                     0.011        1    0.011    0.011    0.011    0.011        .     0.11   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.147        1    0.147    0.147    0.147    0.147        .     1.46  1336.36        .
  check                    9.924        1    9.924    9.924    9.924    9.924        .    98.40 90218.18        .
  - usefulness             3.105        1    3.105    3.105    3.105    3.105        .    30.79 28227.27        .
  - combine                0.125        1    0.125    0.125    0.125    0.125        .     1.24  1136.36        .
  - exhaustiveness         6.690        1    6.690    6.690    6.690    6.690        .    66.34 60818.18        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     9.09        .
  eval                     0.014        1    0.014    0.014    0.014    0.014        .     0.14   127.27        .
  total                   10.085        1   10.085   10.085   10.085   10.085        .   100.00 91681.82   10.074
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.004        1    0.004    0.004    0.004    0.004        .     0.04     4.04        .
  base                     0.099        1    0.099    0.099    0.099    0.099        .     0.97   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.02     2.02        .
  parse                    0.144        1    0.144    0.144    0.144    0.144        .     1.41   145.45        .
  check                    9.964        1    9.964    9.964    9.964    9.964        .    97.63 10064.65        .
  - usefulness             3.082        1    3.082    3.082    3.082    3.082        .    30.20  3113.13        .
  - combine                0.126        1    0.126    0.126    0.126    0.126        .     1.23   127.27        .
  - exhaustiveness         6.752        1    6.752    6.752    6.752    6.752        .    66.16  6820.20        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.01        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.01        .
  eval                     0.094        1    0.094    0.094    0.094    0.094        .     0.92    94.95        .
  total                   10.206        1   10.206   10.206   10.206   10.206        .   100.00 10309.09   10.107
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.018        1    0.018    0.018    0.018    0.018        .     0.16     1.92        .
  base                     0.937        1    0.937    0.937    0.937    0.937        .     8.49   100.00        .
  init                     0.012        1    0.012    0.012    0.012    0.012        .     0.11     1.28        .
  parse                    0.146        1    0.146    0.146    0.146    0.146        .     1.32    15.58        .
  check                    9.960        1    9.960    9.960    9.960    9.960        .    90.23  1062.97        .
  - usefulness             3.089        1    3.089    3.089    3.089    3.089        .    27.99   329.67        .
  - combine                0.125        1    0.125    0.125    0.125    0.125        .     1.13    13.34        .
  - exhaustiveness         6.741        1    6.741    6.741    6.741    6.741        .    61.07   719.42        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.11        .
  eval                     0.920        1    0.920    0.920    0.920    0.920        .     8.33    98.19        .
  total                   11.038        1   11.038   11.038   11.038   11.038        .   100.00  1178.01   10.101
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.192        1    0.192    0.192    0.192    0.192        .     0.98     2.04        .
  base                     9.433        1    9.433    9.433    9.433    9.433        .    48.25   100.00        .
  init                     0.126        1    0.126    0.126    0.126    0.126        .     0.64     1.34        .
  parse                    0.144        1    0.144    0.144    0.144    0.144        .     0.74     1.53        .
  check                    9.976        1    9.976    9.976    9.976    9.976        .    51.03   105.76        .
  - usefulness             3.109        1    3.109    3.109    3.109    3.109        .    15.90    32.96        .
  - combine                0.125        1    0.125    0.125    0.125    0.125        .     0.64     1.33        .
  - exhaustiveness         6.736        1    6.736    6.736    6.736    6.736        .    34.46    71.41        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  eval                     9.302        1    9.302    9.302    9.302    9.302        .    47.58    98.61        .
  total                   19.549        1   19.549   19.549   19.549   19.549        .   100.00   207.24   10.116
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_integer, obs(10000000) levels(1000) rep(1)
. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.009        1    0.009    0.009    0.009    0.009        .     0.09    90.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.10   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.150        1    0.150    0.150    0.150    0.150        .     1.49  1500.00        .
  check                    9.920        1    9.920    9.920    9.920    9.920        .    98.37 99200.00        .
  - usefulness             3.094        1    3.094    3.094    3.094    3.094        .    30.68 30940.00        .
  - combine                0.129        1    0.129    0.129    0.129    0.129        .     1.28  1290.00        .
  - exhaustiveness         6.691        1    6.691    6.691    6.691    6.691        .    66.35 66910.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     0.014        1    0.014    0.014    0.014    0.014        .     0.14   140.00        .
  total                   10.084        1   10.084   10.084   10.084   10.084        .   100.00  1.0e+05   10.074
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.004        1    0.004    0.004    0.004    0.004        .     0.04     3.60        .
  base                     0.111        1    0.111    0.111    0.111    0.111        .     1.09   100.00        .
  init                     0.005        1    0.005    0.005    0.005    0.005        .     0.05     4.50        .
  parse                    0.143        1    0.143    0.143    0.143    0.143        .     1.41   128.83        .
  check                    9.898        1    9.898    9.898    9.898    9.898        .    97.46  8917.12        .
  - usefulness             3.103        1    3.103    3.103    3.103    3.103        .    30.55  2795.50        .
  - combine                0.125        1    0.125    0.125    0.125    0.125        .     1.23   112.61        .
  - exhaustiveness         6.666        1    6.666    6.666    6.666    6.666        .    65.64  6005.41        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.90        .
  eval                     0.108        1    0.108    0.108    0.108    0.108        .     1.06    97.30        .
  total                   10.156        1   10.156   10.156   10.156   10.156        .   100.00  9149.55   10.045
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.017        1    0.017    0.017    0.017    0.017        .     0.15     1.49        .
  base                     1.144        1    1.144    1.144    1.144    1.144        .    10.24   100.00        .
  init                     0.059        1    0.059    0.059    0.059    0.059        .     0.53     5.16        .
  parse                    0.143        1    0.143    0.143    0.143    0.143        .     1.28    12.50        .
  check                    9.857        1    9.857    9.857    9.857    9.857        .    88.24   861.63        .
  - usefulness             3.082        1    3.082    3.082    3.082    3.082        .    27.59   269.41        .
  - combine                0.127        1    0.127    0.127    0.127    0.127        .     1.14    11.10        .
  - exhaustiveness         6.643        1    6.643    6.643    6.643    6.643        .    59.47   580.68        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.09        .
  eval                     1.111        1    1.111    1.111    1.111    1.111        .     9.95    97.12        .
  total                   11.171        1   11.171   11.171   11.171   11.171        .   100.00   976.49   10.027
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.207        1    0.207    0.207    0.207    0.207        .     1.04     2.12        .
  base                     9.773        1    9.773    9.773    9.773    9.773        .    49.11   100.00        .
  init                     0.330        1    0.330    0.330    0.330    0.330        .     1.66     3.38        .
  parse                    0.157        1    0.157    0.157    0.157    0.157        .     0.79     1.61        .
  check                    9.968        1    9.968    9.968    9.968    9.968        .    50.09   102.00        .
  - usefulness             3.112        1    3.112    3.112    3.112    3.112        .    15.64    31.84        .
  - combine                0.122        1    0.122    0.122    0.122    0.122        .     0.61     1.25        .
  - exhaustiveness         6.728        1    6.728    6.728    6.728    6.728        .    33.81    68.84        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  eval                     9.445        1    9.445    9.445    9.445    9.445        .    47.46    96.64        .
  total                   19.901        1   19.901   19.901   19.901   19.901        .   100.00   203.63   10.128
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_float,   obs(10000000) levels(1000) rep(1)
. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.02    20.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.09   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.02    20.00        .
  parse                    0.072        1    0.072    0.072    0.072    0.072        .     0.67   720.00        .
  check                   10.610        1   10.610   10.610   10.610   10.610        .    99.19  1.1e+05        .
  - usefulness             2.842        1    2.842    2.842    2.842    2.842        .    26.57 28420.00        .
  - combine                0.050        1    0.050    0.050    0.050    0.050        .     0.47   500.00        .
  - exhaustiveness         7.714        1    7.714    7.714    7.714    7.714        .    72.11 77140.00        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.12   130.00        .
  total                   10.697        1   10.697   10.697   10.697   10.697        .   100.00  1.1e+05   10.687
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.008        1    0.008    0.008    0.008    0.008        .     0.07     7.92        .
  base                     0.101        1    0.101    0.101    0.101    0.101        .     0.94   100.00        .
  init                     0.006        1    0.006    0.006    0.006    0.006        .     0.06     5.94        .
  parse                    0.068        1    0.068    0.068    0.068    0.068        .     0.63    67.33        .
  check                   10.580        1   10.580   10.580   10.580   10.580        .    98.37 10475.25        .
  - usefulness             2.821        1    2.821    2.821    2.821    2.821        .    26.23  2793.07        .
  - combine                0.051        1    0.051    0.051    0.051    0.051        .     0.47    50.50        .
  - exhaustiveness         7.704        1    7.704    7.704    7.704    7.704        .    71.63  7627.72        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.99        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.99        .
  eval                     0.100        1    0.100    0.100    0.100    0.100        .     0.93    99.01        .
  total                   10.755        1   10.755   10.755   10.755   10.755        .   100.00 10648.51   10.654
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.073        1    0.073    0.073    0.073    0.073        .     0.62     7.47        .
  base                     0.977        1    0.977    0.977    0.977    0.977        .     8.33   100.00        .
  init                     0.070        1    0.070    0.070    0.070    0.070        .     0.60     7.16        .
  parse                    0.071        1    0.071    0.071    0.071    0.071        .     0.61     7.27        .
  check                   10.610        1   10.610   10.610   10.610   10.610        .    90.51  1085.98        .
  - usefulness             2.824        1    2.824    2.824    2.824    2.824        .    24.09   289.05        .
  - combine                0.050        1    0.050    0.050    0.050    0.050        .     0.43     5.12        .
  - exhaustiveness         7.732        1    7.732    7.732    7.732    7.732        .    65.96   791.40        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.10        .
  eval                     0.971        1    0.971    0.971    0.971    0.971        .     8.28    99.39        .
  total                   11.722        1   11.722   11.722   11.722   11.722        .   100.00  1199.80   10.745
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.754        1    0.754    0.754    0.754    0.754        .     3.57     7.58        .
  base                     9.941        1    9.941    9.941    9.941    9.941        .    47.12   100.00        .
  init                     0.525        1    0.525    0.525    0.525    0.525        .     2.49     5.28        .
  parse                    0.067        1    0.067    0.067    0.067    0.067        .     0.32     0.67        .
  check                   10.560        1   10.560   10.560   10.560   10.560        .    50.06   106.23        .
  - usefulness             2.861        1    2.861    2.861    2.861    2.861        .    13.56    28.78        .
  - combine                0.051        1    0.051    0.051    0.051    0.051        .     0.24     0.51        .
  - exhaustiveness         7.645        1    7.645    7.645    7.645    7.645        .    36.24    76.90        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     9.943        1    9.943    9.943    9.943    9.943        .    47.13   100.02        .
  total                   21.096        1   21.096   21.096   21.096   21.096        .   100.00   212.21   11.155
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_string,  obs(10000000) levels(1000) rep(1)
. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.608     1000    0.001    0.002    0.002    0.003    0.001   143.32   512.10        .
  base                     0.314     1000    0.000    0.000    0.000    0.002    0.000    27.99   100.00        .
  init                     0.078     1000    0.000    0.000    0.000    0.001    0.000     6.95    24.84        .
  parse                    0.661     1000    0.000    0.001    0.001    0.002    0.000    58.91   210.51        .
  check                    0.002     1000    0.000    0.000    0.000    0.001    0.000     0.18     0.64        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.354     1000    0.000    0.000    0.000    0.001    0.000    31.55   112.74        .
  total                    1.122     1000    0.001    0.001    0.001    0.003    0.000   100.00   357.32    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.543     1000    0.002    0.004    0.004    0.005    0.001   107.20   133.70        .
  base                     2.650     1000    0.002    0.003    0.003    0.004    0.001    80.18   100.00        .
  init                     0.089     1000    0.000    0.000    0.000    0.001    0.000     2.69     3.36        .
  parse                    0.628     1000    0.000    0.001    0.001    0.002    0.000    19.00    23.70        .
  check                    0.005     1000    0.000    0.000    0.000    0.001    0.000     0.15     0.19        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.556     1000    0.002    0.003    0.003    0.004    0.001    77.34    96.45        .
  total                    3.305     1000    0.003    0.003    0.003    0.006    0.000   100.00   124.72    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.364      100    0.012    0.014    0.014    0.016    0.001    52.79    53.79        .
  base                     2.536      100    0.024    0.025    0.025    0.029    0.001    98.14   100.00        .
  init                     0.011      100    0.000    0.000    0.000    0.001    0.000     0.43     0.43        .
  parse                    0.063      100    0.000    0.001    0.001    0.001    0.000     2.44     2.48        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.507      100    0.024    0.025    0.025    0.031    0.001    97.02    98.86        .
  total                    2.584      100    0.025    0.026    0.026    0.032    0.001   100.00   101.89    0.000
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.187       10    0.178    0.219    0.214    0.288    0.035    77.28    74.92        .
  base                     2.919       10    0.255    0.292    0.285    0.342    0.030   103.14   100.00        .
  init                     0.002       10    0.000    0.000    0.000    0.001    0.000     0.07     0.07        .
  parse                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.28     0.27        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.820       10    0.252    0.282    0.271    0.339    0.029    99.65    96.61        .
  total                    2.830       10    0.253    0.283    0.272    0.340    0.030   100.00    96.95   -0.009
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               4.016        1    4.016    4.016    4.016    4.016        .   100.27    94.83        .
  base                     4.235        1    4.235    4.235    4.235    4.235        .   105.74   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.02        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     4.004        1    4.004    4.004    4.004    4.004        .    99.98    94.55        .
  total                    4.005        1    4.005    4.005    4.005    4.005        .   100.00    94.57   -0.230
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.053     1000    0.001    0.002    0.002    0.006    0.001    71.21   235.17        .
  base                     0.873     1000    0.000    0.001    0.001    0.008    0.000    30.28   100.00        .
  init                     0.237     1000    0.000    0.000    0.000    0.001    0.000     8.22    27.15        .
  parse                    1.602     1000    0.000    0.002    0.002    0.005    0.001    55.57   183.51        .
  check                    0.014     1000    0.000    0.000    0.000    0.001    0.000     0.49     1.60        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.958     1000    0.000    0.001    0.001    0.006    0.000    33.23   109.74        .
  total                    2.883     1000    0.001    0.003    0.003    0.008    0.001   100.00   330.24    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.720     1000    0.002    0.006    0.006    0.010    0.001    57.44    72.55        .
  base                     7.884     1000    0.003    0.008    0.008    0.017    0.002    79.16   100.00        .
  init                     0.217     1000    0.000    0.000    0.000    0.001    0.000     2.18     2.75        .
  parse                    1.655     1000    0.000    0.002    0.002    0.004    0.001    16.62    20.99        .
  check                    0.011     1000    0.000    0.000    0.000    0.001    0.000     0.11     0.14        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     7.998     1000    0.003    0.008    0.008    0.018    0.002    80.31   101.45        .
  total                    9.959     1000    0.004    0.010    0.010    0.022    0.002   100.00   126.32    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.298      100    0.020    0.033    0.034    0.047    0.007    38.29    35.86        .
  base                     9.197      100    0.068    0.092    0.088    0.144    0.015   106.78   100.00        .
  init                     0.013      100    0.000    0.000    0.000    0.001    0.000     0.15     0.14        .
  parse                    0.113      100    0.000    0.001    0.001    0.003    0.001     1.31     1.23        .
  check                    0.003      100    0.000    0.000    0.000    0.001    0.000     0.03     0.03        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     8.480      100    0.067    0.085    0.079    0.148    0.018    98.46    92.20        .
  total                    8.613      100    0.068    0.086    0.082    0.150    0.018   100.00    93.65   -0.006
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.680       10    0.227    0.268    0.270    0.290    0.020    66.14    63.34        .
  base                     4.231       10    0.340    0.423    0.405    0.535    0.065   104.42   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.02        .
  parse                    0.010       10    0.000    0.001    0.001    0.002    0.000     0.25     0.24        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     4.041       10    0.359    0.404    0.391    0.460    0.029    99.73    95.51        .
  total                    4.052       10    0.360    0.405    0.392    0.461    0.029   100.00    95.77   -0.018
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               4.591        1    4.591    4.591    4.591    4.591        .   112.75   111.54        .
  base                     4.116        1    4.116    4.116    4.116    4.116        .   101.08   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.02        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     4.071        1    4.071    4.071    4.071    4.071        .    99.98    98.91        .
  total                    4.072        1    4.072    4.072    4.072    4.072        .   100.00    98.93   -0.044
-------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.502     1000    0.002    0.004    0.003    0.009    0.001   137.50   636.73        .
  base                     0.550     1000    0.000    0.001    0.001    0.002    0.001    21.59   100.00        .
  init                     0.214     1000    0.000    0.000    0.000    0.001    0.000     8.40    38.91        .
  parse                    1.703     1000    0.001    0.002    0.002    0.004    0.000    66.86   309.64        .
  check                    0.010     1000    0.000    0.000    0.000    0.001    0.000     0.39     1.82        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.555     1000    0.000    0.001    0.001    0.003    0.001    21.79   100.91        .
  total                    2.547     1000    0.001    0.003    0.003    0.006    0.001   100.00   463.09    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              19.402     1000    0.009    0.019    0.019    0.033    0.002   310.13   458.57        .
  base                     4.231     1000    0.001    0.004    0.004    0.011    0.001    67.63   100.00        .
  init                     0.241     1000    0.000    0.000    0.000    0.001    0.000     3.85     5.70        .
  parse                    1.748     1000    0.001    0.002    0.002    0.004    0.000    27.94    41.31        .
  check                    0.011     1000    0.000    0.000    0.000    0.001    0.000     0.18     0.26        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     4.207     1000    0.002    0.004    0.004    0.009    0.001    67.25    99.43        .
  total                    6.256     1000    0.003    0.006    0.006    0.012    0.001   100.00   147.86    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              11.713      100    0.082    0.117    0.110    0.177    0.019   442.67   345.82        .
  base                     3.387      100    0.019    0.034    0.037    0.043    0.008   128.00   100.00        .
  init                     0.011      100    0.000    0.000    0.000    0.001    0.000     0.42     0.32        .
  parse                    0.137      100    0.000    0.001    0.001    0.002    0.001     5.18     4.04        .
  check                    0.001      100    0.000    0.000    0.000    0.001    0.000     0.04     0.03        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.490      100    0.018    0.025    0.021    0.047    0.008    94.10    73.52        .
  total                    2.646      100    0.019    0.026    0.023    0.049    0.008   100.00    78.12   -0.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              10.790       10    0.978    1.079    1.069    1.184    0.074   443.49   407.48        .
  base                     2.648       10    0.202    0.265    0.259    0.341    0.041   108.84   100.00        .
  init                     0.002       10    0.000    0.000    0.000    0.001    0.000     0.08     0.08        .
  parse                    0.011       10    0.001    0.001    0.001    0.002    0.000     0.45     0.42        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.420       10    0.197    0.242    0.234    0.290    0.033    99.47    91.39        .
  total                    2.433       10    0.198    0.243    0.235    0.292    0.033   100.00    91.88   -0.022
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              12.499        1   12.499   12.499   12.499   12.499        .   525.39   543.91        .
  base                     2.298        1    2.298    2.298    2.298    2.298        .    96.60   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.378        1    2.378    2.378    2.378    2.378        .    99.96   103.48        .
  total                    2.379        1    2.379    2.379    2.379    2.379        .   100.00   103.52    0.081
-------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:   3 Oct 2024, 19:18:38
----------------------------------------------------------------------------------------------------------------------------------
