------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  26 Sep 2024, 14:07:37

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.672     1000    0.000    0.002    0.002    0.004    0.001    15.30   222.05        .
  base                     0.753     1000    0.000    0.001    0.001    0.002    0.000     6.89   100.00        .
  init                     1.300     1000    0.000    0.001    0.001    0.006    0.001    11.90   172.64        .
  parse                    1.710     1000    0.000    0.002    0.002    0.004    0.001    15.65   227.09        .
  check                    6.902     1000    0.003    0.007    0.007    0.014    0.001    63.18   916.60        .
  - usefulness             2.428     1000    0.001    0.002    0.003    0.006    0.001    22.22   322.44        .
  - combine                0.120     1000    0.000    0.000    0.000    0.001    0.000     1.10    15.94        .
  - exhaustiveness         4.152     1000    0.001    0.004    0.004    0.010    0.001    38.00   551.39        .
  - compress               0.014     1000    0.000    0.000    0.000    0.001    0.000     0.13     1.86        .
  - print                  0.062     1000    0.000    0.000    0.000    0.003    0.000     0.57     8.23        .
  eval                     0.939     1000    0.000    0.001    0.001    0.012    0.001     8.59   124.70        .
  total                   10.925     1000    0.005    0.011    0.012    0.023    0.002   100.00  1450.86    0.010
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.938     1000    0.005    0.009    0.009    0.014    0.001    47.78   124.57        .
  base                     7.175     1000    0.003    0.007    0.008    0.015    0.002    38.35   100.00        .
  init                     2.234     1000    0.001    0.002    0.002    0.006    0.001    11.94    31.14        .
  parse                    1.728     1000    0.000    0.002    0.002    0.005    0.001     9.24    24.08        .
  check                    6.885     1000    0.003    0.007    0.008    0.015    0.002    36.80    95.96        .
  - usefulness             2.439     1000    0.001    0.002    0.003    0.006    0.001    13.04    33.99        .
  - combine                0.139     1000    0.000    0.000    0.000    0.001    0.000     0.74     1.94        .
  - exhaustiveness         4.129     1000    0.002    0.004    0.004    0.008    0.001    22.07    57.55        .
  - compress               0.017     1000    0.000    0.000    0.000    0.001    0.000     0.09     0.24        .
  - print                  0.040     1000    0.000    0.000    0.000    0.001    0.000     0.21     0.56        .
  eval                     7.784     1000    0.003    0.008    0.009    0.016    0.002    41.61   108.49        .
  total                   18.708     1000    0.009    0.019    0.021    0.029    0.005   100.00   260.74    0.012
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.607      100    0.043    0.066    0.068    0.089    0.011    96.28   133.77        .
  base                     4.939      100    0.036    0.049    0.045    0.086    0.014    71.98   100.00        .
  init                     0.906      100    0.006    0.009    0.007    0.017    0.004    13.20    18.34        .
  parse                    0.123      100    0.000    0.001    0.001    0.003    0.001     1.79     2.49        .
  check                    0.479      100    0.003    0.005    0.004    0.011    0.002     6.98     9.70        .
  - usefulness             0.175      100    0.001    0.002    0.002    0.006    0.001     2.55     3.54        .
  - combine                0.010      100    0.000    0.000    0.000    0.001    0.000     0.15     0.20        .
  - exhaustiveness         0.279      100    0.001    0.003    0.002    0.006    0.001     4.07     5.65        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.005      100    0.000    0.000    0.000    0.001    0.000     0.07     0.10        .
  eval                     5.349      100    0.038    0.053    0.047    0.093    0.015    77.95   108.30        .
  total                    6.862      100    0.049    0.069    0.065    0.113    0.018   100.00   138.94    0.019
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.570       10    0.493    0.557    0.542    0.641    0.043   119.43   132.27        .
  base                     4.211       10    0.367    0.421    0.410    0.516    0.045    90.29   100.00        .
  init                     0.655       10    0.056    0.066    0.058    0.082    0.011    14.04    15.55        .
  parse                    0.012       10    0.001    0.001    0.001    0.002    0.000     0.26     0.28        .
  check                    0.041       10    0.003    0.004    0.004    0.007    0.001     0.88     0.97        .
  - usefulness             0.013       10    0.001    0.001    0.001    0.003    0.001     0.28     0.31        .
  - combine                0.002       10    0.000    0.000    0.000    0.001    0.000     0.04     0.05        .
  - exhaustiveness         0.024       10    0.002    0.002    0.002    0.004    0.001     0.51     0.57        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     3.956       10    0.323    0.396    0.380    0.506    0.053    84.82    93.94        .
  total                    4.664       10    0.384    0.466    0.463    0.569    0.056   100.00   110.76    0.045
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.086        1    7.086    7.086    7.086    7.086        .   142.12   182.72        .
  base                     3.878        1    3.878    3.878    3.878    3.878        .    77.78   100.00        .
  init                     0.753        1    0.753    0.753    0.753    0.753        .    15.10    19.42        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.03        .
  check                    0.003        1    0.003    0.003    0.003    0.003        .     0.06     0.08        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.03        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.04     0.05        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     4.229        1    4.229    4.229    4.229    4.229        .    84.82   109.05        .
  total                    4.986        1    4.986    4.986    4.986    4.986        .   100.00   128.57    1.108
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.593     1000    0.000    0.002    0.002    0.005    0.001    13.80   206.61        .
  base                     0.771     1000    0.000    0.001    0.001    0.004    0.000     6.68   100.00        .
  init                     2.007     1000    0.000    0.002    0.002    0.006    0.001    17.38   260.31        .
  parse                    1.678     1000    0.000    0.002    0.002    0.004    0.001    14.53   217.64        .
  check                    6.869     1000    0.003    0.007    0.007    0.014    0.002    59.50   890.92        .
  - usefulness             2.432     1000    0.001    0.002    0.002    0.005    0.001    21.07   315.43        .
  - combine                0.130     1000    0.000    0.000    0.000    0.003    0.000     1.13    16.86        .
  - exhaustiveness         4.086     1000    0.001    0.004    0.004    0.009    0.001    35.39   529.96        .
  - compress               0.018     1000    0.000    0.000    0.000    0.001    0.000     0.16     2.33        .
  - print                  0.067     1000    0.000    0.000    0.000    0.002    0.000     0.58     8.69        .
  eval                     0.922     1000    0.000    0.001    0.001    0.002    0.000     7.99   119.58        .
  total                   11.545     1000    0.005    0.012    0.012    0.021    0.002   100.00  1497.41    0.011
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.361     1000    0.003    0.007    0.008    0.014    0.001    30.30   108.63        .
  base                     6.776     1000    0.003    0.007    0.007    0.014    0.001    27.89   100.00        .
  init                     8.371     1000    0.004    0.008    0.009    0.015    0.002    34.45   123.54        .
  parse                    1.692     1000    0.000    0.002    0.002    0.004    0.001     6.96    24.97        .
  check                    7.063     1000    0.003    0.007    0.007    0.014    0.001    29.07   104.24        .
  - usefulness             2.503     1000    0.001    0.003    0.003    0.006    0.001    10.30    36.94        .
  - combine                0.140     1000    0.000    0.000    0.000    0.001    0.000     0.58     2.07        .
  - exhaustiveness         4.222     1000    0.002    0.004    0.004    0.009    0.001    17.38    62.31        .
  - compress               0.021     1000    0.000    0.000    0.000    0.001    0.000     0.09     0.31        .
  - print                  0.051     1000    0.000    0.000    0.000    0.001    0.000     0.21     0.75        .
  eval                     7.091     1000    0.003    0.007    0.007    0.033    0.002    29.18   104.65        .
  total                   24.297     1000    0.011    0.024    0.025    0.051    0.004   100.00   358.57    0.018
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.432      100    0.031    0.054    0.056    0.078    0.011    49.58   129.73        .
  base                     4.187      100    0.030    0.042    0.036    0.080    0.012    38.22   100.00        .
  init                     5.762      100    0.044    0.058    0.047    0.104    0.015    52.60   137.62        .
  parse                    0.120      100    0.000    0.001    0.001    0.005    0.001     1.10     2.87        .
  check                    0.475      100    0.003    0.005    0.004    0.009    0.002     4.34    11.34        .
  - usefulness             0.172      100    0.001    0.002    0.002    0.003    0.001     1.57     4.11        .
  - combine                0.008      100    0.000    0.000    0.000    0.001    0.000     0.07     0.19        .
  - exhaustiveness         0.283      100    0.001    0.003    0.002    0.005    0.001     2.58     6.76        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.004      100    0.000    0.000    0.000    0.001    0.000     0.04     0.10        .
  eval                     4.592      100    0.032    0.046    0.043    0.074    0.013    41.92   109.67        .
  total                   10.955      100    0.080    0.110    0.109    0.187    0.023   100.00   261.64    0.068
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.616       10    0.521    0.562    0.559    0.607    0.029    55.55   132.67        .
  base                     4.233       10    0.385    0.423    0.422    0.456    0.024    41.87   100.00        .
  init                     5.567       10    0.493    0.557    0.546    0.624    0.043    55.06   131.51        .
  parse                    0.013       10    0.001    0.001    0.001    0.002    0.000     0.13     0.31        .
  check                    0.050       10    0.003    0.005    0.004    0.008    0.002     0.49     1.18        .
  - usefulness             0.017       10    0.001    0.002    0.001    0.003    0.001     0.17     0.40        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.030       10    0.002    0.003    0.002    0.005    0.001     0.30     0.71        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.002       10    0.000    0.000    0.000    0.001    0.000     0.02     0.05        .
  eval                     4.479       10    0.361    0.448    0.431    0.513    0.050    44.30   105.81        .
  total                   10.110       10    0.913    1.011    1.004    1.140    0.071   100.00   238.84    0.588
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.707        1    7.707    7.707    7.707    7.707        .    72.97   178.57        .
  base                     4.316        1    4.316    4.316    4.316    4.316        .    40.86   100.00        .
  init                     6.011        1    6.011    6.011    6.011    6.011        .    56.91   139.27        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.02     0.05        .
  check                    0.008        1    0.008    0.008    0.008    0.008        .     0.08     0.19        .
  - usefulness             0.003        1    0.003    0.003    0.003    0.003        .     0.03     0.07        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.004        1    0.004    0.004    0.004    0.004        .     0.04     0.09        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     4.541        1    4.541    4.541    4.541    4.541        .    42.99   105.21        .
  total                   10.562        1   10.562   10.562   10.562   10.562        .   100.00   244.72    6.246
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.012     1000    0.000    0.002    0.002    0.007    0.001    19.93   317.85        .
  base                     0.633     1000    0.000    0.001    0.001    0.004    0.001     6.27   100.00        .
  init                     1.187     1000    0.000    0.001    0.001    0.005    0.001    11.76   187.52        .
  parse                    1.337     1000    0.000    0.001    0.001    0.005    0.001    13.24   211.22        .
  check                    6.769     1000    0.003    0.007    0.007    0.014    0.002    67.05  1069.35        .
  - usefulness             2.212     1000    0.001    0.002    0.002    0.005    0.001    21.91   349.45        .
  - combine                0.069     1000    0.000    0.000    0.000    0.001    0.000     0.68    10.90        .
  - exhaustiveness         4.324     1000    0.002    0.004    0.005    0.010    0.001    42.83   683.10        .
  - compress               0.010     1000    0.000    0.000    0.000    0.001    0.000     0.10     1.58        .
  - print                  0.040     1000    0.000    0.000    0.000    0.001    0.000     0.40     6.32        .
  eval                     0.722     1000    0.000    0.001    0.001    0.004    0.000     7.15   114.06        .
  total                   10.096     1000    0.004    0.010    0.011    0.021    0.002   100.00  1594.94    0.009
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              12.741     1000    0.006    0.013    0.013    0.051    0.002    51.60   225.07        .
  base                     5.661     1000    0.002    0.006    0.006    0.012    0.001    22.92   100.00        .
  init                    11.493     1000    0.005    0.011    0.012    0.020    0.002    46.54   203.02        .
  parse                    1.402     1000    0.000    0.001    0.001    0.005    0.001     5.68    24.77        .
  check                    6.719     1000    0.003    0.007    0.007    0.014    0.002    27.21   118.69        .
  - usefulness             2.215     1000    0.001    0.002    0.002    0.006    0.001     8.97    39.13        .
  - combine                0.090     1000    0.000    0.000    0.000    0.001    0.000     0.36     1.59        .
  - exhaustiveness         4.245     1000    0.002    0.004    0.005    0.009    0.001    17.19    74.99        .
  - compress               0.011     1000    0.000    0.000    0.000    0.001    0.000     0.04     0.19        .
  - print                  0.051     1000    0.000    0.000    0.000    0.001    0.000     0.21     0.90        .
  eval                     5.015     1000    0.002    0.005    0.005    0.012    0.001    20.31    88.59        .
  total                   24.694     1000    0.012    0.025    0.026    0.040    0.005   100.00   436.21    0.019
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               9.628      100    0.059    0.096    0.097    0.133    0.016    73.41   267.59        .
  base                     3.598      100    0.025    0.036    0.032    0.059    0.010    27.43   100.00        .
  init                     8.990      100    0.069    0.090    0.085    0.151    0.019    68.54   249.86        .
  parse                    0.104      100    0.000    0.001    0.001    0.002    0.001     0.79     2.89        .
  check                    0.468      100    0.003    0.005    0.004    0.009    0.002     3.57    13.01        .
  - usefulness             0.153      100    0.001    0.002    0.001    0.003    0.001     1.17     4.25        .
  - combine                0.002      100    0.000    0.000    0.000    0.001    0.000     0.02     0.06        .
  - exhaustiveness         0.299      100    0.002    0.003    0.003    0.006    0.001     2.28     8.31        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.03        .
  - print                  0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     0.08        .
  eval                     3.549      100    0.025    0.035    0.029    0.059    0.011    27.06    98.64        .
  total                   13.116      100    0.101    0.131    0.128    0.193    0.025   100.00   364.54    0.095
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.911       10    0.774    0.891    0.863    1.033    0.093    78.49   263.95        .
  base                     3.376       10    0.268    0.338    0.348    0.382    0.038    29.74   100.00        .
  init                     7.759       10    0.677    0.776    0.763    0.895    0.063    68.34   229.83        .
  parse                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.07     0.24        .
  check                    0.034       10    0.003    0.003    0.003    0.004    0.001     0.30     1.01        .
  - usefulness             0.011       10    0.001    0.001    0.001    0.002    0.000     0.10     0.33        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.021       10    0.002    0.002    0.002    0.003    0.000     0.18     0.62        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.002       10    0.000    0.000    0.000    0.001    0.000     0.02     0.06        .
  eval                     3.550       10    0.323    0.355    0.329    0.418    0.040    31.27   105.15        .
  total                   11.353       10    1.034    1.135    1.092    1.311    0.084   100.00   336.29    0.798
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              10.646        1   10.646   10.646   10.646   10.646        .    95.50   313.39        .
  base                     3.397        1    3.397    3.397    3.397    3.397        .    30.47   100.00        .
  init                     7.487        1    7.487    7.487    7.487    7.487        .    67.16   220.40        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.03        .
  check                    0.004        1    0.004    0.004    0.004    0.004        .     0.04     0.12        .
  - usefulness             0.002        1    0.002    0.002    0.002    0.002        .     0.02     0.06        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.02     0.06        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     3.656        1    3.656    3.656    3.656    3.656        .    32.80   107.62        .
  total                   11.148        1   11.148   11.148   11.148   11.148        .   100.00   328.17    7.751
-------------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.128      100    0.000    0.001    0.001    0.002    0.000     0.60    56.14        .
  base                     0.228      100    0.001    0.002    0.002    0.004    0.001     1.07   100.00        .
  init                     0.111      100    0.000    0.001    0.001    0.005    0.001     0.52    48.68        .
  parse                    0.603      100    0.004    0.006    0.005    0.013    0.002     2.82   264.47        .
  check                   20.404      100    0.147    0.204    0.203    0.277    0.029    95.42  8949.12        .
  - usefulness             6.363      100    0.043    0.064    0.063    0.098    0.013    29.76  2790.79        .
  - combine                0.151      100    0.001    0.002    0.001    0.003    0.001     0.71    66.23        .
  - exhaustiveness        13.848      100    0.099    0.138    0.136    0.204    0.026    64.76  6073.68        .
  - compress               0.003      100    0.000    0.000    0.000    0.001    0.000     0.01     1.32        .
  - print                  0.013      100    0.000    0.000    0.000    0.001    0.000     0.06     5.70        .
  eval                     0.247      100    0.001    0.002    0.002    0.005    0.001     1.16   108.33        .
  total                   21.383      100    0.154    0.214    0.212    0.287    0.030   100.00  9378.51    0.212
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.613      100    0.004    0.006    0.006    0.009    0.001     2.65    28.18        .
  base                     2.175      100    0.013    0.022    0.023    0.037    0.007     9.41   100.00        .
  init                     0.341      100    0.002    0.003    0.003    0.007    0.001     1.47    15.68        .
  parse                    0.660      100    0.004    0.007    0.007    0.013    0.002     2.85    30.34        .
  check                   20.225      100    0.151    0.202    0.201    0.279    0.029    87.47   929.89        .
  - usefulness             6.120      100    0.043    0.061    0.059    0.093    0.015    26.47   281.38        .
  - combine                0.154      100    0.001    0.002    0.001    0.004    0.001     0.67     7.08        .
  - exhaustiveness        13.906      100    0.104    0.139    0.135    0.197    0.025    60.14   639.36        .
  - compress               0.003      100    0.000    0.000    0.000    0.001    0.000     0.01     0.14        .
  - print                  0.016      100    0.000    0.000    0.000    0.001    0.000     0.07     0.74        .
  eval                     1.888      100    0.013    0.019    0.015    0.038    0.007     8.17    86.80        .
  total                   23.123      100    0.171    0.231    0.233    0.318    0.031   100.00  1063.13    0.209
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.510       10    0.036    0.051    0.052    0.064    0.010    14.45    31.06        .
  base                     1.642       10    0.131    0.164    0.159    0.198    0.024    46.52   100.00        .
  init                     0.161       10    0.015    0.016    0.016    0.018    0.001     4.56     9.81        .
  parse                    0.044       10    0.004    0.004    0.004    0.005    0.001     1.25     2.68        .
  check                    1.840       10    0.147    0.184    0.177    0.248    0.032    52.12   112.06        .
  - usefulness             0.529       10    0.044    0.053    0.045    0.072    0.012    14.99    32.22        .
  - combine                0.014       10    0.001    0.001    0.001    0.003    0.001     0.40     0.85        .
  - exhaustiveness         1.293       10    0.102    0.129    0.116    0.177    0.026    36.63    78.75        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.06        .
  eval                     1.485       10    0.134    0.149    0.139    0.175    0.017    42.07    90.44        .
  total                    3.530       10    0.303    0.353    0.347    0.407    0.038   100.00   214.98    0.189
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.605        1    0.605    0.605    0.605    0.605        .    28.50    33.86        .
  base                     1.787        1    1.787    1.787    1.787    1.787        .    84.17   100.00        .
  init                     0.199        1    0.199    0.199    0.199    0.199        .     9.37    11.14        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.19     0.22        .
  check                    0.230        1    0.230    0.230    0.230    0.230        .    10.83    12.87        .
  - usefulness             0.092        1    0.092    0.092    0.092    0.092        .     4.33     5.15        .
  - combine                0.002        1    0.002    0.002    0.002    0.002        .     0.09     0.11        .
  - exhaustiveness         0.135        1    0.135    0.135    0.135    0.135        .     6.36     7.55        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.690        1    1.690    1.690    1.690    1.690        .    79.60    94.57        .
  total                    2.123        1    2.123    2.123    2.123    2.123        .   100.00   118.80    0.336
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.110        1    7.110    7.110    7.110    7.110        .    34.37    41.06        .
  base                    17.315        1   17.315   17.315   17.315   17.315        .    83.71   100.00        .
  init                     1.827        1    1.827    1.827    1.827    1.827        .     8.83    10.55        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.02     0.02        .
  check                    0.230        1    0.230    0.230    0.230    0.230        .     1.11     1.33        .
  - usefulness             0.045        1    0.045    0.045    0.045    0.045        .     0.22     0.26        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - exhaustiveness         0.183        1    0.183    0.183    0.183    0.183        .     0.88     1.06        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    18.624        1   18.624   18.624   18.624   18.624        .    90.04   107.56        .
  total                   20.685        1   20.685   20.685   20.685   20.685        .   100.00   119.46    3.370
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.145      100    0.000    0.001    0.001    0.003    0.001     0.66    61.18        .
  base                     0.237      100    0.001    0.002    0.002    0.004    0.001     1.07   100.00        .
  init                     0.167      100    0.001    0.002    0.002    0.003    0.001     0.76    70.46        .
  parse                    0.675      100    0.004    0.007    0.007    0.017    0.002     3.05   284.81        .
  check                   20.990      100    0.150    0.210    0.203    0.301    0.031    94.91  8856.54        .
  - usefulness             6.693      100    0.043    0.067    0.066    0.096    0.014    30.26  2824.05        .
  - combine                0.148      100    0.001    0.001    0.001    0.004    0.001     0.67    62.45        .
  - exhaustiveness        14.103      100    0.100    0.141    0.139    0.209    0.025    63.77  5950.63        .
  - compress               0.003      100    0.000    0.000    0.000    0.001    0.000     0.01     1.27        .
  - print                  0.015      100    0.000    0.000    0.000    0.001    0.000     0.07     6.33        .
  eval                     0.277      100    0.001    0.003    0.002    0.023    0.002     1.25   116.88        .
  total                   22.116      100    0.157    0.221    0.217    0.317    0.031   100.00  9331.65    0.219
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.626      100    0.003    0.006    0.006    0.010    0.001     2.59    26.51        .
  base                     2.361      100    0.013    0.024    0.025    0.053    0.007     9.75   100.00        .
  init                     0.707      100    0.003    0.007    0.008    0.012    0.002     2.92    29.94        .
  parse                    0.769      100    0.004    0.008    0.008    0.010    0.002     3.18    32.57        .
  check                   20.850      100    0.146    0.209    0.201    0.314    0.034    86.14   883.10        .
  - usefulness             6.920      100    0.044    0.069    0.068    0.105    0.016    28.59   293.10        .
  - combine                0.156      100    0.001    0.002    0.001    0.003    0.001     0.64     6.61        .
  - exhaustiveness        13.727      100    0.100    0.137    0.132    0.207    0.027    56.71   581.41        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.01     0.08        .
  - print                  0.010      100    0.000    0.000    0.000    0.001    0.000     0.04     0.42        .
  eval                     1.873      100    0.014    0.019    0.015    0.034    0.006     7.74    79.33        .
  total                   24.206      100    0.173    0.242    0.239    0.355    0.036   100.00  1025.24    0.218
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.515       10    0.039    0.052    0.051    0.060    0.008    11.44    30.33        .
  base                     1.698       10    0.136    0.170    0.160    0.221    0.028    37.72   100.00        .
  init                     0.612       10    0.044    0.061    0.058    0.081    0.013    13.60    36.04        .
  parse                    0.069       10    0.004    0.007    0.004    0.011    0.003     1.53     4.06        .
  check                    2.074       10    0.174    0.207    0.195    0.257    0.029    46.08   122.14        .
  - usefulness             0.669       10    0.052    0.067    0.069    0.079    0.009    14.86    39.40        .
  - combine                0.015       10    0.001    0.002    0.001    0.003    0.001     0.33     0.88        .
  - exhaustiveness         1.385       10    0.103    0.139    0.122    0.181    0.031    30.77    81.57        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.002       10    0.000    0.000    0.000    0.001    0.000     0.04     0.12        .
  eval                     1.745       10    0.137    0.174    0.162    0.248    0.035    38.77   102.77        .
  total                    4.501       10    0.393    0.450    0.445    0.561    0.051   100.00   265.08    0.280
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.554        1    0.554    0.554    0.554    0.554        .    21.29    30.56        .
  base                     1.813        1    1.813    1.813    1.813    1.813        .    69.68   100.00        .
  init                     0.516        1    0.516    0.516    0.516    0.516        .    19.83    28.46        .
  parse                    0.009        1    0.009    0.009    0.009    0.009        .     0.35     0.50        .
  check                    0.199        1    0.199    0.199    0.199    0.199        .     7.65    10.98        .
  - usefulness             0.091        1    0.091    0.091    0.091    0.091        .     3.50     5.02        .
  - combine                0.002        1    0.002    0.002    0.002    0.002        .     0.08     0.11        .
  - exhaustiveness         0.106        1    0.106    0.106    0.106    0.106        .     4.07     5.85        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.878        1    1.878    1.878    1.878    1.878        .    72.18   103.59        .
  total                    2.602        1    2.602    2.602    2.602    2.602        .   100.00   143.52    0.789
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.354        1    7.354    7.354    7.354    7.354        .    31.66    42.22        .
  base                    17.417        1   17.417   17.417   17.417   17.417        .    74.97   100.00        .
  init                     5.364        1    5.364    5.364    5.364    5.364        .    23.09    30.80        .
  parse                    0.008        1    0.008    0.008    0.008    0.008        .     0.03     0.05        .
  check                    0.204        1    0.204    0.204    0.204    0.204        .     0.88     1.17        .
  - usefulness             0.063        1    0.063    0.063    0.063    0.063        .     0.27     0.36        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - exhaustiveness         0.139        1    0.139    0.139    0.139    0.139        .     0.60     0.80        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    17.655        1   17.655   17.655   17.655   17.655        .    76.00   101.37        .
  total                   23.231        1   23.231   23.231   23.231   23.231        .   100.00   133.38    5.814
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.193      100    0.001    0.002    0.002    0.003    0.001     0.81    74.23        .
  base                     0.260      100    0.001    0.003    0.003    0.006    0.001     1.09   100.00        .
  init                     0.127      100    0.000    0.001    0.001    0.002    0.001     0.53    48.85        .
  parse                    0.430      100    0.002    0.004    0.004    0.007    0.001     1.81   165.38        .
  check                   22.944      100    0.161    0.229    0.227    0.294    0.032    96.50  8824.62        .
  - usefulness             6.394      100    0.040    0.064    0.062    0.094    0.014    26.89  2459.23        .
  - combine                0.065      100    0.000    0.001    0.001    0.002    0.001     0.27    25.00        .
  - exhaustiveness        16.438      100    0.119    0.164    0.161    0.228    0.027    69.13  6322.31        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.01     0.77        .
  - print                  0.012      100    0.000    0.000    0.000    0.001    0.000     0.05     4.62        .
  eval                     0.268      100    0.001    0.003    0.002    0.026    0.003     1.13   103.08        .
  total                   23.777      100    0.166    0.238    0.234    0.305    0.033   100.00  9145.00    0.235
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.224      100    0.006    0.012    0.012    0.024    0.003     4.88    50.04        .
  base                     2.446      100    0.013    0.024    0.025    0.045    0.007     9.74   100.00        .
  init                     1.075      100    0.006    0.011    0.012    0.017    0.003     4.28    43.95        .
  parse                    0.426      100    0.002    0.004    0.004    0.009    0.001     1.70    17.42        .
  check                   21.778      100    0.160    0.218    0.216    0.297    0.033    86.76   890.35        .
  - usefulness             5.588      100    0.040    0.056    0.050    0.092    0.015    22.26   228.45        .
  - combine                0.063      100    0.000    0.001    0.001    0.002    0.001     0.25     2.58        .
  - exhaustiveness        16.085      100    0.117    0.161    0.158    0.218    0.026    64.08   657.60        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.00     0.04        .
  - print                  0.009      100    0.000    0.000    0.000    0.001    0.000     0.04     0.37        .
  eval                     1.814      100    0.013    0.018    0.014    0.033    0.006     7.23    74.16        .
  total                   25.102      100    0.184    0.251    0.253    0.337    0.035   100.00  1026.25    0.227
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.096       10    0.076    0.110    0.108    0.139    0.019    22.46    59.31        .
  base                     1.848       10    0.151    0.185    0.177    0.240    0.031    37.88   100.00        .
  init                     0.965       10    0.078    0.097    0.091    0.143    0.019    19.78    52.22        .
  parse                    0.034       10    0.003    0.003    0.003    0.006    0.001     0.70     1.84        .
  check                    2.110       10    0.162    0.211    0.202    0.266    0.030    43.25   114.18        .
  - usefulness             0.512       10    0.040    0.051    0.042    0.086    0.017    10.49    27.71        .
  - combine                0.006       10    0.000    0.001    0.001    0.001    0.001     0.12     0.32        .
  - exhaustiveness         1.587       10    0.121    0.159    0.159    0.182    0.019    32.53    85.88        .
  - compress               0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.05        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     1.770       10    0.136    0.177    0.168    0.232    0.029    36.28    95.78        .
  total                    4.879       10    0.440    0.488    0.493    0.530    0.031   100.00   264.02    0.303
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.117        1    1.117    1.117    1.117    1.117        .    37.74    64.79        .
  base                     1.724        1    1.724    1.724    1.724    1.724        .    58.24   100.00        .
  init                     0.931        1    0.931    0.931    0.931    0.931        .    31.45    54.00        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.10     0.17        .
  check                    0.266        1    0.266    0.266    0.266    0.266        .     8.99    15.43        .
  - usefulness             0.060        1    0.060    0.060    0.060    0.060        .     2.03     3.48        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.06        .
  - exhaustiveness         0.204        1    0.204    0.204    0.204    0.204        .     6.89    11.83        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.760        1    1.760    1.760    1.760    1.760        .    59.46   102.09        .
  total                    2.960        1    2.960    2.960    2.960    2.960        .   100.00   171.69    1.236
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              12.583        1   12.583   12.583   12.583   12.583        .    47.80    67.95        .
  base                    18.517        1   18.517   18.517   18.517   18.517        .    70.34   100.00        .
  init                     8.067        1    8.067    8.067    8.067    8.067        .    30.65    43.57        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.02     0.02        .
  check                    0.183        1    0.183    0.183    0.183    0.183        .     0.70     0.99        .
  - usefulness             0.041        1    0.041    0.041    0.041    0.041        .     0.16     0.22        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - exhaustiveness         0.141        1    0.141    0.141    0.141    0.141        .     0.54     0.76        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    18.070        1   18.070   18.070   18.070   18.070        .    68.64    97.59        .
  total                   26.324        1   26.324   26.324   26.324   26.324        .   100.00   142.16    7.807
-------------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.02     8.00        .
  base                     0.025        1    0.025    0.025    0.025    0.025        .     0.21   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01     4.00        .
  parse                    0.227        1    0.227    0.227    0.227    0.227        .     1.89   908.00        .
  check                   11.776        1   11.776   11.776   11.776   11.776        .    97.96 47104.00        .
  - usefulness             4.456        1    4.456    4.456    4.456    4.456        .    37.07 17824.00        .
  - combine                0.255        1    0.255    0.255    0.255    0.255        .     2.12  1020.00        .
  - exhaustiveness         7.057        1    7.057    7.057    7.057    7.057        .    58.71 28228.00        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     4.00        .
  - print                  0.002        1    0.002    0.002    0.002    0.002        .     0.02     8.00        .
  eval                     0.017        1    0.017    0.017    0.017    0.017        .     0.14    68.00        .
  total                   12.021        1   12.021   12.021   12.021   12.021        .   100.00 48084.00   11.996
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.007        1    0.007    0.007    0.007    0.007        .     0.04     4.73        .
  base                     0.148        1    0.148    0.148    0.148    0.148        .     0.80   100.00        .
  init                     0.004        1    0.004    0.004    0.004    0.004        .     0.02     2.70        .
  parse                    0.251        1    0.251    0.251    0.251    0.251        .     1.35   169.59        .
  check                   18.187        1   18.187   18.187   18.187   18.187        .    97.85 12288.51        .
  - usefulness             5.560        1    5.560    5.560    5.560    5.560        .    29.91  3756.76        .
  - combine                0.200        1    0.200    0.200    0.200    0.200        .     1.08   135.14        .
  - exhaustiveness        12.420        1   12.420   12.420   12.420   12.420        .    66.82  8391.89        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.68        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.68        .
  eval                     0.144        1    0.144    0.144    0.144    0.144        .     0.77    97.30        .
  total                   18.587        1   18.587   18.587   18.587   18.587        .   100.00 12558.78   18.439
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.050        1    0.050    0.050    0.050    0.050        .     0.26     3.58        .
  base                     1.395        1    1.395    1.395    1.395    1.395        .     7.14   100.00        .
  init                     0.017        1    0.017    0.017    0.017    0.017        .     0.09     1.22        .
  parse                    0.203        1    0.203    0.203    0.203    0.203        .     1.04    14.55        .
  check                   17.916        1   17.916   17.916   17.916   17.916        .    91.68  1284.30        .
  - usefulness             5.503        1    5.503    5.503    5.503    5.503        .    28.16   394.48        .
  - combine                0.226        1    0.226    0.226    0.226    0.226        .     1.16    16.20        .
  - exhaustiveness        12.180        1   12.180   12.180   12.180   12.180        .    62.33   873.12        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.07        .
  eval                     1.405        1    1.405    1.405    1.405    1.405        .     7.19   100.72        .
  total                   19.542        1   19.542   19.542   19.542   19.542        .   100.00  1400.86   18.147
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.614        1    0.614    0.614    0.614    0.614        .     1.78     4.19        .
  base                    14.671        1   14.671   14.671   14.671   14.671        .    42.54   100.00        .
  init                     0.229        1    0.229    0.229    0.229    0.229        .     0.66     1.56        .
  parse                    0.203        1    0.203    0.203    0.203    0.203        .     0.59     1.38        .
  check                   18.068        1   18.068   18.068   18.068   18.068        .    52.39   123.15        .
  - usefulness             5.442        1    5.442    5.442    5.442    5.442        .    15.78    37.09        .
  - combine                0.180        1    0.180    0.180    0.180    0.180        .     0.52     1.23        .
  - exhaustiveness        12.437        1   12.437   12.437   12.437   12.437        .    36.06    84.77        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - print                  0.003        1    0.003    0.003    0.003    0.003        .     0.01     0.02        .
  eval                    15.988        1   15.988   15.988   15.988   15.988        .    46.36   108.98        .
  total                   34.489        1   34.489   34.489   34.489   34.489        .   100.00   235.08   19.818
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_integer, obs(10000000) levels(1000) rep(1)
. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.01     4.00        .
  base                     0.025        1    0.025    0.025    0.025    0.025        .     0.22   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01     4.00        .
  parse                    0.224        1    0.224    0.224    0.224    0.224        .     1.95   896.00        .
  check                   11.221        1   11.221   11.221   11.221   11.221        .    97.68 44884.00        .
  - usefulness             4.143        1    4.143    4.143    4.143    4.143        .    36.07 16572.00        .
  - combine                0.188        1    0.188    0.188    0.188    0.188        .     1.64   752.00        .
  - exhaustiveness         6.879        1    6.879    6.879    6.879    6.879        .    59.89 27516.00        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     4.00        .
  - print                  0.002        1    0.002    0.002    0.002    0.002        .     0.02     8.00        .
  eval                     0.040        1    0.040    0.040    0.040    0.040        .     0.35   160.00        .
  total                   11.487        1   11.487   11.487   11.487   11.487        .   100.00 45948.00   11.462
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.009        1    0.009    0.009    0.009    0.009        .     0.05     6.16        .
  base                     0.146        1    0.146    0.146    0.146    0.146        .     0.80   100.00        .
  init                     0.006        1    0.006    0.006    0.006    0.006        .     0.03     4.11        .
  parse                    0.274        1    0.274    0.274    0.274    0.274        .     1.51   187.67        .
  check                   17.711        1   17.711   17.711   17.711   17.711        .    97.54 12130.82        .
  - usefulness             5.577        1    5.577    5.577    5.577    5.577        .    30.72  3819.86        .
  - combine                0.183        1    0.183    0.183    0.183    0.183        .     1.01   125.34        .
  - exhaustiveness        11.939        1   11.939   11.939   11.939   11.939        .    65.75  8177.40        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.68        .
  - print                  0.003        1    0.003    0.003    0.003    0.003        .     0.02     2.05        .
  eval                     0.165        1    0.165    0.165    0.165    0.165        .     0.91   113.01        .
  total                   18.157        1   18.157   18.157   18.157   18.157        .   100.00 12436.30   18.011
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.061        1    0.061    0.061    0.061    0.061        .     0.30     4.50        .
  base                     1.356        1    1.356    1.356    1.356    1.356        .     6.77   100.00        .
  init                     0.079        1    0.079    0.079    0.079    0.079        .     0.39     5.83        .
  parse                    0.207        1    0.207    0.207    0.207    0.207        .     1.03    15.27        .
  check                   18.111        1   18.111   18.111   18.111   18.111        .    90.47  1335.62        .
  - usefulness             5.704        1    5.704    5.704    5.704    5.704        .    28.49   420.65        .
  - combine                0.223        1    0.223    0.223    0.223    0.223        .     1.11    16.45        .
  - exhaustiveness        12.177        1   12.177   12.177   12.177   12.177        .    60.83   898.01        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.07        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.07        .
  eval                     1.622        1    1.622    1.622    1.622    1.622        .     8.10   119.62        .
  total                   20.019        1   20.019   20.019   20.019   20.019        .   100.00  1476.33   18.663
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.451        1    0.451    0.451    0.451    0.451        .     1.31     2.87        .
  base                    15.711        1   15.711   15.711   15.711   15.711        .    45.64   100.00        .
  init                     0.639        1    0.639    0.639    0.639    0.639        .     1.86     4.07        .
  parse                    0.224        1    0.224    0.224    0.224    0.224        .     0.65     1.43        .
  check                   17.669        1   17.669   17.669   17.669   17.669        .    51.33   112.46        .
  - usefulness             5.309        1    5.309    5.309    5.309    5.309        .    15.42    33.79        .
  - combine                0.151        1    0.151    0.151    0.151    0.151        .     0.44     0.96        .
  - exhaustiveness        12.199        1   12.199   12.199   12.199   12.199        .    35.44    77.65        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.01        .
  eval                    15.885        1   15.885   15.885   15.885   15.885        .    46.15   101.11        .
  total                   34.420        1   34.420   34.420   34.420   34.420        .   100.00   219.08   18.709
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_float,   obs(10000000) levels(1000) rep(1)
. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.01     5.88        .
  base                     0.017        1    0.017    0.017    0.017    0.017        .     0.16   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.02    11.76        .
  parse                    0.121        1    0.121    0.121    0.121    0.121        .     1.13   711.76        .
  check                   10.603        1   10.603   10.603   10.603   10.603        .    98.72 62370.59        .
  - usefulness             3.532        1    3.532    3.532    3.532    3.532        .    32.88 20776.47        .
  - combine                0.127        1    0.127    0.127    0.127    0.127        .     1.18   747.06        .
  - exhaustiveness         6.938        1    6.938    6.938    6.938    6.938        .    64.59 40811.76        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     5.88        .
  eval                     0.015        1    0.015    0.015    0.015    0.015        .     0.14    88.24        .
  total                   10.741        1   10.741   10.741   10.741   10.741        .   100.00 63182.35   10.724
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.017        1    0.017    0.017    0.017    0.017        .     0.09    10.06        .
  base                     0.169        1    0.169    0.169    0.169    0.169        .     0.86   100.00        .
  init                     0.008        1    0.008    0.008    0.008    0.008        .     0.04     4.73        .
  parse                    0.128        1    0.128    0.128    0.128    0.128        .     0.65    75.74        .
  check                   19.270        1   19.270   19.270   19.270   19.270        .    98.39 11402.37        .
  - usefulness             4.943        1    4.943    4.943    4.943    4.943        .    25.24  2924.85        .
  - combine                0.064        1    0.064    0.064    0.064    0.064        .     0.33    37.87        .
  - exhaustiveness        14.254        1   14.254   14.254   14.254   14.254        .    72.78  8434.32        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.59        .
  - print                  0.002        1    0.002    0.002    0.002    0.002        .     0.01     1.18        .
  eval                     0.179        1    0.179    0.179    0.179    0.179        .     0.91   105.92        .
  total                   19.585        1   19.585   19.585   19.585   19.585        .   100.00 11588.76   19.416
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.098        1    0.098    0.098    0.098    0.098        .     0.46     6.37        .
  base                     1.538        1    1.538    1.538    1.538    1.538        .     7.21   100.00        .
  init                     0.173        1    0.173    0.173    0.173    0.173        .     0.81    11.25        .
  parse                    0.125        1    0.125    0.125    0.125    0.125        .     0.59     8.13        .
  check                   19.626        1   19.626   19.626   19.626   19.626        .    91.96  1276.07        .
  - usefulness             4.729        1    4.729    4.729    4.729    4.729        .    22.16   307.48        .
  - combine                0.064        1    0.064    0.064    0.064    0.064        .     0.30     4.16        .
  - exhaustiveness        14.827        1   14.827   14.827   14.827   14.827        .    69.47   964.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.07        .
  eval                     1.418        1    1.418    1.418    1.418    1.418        .     6.64    92.20        .
  total                   21.342        1   21.342   21.342   21.342   21.342        .   100.00  1387.65   19.804
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.943        1    0.943    0.943    0.943    0.943        .     2.57     6.10        .
  base                    15.468        1   15.468   15.468   15.468   15.468        .    42.23   100.00        .
  init                     0.874        1    0.874    0.874    0.874    0.874        .     2.39     5.65        .
  parse                    0.129        1    0.129    0.129    0.129    0.129        .     0.35     0.83        .
  check                   19.561        1   19.561   19.561   19.561   19.561        .    53.41   126.46        .
  - usefulness             4.788        1    4.788    4.788    4.788    4.788        .    13.07    30.95        .
  - combine                0.091        1    0.091    0.091    0.091    0.091        .     0.25     0.59        .
  - exhaustiveness        14.672        1   14.672   14.672   14.672   14.672        .    40.06    94.85        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - print                  0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.01        .
  eval                    16.061        1   16.061   16.061   16.061   16.061        .    43.85   103.83        .
  total                   36.626        1   36.626   36.626   36.626   36.626        .   100.00   236.79   21.158
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_string,  obs(10000000) levels(1000) rep(1)
. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.704     1000    0.000    0.002    0.002    0.005    0.001    58.20   210.89        .
  base                     0.808     1000    0.000    0.001    0.001    0.003    0.000    27.60   100.00        .
  init                     0.193     1000    0.000    0.000    0.000    0.001    0.000     6.59    23.89        .
  parse                    1.680     1000    0.000    0.002    0.002    0.007    0.001    57.38   207.92        .
  check                    0.014     1000    0.000    0.000    0.000    0.001    0.000     0.48     1.73        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.985     1000    0.000    0.001    0.001    0.003    0.000    33.64   121.91        .
  total                    2.928     1000    0.001    0.003    0.003    0.008    0.001   100.00   362.38    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.590     1000    0.003    0.008    0.008    0.012    0.001    85.28   111.42        .
  base                     6.812     1000    0.003    0.007    0.007    0.017    0.001    76.54   100.00        .
  init                     0.180     1000    0.000    0.000    0.000    0.001    0.000     2.02     2.64        .
  parse                    1.726     1000    0.000    0.002    0.002    0.005    0.001    19.39    25.34        .
  check                    0.009     1000    0.000    0.000    0.000    0.001    0.000     0.10     0.13        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     6.920     1000    0.003    0.007    0.007    0.013    0.001    77.75   101.59        .
  total                    8.900     1000    0.004    0.009    0.009    0.016    0.002   100.00   130.65    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.373      100    0.031    0.054    0.055    0.068    0.010   123.69   119.35        .
  base                     4.502      100    0.030    0.045    0.042    0.079    0.013   103.64   100.00        .
  init                     0.019      100    0.000    0.000    0.000    0.001    0.000     0.44     0.42        .
  parse                    0.104      100    0.000    0.001    0.001    0.002    0.001     2.39     2.31        .
  check                    0.002      100    0.000    0.000    0.000    0.001    0.000     0.05     0.04        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     4.210      100    0.031    0.042    0.033    0.074    0.013    96.92    93.51        .
  total                    4.344      100    0.032    0.043    0.034    0.077    0.014   100.00    96.49   -0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.739       10    0.541    0.574    0.567    0.622    0.027   136.22   134.81        .
  base                     4.257       10    0.345    0.426    0.425    0.492    0.042   101.04   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.02        .
  parse                    0.013       10    0.001    0.001    0.001    0.003    0.001     0.31     0.31        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     4.199       10    0.364    0.420    0.414    0.485    0.036    99.67    98.64        .
  total                    4.213       10    0.365    0.421    0.416    0.486    0.036   100.00    98.97   -0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.444        1    7.444    7.444    7.444    7.444        .   169.37   175.44        .
  base                     4.243        1    4.243    4.243    4.243    4.243        .    96.54   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.02        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     4.394        1    4.394    4.394    4.394    4.394        .    99.98   103.56        .
  total                    4.395        1    4.395    4.395    4.395    4.395        .   100.00   103.58    0.152
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.690     1000    0.000    0.002    0.002    0.006    0.001    57.39   208.64        .
  base                     0.810     1000    0.000    0.001    0.001    0.005    0.000    27.50   100.00        .
  init                     0.197     1000    0.000    0.000    0.000    0.001    0.000     6.69    24.32        .
  parse                    1.679     1000    0.000    0.002    0.002    0.005    0.001    57.01   207.28        .
  check                    0.010     1000    0.000    0.000    0.000    0.001    0.000     0.34     1.23        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.981     1000    0.000    0.001    0.001    0.002    0.000    33.31   121.11        .
  total                    2.945     1000    0.001    0.003    0.003    0.006    0.001   100.00   363.58    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.554     1000    0.004    0.008    0.008    0.011    0.001    83.98   110.88        .
  base                     6.813     1000    0.003    0.007    0.007    0.014    0.001    75.74   100.00        .
  init                     0.231     1000    0.000    0.000    0.000    0.003    0.000     2.57     3.39        .
  parse                    1.662     1000    0.000    0.002    0.002    0.005    0.001    18.48    24.39        .
  check                    0.008     1000    0.000    0.000    0.000    0.001    0.000     0.09     0.12        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     7.034     1000    0.003    0.007    0.007    0.014    0.001    78.20   103.24        .
  total                    8.995     1000    0.004    0.009    0.009    0.017    0.002   100.00   132.03    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.513      100    0.033    0.055    0.057    0.070    0.009   121.27   126.74        .
  base                     4.350      100    0.030    0.043    0.036    0.075    0.013    95.69   100.00        .
  init                     0.012      100    0.000    0.000    0.000    0.001    0.000     0.26     0.28        .
  parse                    0.113      100    0.000    0.001    0.001    0.002    0.001     2.49     2.60        .
  check                    0.002      100    0.000    0.000    0.000    0.001    0.000     0.04     0.05        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     4.413      100    0.032    0.044    0.036    0.080    0.014    97.07   101.45        .
  total                    4.546      100    0.033    0.045    0.037    0.082    0.015   100.00   104.51    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               5.618       10    0.479    0.562    0.556    0.635    0.044   124.60   143.24        .
  base                     3.922       10    0.334    0.392    0.391    0.435    0.033    86.98   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.03        .
  parse                    0.010       10    0.000    0.001    0.001    0.002    0.000     0.22     0.25        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     4.497       10    0.369    0.450    0.445    0.551    0.058    99.73   114.66        .
  total                    4.509       10    0.371    0.451    0.446    0.552    0.058   100.00   114.97    0.059
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.472        1    7.472    7.472    7.472    7.472        .   151.22   172.21        .
  base                     4.339        1    4.339    4.339    4.339    4.339        .    87.82   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.04     0.05        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     4.939        1    4.939    4.939    4.939    4.939        .    99.96   113.83        .
  total                    4.941        1    4.941    4.941    4.941    4.941        .   100.00   113.87    0.602
-------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.220     1000    0.001    0.002    0.002    0.008    0.001    92.19   338.41        .
  base                     0.656     1000    0.000    0.001    0.001    0.004    0.001    27.24   100.00        .
  init                     0.199     1000    0.000    0.000    0.000    0.001    0.000     8.26    30.34        .
  parse                    1.325     1000    0.000    0.001    0.001    0.004    0.001    55.02   201.98        .
  check                    0.009     1000    0.000    0.000    0.000    0.001    0.000     0.37     1.37        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.802     1000    0.000    0.001    0.001    0.004    0.000    33.31   122.26        .
  total                    2.408     1000    0.001    0.002    0.002    0.006    0.001   100.00   367.07    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              13.659     1000    0.006    0.014    0.014    0.023    0.001   178.22   232.93        .
  base                     5.864     1000    0.002    0.006    0.006    0.011    0.001    76.51   100.00        .
  init                     0.205     1000    0.000    0.000    0.000    0.001    0.000     2.67     3.50        .
  parse                    1.397     1000    0.000    0.001    0.001    0.005    0.001    18.23    23.82        .
  check                    0.014     1000    0.000    0.000    0.000    0.001    0.000     0.18     0.24        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     5.972     1000    0.002    0.006    0.006    0.013    0.001    77.92   101.84        .
  total                    7.664     1000    0.003    0.008    0.008    0.015    0.001   100.00   130.70    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               9.954      100    0.058    0.100    0.101    0.132    0.015   276.35   265.02        .
  base                     3.756      100    0.025    0.038    0.033    0.065    0.010   104.28   100.00        .
  init                     0.015      100    0.000    0.000    0.000    0.001    0.000     0.42     0.40        .
  parse                    0.090      100    0.000    0.001    0.001    0.002    0.001     2.50     2.40        .
  check                    0.001      100    0.000    0.000    0.000    0.001    0.000     0.03     0.03        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     3.494      100    0.025    0.035    0.028    0.062    0.011    97.00    93.02        .
  total                    3.602      100    0.026    0.036    0.029    0.064    0.011   100.00    95.90   -0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               9.132       10    0.801    0.913    0.902    1.032    0.064   247.95   279.95        .
  base                     3.262       10    0.273    0.326    0.316    0.431    0.044    88.57   100.00        .
  init                     0.002       10    0.000    0.000    0.000    0.001    0.000     0.05     0.06        .
  parse                    0.009       10    0.000    0.001    0.001    0.002    0.001     0.24     0.28        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     3.671       10    0.319    0.367    0.350    0.464    0.042    99.67   112.54        .
  total                    3.683       10    0.320    0.368    0.351    0.465    0.042   100.00   112.91    0.042
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              11.349        1   11.349   11.349   11.349   11.349        .   329.24   342.77        .
  base                     3.311        1    3.311    3.311    3.311    3.311        .    96.05   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     3.446        1    3.446    3.446    3.446    3.446        .    99.97   104.08        .
  total                    3.447        1    3.447    3.447    3.447    3.447        .   100.00   104.11    0.136
-------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  26 Sep 2024, 14:28:19
------------------------------------------------------------------------------------------------------------------------------------------------------------
