------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  19 Sep 2024, 14:18:03

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. profile_obs_integer, obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.265     1000    0.000    0.000    0.000    0.001    0.000     4.48   100.00        .
        init          0.349     1000    0.000    0.000    0.000    0.002    0.000     5.90   131.70        .
       parse          0.815     1000    0.000    0.001    0.001    0.005    0.001    13.77   307.55        .
       check          4.419     1000    0.002    0.004    0.004    0.019    0.002    74.68  1667.55        .
        eval          0.290     1000    0.000    0.000    0.000    0.004    0.000     4.90   109.43        .
       total          5.917     1000    0.003    0.006    0.005    0.022    0.002   100.00  2232.83    0.006
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.187     1000    0.001    0.003    0.004    0.009    0.001    29.09   100.00        .
        init          2.594     1000    0.001    0.003    0.002    0.007    0.001    23.68    81.39        .
       parse          1.006     1000    0.000    0.001    0.001    0.005    0.001     9.18    31.57        .
       check          4.969     1000    0.002    0.005    0.005    0.012    0.001    45.35   155.91        .
        eval          2.353     1000    0.001    0.002    0.002    0.008    0.001    21.48    73.83        .
       total         10.956     1000    0.006    0.011    0.011    0.022    0.003   100.00   343.77    0.008
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.790      100    0.015    0.018    0.017    0.031    0.003    47.77   100.00        .
        init          1.494      100    0.013    0.015    0.014    0.027    0.003    39.87    83.46        .
       parse          0.061      100    0.000    0.001    0.001    0.002    0.001     1.63     3.41        .
       check          0.340      100    0.002    0.003    0.003    0.009    0.001     9.07    18.99        .
        eval          1.848      100    0.015    0.018    0.016    0.039    0.005    49.32   103.24        .
       total          3.747      100    0.032    0.037    0.034    0.057    0.007   100.00   209.33    0.020
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.576       10    0.135    0.158    0.146    0.187    0.017    53.95   100.00        .
        init          1.356       10    0.120    0.136    0.131    0.160    0.014    46.42    86.04        .
       parse          0.008       10    0.000    0.001    0.001    0.001    0.000     0.27     0.51        .
       check          0.028       10    0.002    0.003    0.003    0.003    0.000     0.96     1.78        .
        eval          1.528       10    0.140    0.153    0.151    0.175    0.010    52.31    96.95        .
       total          2.921       10    0.273    0.292    0.289    0.322    0.017   100.00   185.34    0.134
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.499        1    1.499    1.499    1.499    1.499        .    50.76   100.00        .
        init          1.327        1    1.327    1.327    1.327    1.327        .    44.94    88.53        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.07        .
       check          0.004        1    0.004    0.004    0.004    0.004        .     0.14     0.27        .
        eval          1.621        1    1.621    1.621    1.621    1.621        .    54.89   108.14        .
       total          2.953        1    2.953    2.953    2.953    2.953        .   100.00   197.00    1.454
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.339     1000    0.000    0.000    0.000    0.005    0.000    11.30   100.00        .
        init          0.532     1000    0.000    0.001    0.001    0.004    0.001    17.73   156.93        .
       parse          0.827     1000    0.000    0.001    0.001    0.004    0.001    27.57   243.95        .
       check          1.199     1000    0.000    0.001    0.001    0.003    0.001    39.97   353.69        .
        eval          0.393     1000    0.000    0.000    0.000    0.001    0.000    13.10   115.93        .
       total          3.000     1000    0.001    0.003    0.003    0.008    0.001   100.00   884.96    0.003
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.476     1000    0.001    0.003    0.004    0.009    0.001    31.35   100.00        .
        init          5.454     1000    0.002    0.005    0.006    0.011    0.002    49.18   156.90        .
       parse          0.901     1000    0.000    0.001    0.001    0.002    0.000     8.13    25.92        .
       check          1.266     1000    0.000    0.001    0.001    0.004    0.001    11.42    36.42        .
        eval          3.426     1000    0.001    0.003    0.003    0.009    0.001    30.90    98.56        .
       total         11.089     1000    0.005    0.011    0.011    0.021    0.003   100.00   319.02    0.008
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.364      100    0.029    0.034    0.032    0.048    0.004    32.34   100.00        .
        init          6.684      100    0.054    0.067    0.067    0.097    0.009    64.26   198.69        .
       parse          0.091      100    0.000    0.001    0.001    0.003    0.001     0.87     2.71        .
       check          0.119      100    0.000    0.001    0.001    0.005    0.001     1.14     3.54        .
        eval          3.507      100    0.029    0.035    0.033    0.047    0.005    33.72   104.25        .
       total         10.401      100    0.088    0.104    0.102    0.140    0.011   100.00   309.19    0.070
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.628       10    0.143    0.163    0.160    0.182    0.012    13.22   100.00        .
        init         10.518       10    0.947    1.052    1.040    1.208    0.069    85.44   646.07        .
       parse          0.009       10    0.000    0.001    0.001    0.002    0.001     0.07     0.55        .
       check          0.005       10    0.000    0.001    0.000    0.001    0.001     0.04     0.31        .
        eval          1.779       10    0.154    0.178    0.174    0.214    0.019    14.45   109.28        .
       total         12.311       10    1.131    1.231    1.222    1.374    0.070   100.00   756.20    1.068
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.547        1    1.547    1.547    1.547    1.547        .     7.26   100.00        .
        init         19.675        1   19.675   19.675   19.675   19.675        .    92.28  1271.82        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.06        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.646        1    1.646    1.646    1.646    1.646        .     7.72   106.40        .
       total         21.322        1   21.322   21.322   21.322   21.322        .   100.00  1378.28   19.775
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.277     1000    0.000    0.000    0.000    0.003    0.000     6.00   100.00        .
        init          0.847     1000    0.000    0.001    0.001    0.005    0.001    18.36   305.78        .
       parse          0.699     1000    0.000    0.001    0.001    0.002    0.001    15.15   252.35        .
       check          2.735     1000    0.001    0.003    0.002    0.011    0.001    59.28   987.36        .
        eval          0.282     1000    0.000    0.000    0.000    0.001    0.000     6.11   101.81        .
       total          4.614     1000    0.002    0.005    0.004    0.013    0.002   100.00  1665.70    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.331     1000    0.001    0.002    0.002    0.006    0.001    20.81   100.00        .
        init          6.856     1000    0.004    0.007    0.006    0.014    0.002    61.21   294.12        .
       parse          0.578     1000    0.000    0.001    0.001    0.003    0.001     5.16    24.80        .
       check          2.000     1000    0.001    0.002    0.002    0.006    0.001    17.86    85.80        .
        eval          1.732     1000    0.001    0.002    0.002    0.006    0.001    15.46    74.30        .
       total         11.201     1000    0.008    0.011    0.011    0.025    0.003   100.00   480.52    0.009
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.101      100    0.018    0.021    0.019    0.040    0.004    18.05   100.00        .
        init          9.210      100    0.077    0.092    0.092    0.127    0.011    79.11   438.36        .
       parse          0.056      100    0.000    0.001    0.001    0.002    0.001     0.48     2.67        .
       check          0.191      100    0.001    0.002    0.002    0.005    0.001     1.64     9.09        .
        eval          2.184      100    0.019    0.022    0.020    0.041    0.005    18.76   103.95        .
       total         11.642      100    0.099    0.116    0.115    0.172    0.013   100.00   554.12    0.095
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.414       10    0.126    0.141    0.138    0.163    0.013     9.61   100.00        .
        init         13.215       10    1.276    1.321    1.330    1.347    0.024    89.77   934.58        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.04     0.42        .
       check          0.017       10    0.001    0.002    0.002    0.002    0.000     0.12     1.20        .
        eval          1.483       10    0.136    0.148    0.143    0.166    0.010    10.07   104.88        .
       total         14.721       10    1.428    1.472    1.475    1.510    0.030   100.00  1041.09    1.331
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.513        1    1.513    1.513    1.513    1.513        .     6.20   100.00        .
        init         22.981        1   22.981   22.981   22.981   22.981        .    94.14  1518.90        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.13        .
        eval          1.429        1    1.429    1.429    1.429    1.429        .     5.85    94.45        .
       total         24.412        1   24.412   24.412   24.412   24.412        .   100.00  1613.48   22.899
--------------------------------------------------------------------------------------------------------------

. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.261     1000    0.000    0.000    0.000    0.002    0.000    21.45   100.00        .
        init          0.115     1000    0.000    0.000    0.000    0.003    0.000     9.45    44.06        .
       parse          0.720     1000    0.000    0.001    0.001    0.002    0.001    59.16   275.86        .
       check          0.005     1000    0.000    0.000    0.000    0.001    0.000     0.41     1.92        .
        eval          0.338     1000    0.000    0.000    0.000    0.002    0.000    27.77   129.50        .
       total          1.217     1000    0.000    0.001    0.001    0.004    0.001   100.00   466.28    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.200     1000    0.001    0.003    0.003    0.009    0.001    70.61   100.00        .
        init          0.162     1000    0.000    0.000    0.000    0.001    0.000     3.57     5.06        .
       parse          0.976     1000    0.000    0.001    0.001    0.002    0.000    21.54    30.50        .
       check          0.009     1000    0.000    0.000    0.000    0.001    0.000     0.20     0.28        .
        eval          3.330     1000    0.001    0.003    0.004    0.008    0.001    73.48   104.06        .
       total          4.532     1000    0.002    0.005    0.005    0.009    0.001   100.00   141.63    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.612      100    0.013    0.016    0.015    0.030    0.003    99.88   100.00        .
        init          0.007      100    0.000    0.000    0.000    0.001    0.000     0.43     0.43        .
       parse          0.051      100    0.000    0.001    0.001    0.001    0.001     3.16     3.16        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.553      100    0.013    0.016    0.014    0.026    0.003    96.22    96.34        .
       total          1.614      100    0.014    0.016    0.015    0.027    0.003   100.00   100.12    0.000
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.504       10    0.133    0.150    0.147    0.168    0.012    94.29   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.06     0.07        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.31     0.33        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.589       10    0.140    0.159    0.155    0.182    0.013    99.62   105.65        .
       total          1.595       10    0.141    0.160    0.156    0.182    0.012   100.00   106.05    0.009
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.509        1    1.509    1.509    1.509    1.509        .    91.12   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.07        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.655        1    1.655    1.655    1.655    1.655        .    99.94   109.68        .
       total          1.656        1    1.656    1.656    1.656    1.656        .   100.00   109.74    0.147
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.340     1000    0.000    0.000    0.000    0.001    0.000    24.22   100.00        .
        init          0.135     1000    0.000    0.000    0.000    0.002    0.000     9.62    39.71        .
       parse          0.774     1000    0.000    0.001    0.001    0.003    0.001    55.13   227.65        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.28     1.18        .
        eval          0.440     1000    0.000    0.000    0.000    0.004    0.001    31.34   129.41        .
       total          1.404     1000    0.000    0.001    0.001    0.006    0.001   100.00   412.94    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.672     1000    0.001    0.004    0.004    0.009    0.001    72.96   100.00        .
        init          0.176     1000    0.000    0.000    0.000    0.001    0.000     3.50     4.79        .
       parse          0.955     1000    0.000    0.001    0.001    0.005    0.001    18.97    26.01        .
       check          0.009     1000    0.000    0.000    0.000    0.001    0.000     0.18     0.25        .
        eval          3.845     1000    0.001    0.004    0.004    0.011    0.001    76.40   104.71        .
       total          5.033     1000    0.002    0.005    0.005    0.012    0.002   100.00   137.06    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.296      100    0.029    0.033    0.031    0.046    0.004    92.12   100.00        .
        init          0.018      100    0.000    0.000    0.000    0.004    0.001     0.50     0.55        .
       parse          0.066      100    0.000    0.001    0.001    0.002    0.001     1.84     2.00        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          3.494      100    0.030    0.035    0.031    0.054    0.006    97.65   106.01        .
       total          3.578      100    0.030    0.036    0.032    0.055    0.007   100.00   108.56    0.003
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.691       10    0.153    0.169    0.165    0.189    0.013    99.30   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.06     0.06        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.35     0.35        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.695       10    0.148    0.170    0.170    0.180    0.010    99.53   100.24        .
       total          1.703       10    0.149    0.170    0.170    0.180    0.010   100.00   100.71    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.592        1    1.592    1.592    1.592    1.592        .   102.05   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.06        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.559        1    1.559    1.559    1.559    1.559        .    99.94    97.93        .
       total          1.560        1    1.560    1.560    1.560    1.560        .   100.00    97.99   -0.032
--------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.275     1000    0.000    0.000    0.000    0.001    0.000    24.60   100.00        .
        init          0.132     1000    0.000    0.000    0.000    0.003    0.000    11.81    48.00        .
       parse          0.599     1000    0.000    0.001    0.001    0.002    0.001    53.58   217.82        .
       check          0.010     1000    0.000    0.000    0.000    0.001    0.000     0.89     3.64        .
        eval          0.338     1000    0.000    0.000    0.000    0.001    0.000    30.23   122.91        .
       total          1.118     1000    0.000    0.001    0.001    0.005    0.001   100.00   406.55    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.808     1000    0.001    0.003    0.003    0.008    0.001    78.90   100.00        .
        init          0.159     1000    0.000    0.000    0.000    0.003    0.000     4.47     5.66        .
       parse          0.801     1000    0.000    0.001    0.001    0.004    0.000    22.51    28.53        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.17     0.21        .
        eval          2.543     1000    0.001    0.003    0.003    0.006    0.001    71.45    90.56        .
       total          3.559     1000    0.001    0.004    0.004    0.007    0.001   100.00   126.75    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.427      100    0.012    0.014    0.013    0.028    0.004    97.74   100.00        .
        init          0.006      100    0.000    0.000    0.000    0.001    0.000     0.41     0.42        .
       parse          0.047      100    0.000    0.000    0.000    0.001    0.001     3.22     3.29        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.403      100    0.012    0.014    0.013    0.031    0.003    96.10    98.32        .
       total          1.460      100    0.013    0.015    0.014    0.031    0.003   100.00   102.31    0.000
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.350       10    0.125    0.135    0.129    0.160    0.011    93.88   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.07     0.07        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.42     0.44        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.431       10    0.127    0.143    0.144    0.159    0.012    99.51   106.00        .
       total          1.438       10    0.128    0.144    0.144    0.159    0.012   100.00   106.52    0.009
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.420        1    1.420    1.420    1.420    1.420        .    98.54   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.07        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          1.440        1    1.440    1.440    1.440    1.440        .    99.93   101.41        .
       total          1.441        1    1.441    1.441    1.441    1.441        .   100.00   101.48    0.021
--------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  19 Sep 2024, 14:22:49
------------------------------------------------------------------------------------------------------------------------------------------------
