----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  28 Oct 2024, 15:04:07

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.781     1000    0.000    0.001    0.001    0.008    0.000    26.12   263.85        .
  base                     0.296     1000    0.000    0.000    0.000    0.003    0.000     9.90   100.00        .
  init                     0.514     1000    0.000    0.001    0.001    0.003    0.001    17.19   173.65        .
  parse                    0.532     1000    0.000    0.001    0.001    0.002    0.001    17.79   179.73        .
  check                    1.557     1000    0.001    0.002    0.002    0.003    0.001    52.07   526.01        .
  - usefulness             0.764     1000    0.000    0.001    0.001    0.002    0.000    25.55   258.11        .
    - is_useful() 1        0.675     1000    0.000    0.001    0.001    0.002    0.000    22.58   228.04        .
  - combine                0.050     1000    0.000    0.000    0.000    0.001    0.000     1.67    16.89        .
  - exhaustiveness         0.686     1000    0.000    0.001    0.001    0.002    0.000    22.94   231.76        .
    - is_useful() 2        0.648     1000    0.000    0.001    0.001    0.002    0.000    21.67   218.92        .
  - compress               0.008     1000    0.000    0.000    0.000    0.001    0.000     0.27     2.70        .
  - print                  0.012     1000    0.000    0.000    0.000    0.001    0.000     0.40     4.05        .
  + Overlap()              0.619     1000    0.000    0.001    0.000    0.003    0.001    20.70   209.12        .
  + Difference()           0.386     1000    0.000    0.000    0.000    0.002    0.001    12.91   130.41        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.360     1000    0.000    0.000    0.000    0.001    0.000    12.04   121.62        .
  total                    2.990     1000    0.002    0.003    0.003    0.007    0.000   100.00  1010.14    0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.084     1000    0.001    0.002    0.002    0.004    0.000    35.30    76.99        .
  base                     2.707     1000    0.002    0.003    0.003    0.004    0.000    45.85   100.00        .
  init                     0.855     1000    0.000    0.001    0.001    0.002    0.000    14.48    31.58        .
  parse                    0.590     1000    0.000    0.001    0.001    0.002    0.000     9.99    21.80        .
  check                    1.550     1000    0.001    0.002    0.002    0.005    0.001    26.25    57.26        .
  - usefulness             0.761     1000    0.000    0.001    0.001    0.004    0.000    12.89    28.11        .
    - is_useful() 1        0.683     1000    0.000    0.001    0.001    0.002    0.000    11.57    25.23        .
  - combine                0.042     1000    0.000    0.000    0.000    0.001    0.000     0.71     1.55        .
  - exhaustiveness         0.684     1000    0.000    0.001    0.001    0.001    0.000    11.59    25.27        .
    - is_useful() 2        0.644     1000    0.000    0.001    0.001    0.001    0.000    10.91    23.79        .
  - compress               0.002     1000    0.000    0.000    0.000    0.001    0.000     0.03     0.07        .
  - print                  0.020     1000    0.000    0.000    0.000    0.001    0.000     0.34     0.74        .
  + Overlap()              0.637     1000    0.000    0.001    0.001    0.002    0.001    10.79    23.53        .
  + Difference()           0.389     1000    0.000    0.000    0.000    0.002    0.001     6.59    14.37        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.884     1000    0.002    0.003    0.003    0.005    0.000    48.85   106.54        .
  total                    5.904     1000    0.005    0.006    0.006    0.010    0.000   100.00   218.10    0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.357      100    0.012    0.014    0.013    0.016    0.001    36.01    44.77        .
  base                     3.031      100    0.029    0.030    0.030    0.033    0.001    80.44   100.00        .
  init                     0.530      100    0.005    0.005    0.005    0.006    0.000    14.07    17.49        .
  parse                    0.063      100    0.000    0.001    0.001    0.001    0.000     1.67     2.08        .
  check                    0.153      100    0.001    0.002    0.002    0.002    0.001     4.06     5.05        .
  - usefulness             0.074      100    0.000    0.001    0.001    0.001    0.000     1.96     2.44        .
    - is_useful() 1        0.067      100    0.000    0.001    0.001    0.001    0.000     1.78     2.21        .
  - combine                0.006      100    0.000    0.000    0.000    0.001    0.000     0.16     0.20        .
  - exhaustiveness         0.067      100    0.000    0.001    0.001    0.001    0.000     1.78     2.21        .
    - is_useful() 2        0.062      100    0.000    0.001    0.001    0.001    0.000     1.65     2.05        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.002      100    0.000    0.000    0.000    0.001    0.000     0.05     0.07        .
  + Overlap()              0.058      100    0.000    0.001    0.000    0.002    0.001     1.54     1.91        .
  + Difference()           0.039      100    0.000    0.000    0.000    0.002    0.001     1.04     1.29        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.018      100    0.029    0.030    0.030    0.037    0.001    80.10    99.57        .
  total                    3.768      100    0.036    0.038    0.038    0.044    0.001   100.00   124.32    0.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.890       10    0.180    0.189    0.187    0.202    0.007    64.11    74.67        .
  base                     2.531       10    0.250    0.253    0.252    0.260    0.003    85.85   100.00        .
  init                     0.442       10    0.043    0.044    0.044    0.047    0.001    14.99    17.46        .
  parse                    0.006       10    0.000    0.001    0.001    0.001    0.001     0.20     0.24        .
  check                    0.018       10    0.001    0.002    0.002    0.002    0.000     0.61     0.71        .
  - usefulness             0.010       10    0.001    0.001    0.001    0.001    0.000     0.34     0.40        .
    - is_useful() 1        0.009       10    0.000    0.001    0.001    0.001    0.000     0.31     0.36        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.007       10    0.000    0.001    0.001    0.001    0.000     0.24     0.28        .
    - is_useful() 2        0.006       10    0.000    0.001    0.001    0.001    0.001     0.20     0.24        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.04        .
  + Overlap()              0.007       10    0.000    0.001    0.000    0.002    0.001     0.24     0.28        .
  + Difference()           0.003       10    0.000    0.000    0.000    0.001    0.000     0.10     0.12        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.481       10    0.245    0.248    0.248    0.252    0.002    84.16    98.02        .
  total                    2.948       10    0.292    0.295    0.294    0.300    0.003   100.00   116.48    0.042
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.070        1    3.070    3.070    3.070    3.070        .   104.39   122.36        .
  base                     2.509        1    2.509    2.509    2.509    2.509        .    85.31   100.00        .
  init                     0.431        1    0.431    0.431    0.431    0.431        .    14.65    17.18        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.002        1    0.002    0.002    0.002    0.002        .     0.07     0.08        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
    - is_useful() 1        0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
    - is_useful() 2        0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.508        1    2.508    2.508    2.508    2.508        .    85.28    99.96        .
  total                    2.941        1    2.941    2.941    2.941    2.941        .   100.00   117.22    0.432
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.758     1000    0.000    0.001    0.001    0.003    0.000    23.32   260.48        .
  base                     0.291     1000    0.000    0.000    0.000    0.001    0.000     8.95   100.00        .
  init                     0.771     1000    0.000    0.001    0.001    0.002    0.000    23.72   264.95        .
  parse                    0.538     1000    0.000    0.001    0.001    0.002    0.001    16.55   184.88        .
  check                    1.558     1000    0.001    0.002    0.002    0.004    0.001    47.92   535.40        .
  - usefulness             0.758     1000    0.000    0.001    0.001    0.003    0.000    23.32   260.48        .
    - is_useful() 1        0.655     1000    0.000    0.001    0.001    0.003    0.000    20.15   225.09        .
  - combine                0.056     1000    0.000    0.000    0.000    0.001    0.000     1.72    19.24        .
  - exhaustiveness         0.678     1000    0.000    0.001    0.001    0.001    0.000    20.86   232.99        .
    - is_useful() 2        0.650     1000    0.000    0.001    0.001    0.001    0.000    19.99   223.37        .
  - compress               0.004     1000    0.000    0.000    0.000    0.001    0.000     0.12     1.37        .
  - print                  0.022     1000    0.000    0.000    0.000    0.001    0.000     0.68     7.56        .
  + Overlap()              0.657     1000    0.000    0.001    0.001    0.002    0.001    20.21   225.77        .
  + Difference()           0.349     1000    0.000    0.000    0.000    0.002    0.000    10.74   119.93        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.363     1000    0.000    0.000    0.000    0.001    0.000    11.17   124.74        .
  total                    3.251     1000    0.003    0.003    0.003    0.007    0.000   100.00  1117.18    0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.096     1000    0.001    0.002    0.002    0.006    0.000    24.16    74.86        .
  base                     2.800     1000    0.002    0.003    0.003    0.006    0.000    32.28   100.00        .
  init                     3.507     1000    0.003    0.004    0.004    0.005    0.001    40.43   125.25        .
  parse                    0.588     1000    0.000    0.001    0.001    0.002    0.001     6.78    21.00        .
  check                    1.564     1000    0.001    0.002    0.002    0.004    0.001    18.03    55.86        .
  - usefulness             0.743     1000    0.000    0.001    0.001    0.002    0.000     8.57    26.54        .
    - is_useful() 1        0.629     1000    0.000    0.001    0.001    0.002    0.000     7.25    22.46        .
  - combine                0.044     1000    0.000    0.000    0.000    0.001    0.000     0.51     1.57        .
  - exhaustiveness         0.708     1000    0.000    0.001    0.001    0.002    0.000     8.16    25.29        .
    - is_useful() 2        0.674     1000    0.000    0.001    0.001    0.002    0.000     7.77    24.07        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.06     0.18        .
  - print                  0.017     1000    0.000    0.000    0.000    0.001    0.000     0.20     0.61        .
  + Overlap()              0.631     1000    0.000    0.001    0.001    0.002    0.001     7.27    22.54        .
  + Difference()           0.376     1000    0.000    0.000    0.000    0.002    0.000     4.33    13.43        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.984     1000    0.002    0.003    0.003    0.006    0.000    34.40   106.57        .
  total                    8.674     1000    0.008    0.009    0.009    0.012    0.001   100.00   309.79    0.006
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.587      100    0.015    0.016    0.016    0.018    0.001    12.55    25.90        .
  base                     6.127      100    0.060    0.061    0.061    0.065    0.001    48.47   100.00        .
  init                     6.277      100    0.059    0.063    0.062    0.071    0.002    49.66   102.45        .
  parse                    0.054      100    0.000    0.001    0.001    0.001    0.001     0.43     0.88        .
  check                    0.156      100    0.001    0.002    0.002    0.002    0.000     1.23     2.55        .
  - usefulness             0.069      100    0.000    0.001    0.001    0.001    0.000     0.55     1.13        .
    - is_useful() 1        0.062      100    0.000    0.001    0.001    0.001    0.000     0.49     1.01        .
  - combine                0.005      100    0.000    0.000    0.000    0.001    0.000     0.04     0.08        .
  - exhaustiveness         0.079      100    0.000    0.001    0.001    0.001    0.000     0.62     1.29        .
    - is_useful() 2        0.074      100    0.000    0.001    0.001    0.001    0.000     0.59     1.21        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.02        .
  - print                  0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.076      100    0.000    0.001    0.001    0.002    0.001     0.60     1.24        .
  + Difference()           0.039      100    0.000    0.000    0.000    0.002    0.001     0.31     0.64        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     6.149      100    0.060    0.061    0.061    0.065    0.001    48.64   100.36        .
  total                   12.641      100    0.123    0.126    0.126    0.136    0.002   100.00   206.32    0.065
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.960       10    0.184    0.196    0.193    0.207    0.008    31.52    74.36        .
  base                     2.636       10    0.262    0.264    0.264    0.267    0.002    42.39   100.00        .
  init                     3.637       10    0.358    0.364    0.363    0.370    0.004    58.49   137.97        .
  parse                    0.007       10    0.000    0.001    0.001    0.001    0.000     0.11     0.27        .
  check                    0.016       10    0.001    0.002    0.002    0.002    0.001     0.26     0.61        .
  - usefulness             0.009       10    0.000    0.001    0.001    0.001    0.000     0.14     0.34        .
    - is_useful() 1        0.007       10    0.000    0.001    0.001    0.001    0.000     0.11     0.27        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.007       10    0.000    0.001    0.001    0.001    0.000     0.11     0.27        .
    - is_useful() 2        0.007       10    0.000    0.001    0.001    0.001    0.000     0.11     0.27        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.006       10    0.000    0.001    0.000    0.002    0.001     0.10     0.23        .
  + Difference()           0.004       10    0.000    0.000    0.000    0.001    0.001     0.06     0.15        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.558       10    0.253    0.256    0.254    0.262    0.003    41.14    97.04        .
  total                    6.218       10    0.617    0.622    0.621    0.626    0.003   100.00   235.89    0.358
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.065        1    3.065    3.065    3.065    3.065        .    50.33   118.98        .
  base                     2.576        1    2.576    2.576    2.576    2.576        .    42.30   100.00        .
  init                     3.564        1    3.564    3.564    3.564    3.564        .    58.52   138.35        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.08        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
    - is_useful() 1        0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
    - is_useful() 2        0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.524        1    2.524    2.524    2.524    2.524        .    41.44    97.98        .
  total                    6.090        1    6.090    6.090    6.090    6.090        .   100.00   236.41    3.514
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.173     1000    0.001    0.001    0.001    0.003    0.000    58.94   604.64        .
  base                     0.194     1000    0.000    0.000    0.000    0.001    0.000     9.75   100.00        .
  init                     0.487     1000    0.000    0.000    0.000    0.003    0.001    24.47   251.03        .
  parse                    0.356     1000    0.000    0.000    0.000    0.002    0.000    17.89   183.51        .
  check                    0.903     1000    0.000    0.001    0.001    0.002    0.000    45.38   465.46        .
  - usefulness             0.310     1000    0.000    0.000    0.000    0.001    0.000    15.58   159.79        .
    - is_useful() 1        0.263     1000    0.000    0.000    0.000    0.001    0.000    13.22   135.57        .
  - combine                0.011     1000    0.000    0.000    0.000    0.001    0.000     0.55     5.67        .
  - exhaustiveness         0.519     1000    0.000    0.001    0.001    0.002    0.001    26.08   267.53        .
    - is_useful() 2        0.502     1000    0.000    0.001    0.001    0.002    0.001    25.23   258.76        .
  - compress               0.003     1000    0.000    0.000    0.000    0.001    0.000     0.15     1.55        .
  - print                  0.018     1000    0.000    0.000    0.000    0.001    0.000     0.90     9.28        .
  + Overlap()              0.303     1000    0.000    0.000    0.000    0.001    0.000    15.23   156.19        .
  + Difference()           0.310     1000    0.000    0.000    0.000    0.001    0.000    15.58   159.79        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.219     1000    0.000    0.000    0.000    0.001    0.000    11.01   112.89        .
  total                    1.990     1000    0.001    0.002    0.002    0.005    0.000   100.00  1025.77    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.776     1000    0.006    0.007    0.007    0.010    0.000    91.11   440.00        .
  base                     1.540     1000    0.001    0.002    0.002    0.006    0.001    20.71   100.00        .
  init                     4.563     1000    0.004    0.005    0.005    0.007    0.001    61.36   296.30        .
  parse                    0.390     1000    0.000    0.000    0.000    0.001    0.000     5.24    25.32        .
  check                    0.923     1000    0.000    0.001    0.001    0.002    0.000    12.41    59.94        .
  - usefulness             0.283     1000    0.000    0.000    0.000    0.001    0.000     3.81    18.38        .
    - is_useful() 1        0.235     1000    0.000    0.000    0.000    0.001    0.000     3.16    15.26        .
  - combine                0.013     1000    0.000    0.000    0.000    0.001    0.000     0.17     0.84        .
  - exhaustiveness         0.560     1000    0.000    0.001    0.001    0.001    0.000     7.53    36.36        .
    - is_useful() 2        0.519     1000    0.000    0.001    0.001    0.001    0.000     6.98    33.70        .
  - compress               0.002     1000    0.000    0.000    0.000    0.001    0.000     0.03     0.13        .
  - print                  0.017     1000    0.000    0.000    0.000    0.001    0.000     0.23     1.10        .
  + Overlap()              0.315     1000    0.000    0.000    0.000    0.001    0.000     4.24    20.45        .
  + Difference()           0.314     1000    0.000    0.000    0.000    0.002    0.000     4.22    20.39        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.526     1000    0.001    0.002    0.002    0.003    0.001    20.52    99.09        .
  total                    7.437     1000    0.007    0.007    0.007    0.011    0.001   100.00   482.92    0.006
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.153      100    0.059    0.062    0.061    0.100    0.005    85.15   411.57        .
  base                     1.495      100    0.014    0.015    0.015    0.022    0.001    20.69   100.00        .
  init                     5.571      100    0.054    0.056    0.055    0.072    0.003    77.10   372.64        .
  parse                    0.041      100    0.000    0.000    0.000    0.002    0.001     0.57     2.74        .
  check                    0.092      100    0.000    0.001    0.001    0.001    0.000     1.27     6.15        .
  - usefulness             0.027      100    0.000    0.000    0.000    0.001    0.000     0.37     1.81        .
    - is_useful() 1        0.023      100    0.000    0.000    0.000    0.001    0.000     0.32     1.54        .
  - combine                0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.07        .
  - exhaustiveness         0.063      100    0.000    0.001    0.001    0.001    0.000     0.87     4.21        .
    - is_useful() 2        0.057      100    0.000    0.001    0.001    0.001    0.000     0.79     3.81        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.030      100    0.000    0.000    0.000    0.001    0.000     0.42     2.01        .
  + Difference()           0.035      100    0.000    0.000    0.000    0.001    0.000     0.48     2.34        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.518      100    0.014    0.015    0.015    0.018    0.001    21.01   101.54        .
  total                    7.226      100    0.070    0.072    0.072    0.090    0.003   100.00   483.34    0.057
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.805       10    0.670    0.681    0.681    0.689    0.006   110.04   461.67        .
  base                     1.474       10    0.145    0.147    0.147    0.151    0.002    23.84   100.00        .
  init                     4.676       10    0.461    0.468    0.464    0.477    0.006    75.61   317.23        .
  parse                    0.005       10    0.000    0.001    0.000    0.001    0.001     0.08     0.34        .
  check                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.13     0.54        .
  - usefulness             0.004       10    0.000    0.000    0.000    0.001    0.001     0.06     0.27        .
    - is_useful() 1        0.003       10    0.000    0.000    0.000    0.001    0.000     0.05     0.20        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.004       10    0.000    0.000    0.000    0.001    0.001     0.06     0.27        .
    - is_useful() 2        0.004       10    0.000    0.000    0.000    0.001    0.001     0.06     0.27        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.004       10    0.000    0.000    0.000    0.001    0.001     0.06     0.27        .
  + Difference()           0.002       10    0.000    0.000    0.000    0.001    0.000     0.03     0.14        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.494       10    0.149    0.149    0.149    0.151    0.001    24.16   101.36        .
  total                    6.184       10    0.611    0.618    0.616    0.627    0.006   100.00   419.54    0.471
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.094        1    8.094    8.094    8.094    8.094        .   129.28   550.61        .
  base                     1.470        1    1.470    1.470    1.470    1.470        .    23.48   100.00        .
  init                     4.662        1    4.662    4.662    4.662    4.662        .    74.46   317.14        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.07        .
  check                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.07        .
  - usefulness             0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
    - is_useful() 1        0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.07        .
    - is_useful() 2        0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.07        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.07        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.597        1    1.597    1.597    1.597    1.597        .    25.51   108.64        .
  total                    6.261        1    6.261    6.261    6.261    6.261        .   100.00   425.92    4.791
-------------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.084      100    0.000    0.001    0.001    0.002    0.000     1.23    71.79        .
  base                     0.117      100    0.001    0.001    0.001    0.002    0.000     1.72   100.00        .
  init                     0.061      100    0.000    0.001    0.001    0.001    0.000     0.90    52.14        .
  parse                    0.229      100    0.002    0.002    0.002    0.003    0.000     3.36   195.73        .
  check                    6.348      100    0.062    0.063    0.063    0.070    0.002    93.22  5425.64        .
  - usefulness             2.918      100    0.028    0.029    0.029    0.035    0.001    42.85  2494.02        .
    - is_useful() 1        2.783      100    0.023    0.028    0.028    0.034    0.001    40.87  2378.63        .
  - combine                0.085      100    0.000    0.001    0.001    0.002    0.000     1.25    72.65        .
  - exhaustiveness         3.325      100    0.032    0.033    0.033    0.040    0.001    48.83  2841.88        .
    - is_useful() 2        3.305      100    0.032    0.033    0.033    0.040    0.001    48.53  2824.79        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.03     1.71        .
  - print                  0.004      100    0.000    0.000    0.000    0.001    0.000     0.06     3.42        .
  + Overlap()              2.795      100    0.017    0.028    0.028    0.038    0.003    41.04  2388.89        .
  + Difference()           2.443      100    0.018    0.024    0.025    0.031    0.003    35.87  2088.03        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.170      100    0.001    0.002    0.002    0.004    0.001     2.50   145.30        .
  total                    6.810      100    0.066    0.068    0.068    0.075    0.002   100.00  5820.51    0.067
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.201      100    0.001    0.002    0.002    0.004    0.000     2.56    18.53        .
  base                     1.085      100    0.010    0.011    0.011    0.014    0.001    13.83   100.00        .
  init                     0.156      100    0.001    0.002    0.002    0.002    0.000     1.99    14.38        .
  parse                    0.235      100    0.002    0.002    0.002    0.003    0.000     2.99    21.66        .
  check                    6.347      100    0.062    0.063    0.063    0.070    0.001    80.88   584.98        .
  - usefulness             2.938      100    0.028    0.029    0.029    0.035    0.001    37.44   270.78        .
    - is_useful() 1        2.801      100    0.025    0.028    0.028    0.034    0.001    35.70   258.16        .
  - combine                0.080      100    0.000    0.001    0.001    0.002    0.000     1.02     7.37        .
  - exhaustiveness         3.304      100    0.032    0.033    0.033    0.035    0.001    42.11   304.52        .
    - is_useful() 2        3.275      100    0.032    0.033    0.033    0.034    0.001    41.74   301.84        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.03     0.18        .
  - print                  0.011      100    0.000    0.000    0.000    0.001    0.000     0.14     1.01        .
  + Overlap()              2.761      100    0.020    0.028    0.027    0.035    0.004    35.19   254.47        .
  + Difference()           2.441      100    0.019    0.024    0.024    0.032    0.003    31.11   224.98        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.106      100    0.010    0.011    0.011    0.012    0.000    14.09   101.94        .
  total                    7.847      100    0.077    0.078    0.078    0.084    0.001   100.00   723.23    0.068
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.111       10    0.011    0.011    0.011    0.012    0.000     6.04    10.35        .
  base                     1.072       10    0.106    0.107    0.107    0.111    0.001    58.32   100.00        .
  init                     0.125       10    0.012    0.013    0.012    0.013    0.001     6.80    11.66        .
  parse                    0.025       10    0.002    0.003    0.002    0.003    0.001     1.36     2.33        .
  check                    0.634       10    0.063    0.063    0.063    0.064    0.001    34.49    59.14        .
  - usefulness             0.291       10    0.028    0.029    0.029    0.030    0.001    15.83    27.15        .
    - is_useful() 1        0.279       10    0.026    0.028    0.028    0.030    0.001    15.18    26.03        .
  - combine                0.009       10    0.000    0.001    0.001    0.001    0.000     0.49     0.84        .
  - exhaustiveness         0.334       10    0.032    0.033    0.033    0.035    0.001    18.17    31.16        .
    - is_useful() 2        0.331       10    0.032    0.033    0.033    0.035    0.001    18.01    30.88        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.288       10    0.026    0.029    0.028    0.033    0.003    15.67    26.87        .
  + Difference()           0.237       10    0.022    0.024    0.023    0.026    0.002    12.89    22.11        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.054       10    0.104    0.105    0.105    0.107    0.001    57.34    98.32        .
  total                    1.838       10    0.182    0.184    0.183    0.185    0.001   100.00   171.46    0.077
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.178        1    0.178    0.178    0.178    0.178        .    14.40    16.57        .
  base                     1.074        1    1.074    1.074    1.074    1.074        .    86.89   100.00        .
  init                     0.119        1    0.119    0.119    0.119    0.119        .     9.63    11.08        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.24     0.28        .
  check                    0.062        1    0.062    0.062    0.062    0.062        .     5.02     5.77        .
  - usefulness             0.029        1    0.029    0.029    0.029    0.029        .     2.35     2.70        .
    - is_useful() 1        0.029        1    0.029    0.029    0.029    0.029        .     2.35     2.70        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.08     0.09        .
  - exhaustiveness         0.032        1    0.032    0.032    0.032    0.032        .     2.59     2.98        .
    - is_useful() 2        0.032        1    0.032    0.032    0.032    0.032        .     2.59     2.98        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.026        1    0.026    0.026    0.026    0.026        .     2.10     2.42        .
  + Difference()           0.023        1    0.023    0.023    0.023    0.023        .     1.86     2.14        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.052        1    1.052    1.052    1.052    1.052        .    85.11    97.95        .
  total                    1.236        1    1.236    1.236    1.236    1.236        .   100.00   115.08    0.162
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.041        1    3.041    3.041    3.041    3.041        .    25.79    28.39        .
  base                    10.712        1   10.712   10.712   10.712   10.712        .    90.85   100.00        .
  init                     1.207        1    1.207    1.207    1.207    1.207        .    10.24    11.27        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.02     0.02        .
  check                    0.064        1    0.064    0.064    0.064    0.064        .     0.54     0.60        .
  - usefulness             0.030        1    0.030    0.030    0.030    0.030        .     0.25     0.28        .
    - is_useful() 1        0.030        1    0.030    0.030    0.030    0.030        .     0.25     0.28        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.034        1    0.034    0.034    0.034    0.034        .     0.29     0.32        .
    - is_useful() 2        0.033        1    0.033    0.033    0.033    0.033        .     0.28     0.31        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.021        1    0.021    0.021    0.021    0.021        .     0.18     0.20        .
  + Difference()           0.026        1    0.026    0.026    0.026    0.026        .     0.22     0.24        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.518        1   10.518   10.518   10.518   10.518        .    89.20    98.19        .
  total                   11.791        1   11.791   11.791   11.791   11.791        .   100.00   110.07    1.079
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.079      100    0.000    0.001    0.001    0.002    0.000     1.16    61.72        .
  base                     0.128      100    0.001    0.001    0.001    0.002    0.000     1.89   100.00        .
  init                     0.085      100    0.000    0.001    0.001    0.001    0.000     1.25    66.41        .
  parse                    0.224      100    0.002    0.002    0.002    0.003    0.000     3.30   175.00        .
  check                    6.315      100    0.062    0.063    0.063    0.067    0.001    93.02  4933.59        .
  - usefulness             2.905      100    0.028    0.029    0.029    0.031    0.001    42.79  2269.53        .
    - is_useful() 1        2.777      100    0.025    0.028    0.028    0.031    0.001    40.90  2169.53        .
  - combine                0.089      100    0.000    0.001    0.001    0.002    0.000     1.31    69.53        .
  - exhaustiveness         3.296      100    0.032    0.033    0.033    0.037    0.001    48.55  2575.00        .
    - is_useful() 2        3.277      100    0.032    0.033    0.033    0.037    0.001    48.27  2560.16        .
  - compress               0.003      100    0.000    0.000    0.000    0.001    0.000     0.04     2.34        .
  - print                  0.007      100    0.000    0.000    0.000    0.001    0.000     0.10     5.47        .
  + Overlap()              2.783      100    0.020    0.028    0.028    0.038    0.003    40.99  2174.22        .
  + Difference()           2.440      100    0.019    0.024    0.024    0.030    0.003    35.94  1906.25        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.159      100    0.001    0.002    0.002    0.003    0.001     2.34   124.22        .
  total                    6.789      100    0.067    0.068    0.068    0.073    0.001   100.00  5303.91    0.067
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.222      100    0.002    0.002    0.002    0.003    0.000     2.69    18.97        .
  base                     1.170      100    0.011    0.012    0.012    0.014    0.001    14.20   100.00        .
  init                     0.346      100    0.003    0.003    0.003    0.005    0.001     4.20    29.57        .
  parse                    0.232      100    0.002    0.002    0.002    0.003    0.000     2.82    19.83        .
  check                    6.343      100    0.062    0.063    0.063    0.069    0.001    77.00   542.14        .
  - usefulness             2.919      100    0.028    0.029    0.029    0.035    0.001    35.43   249.49        .
    - is_useful() 1        2.799      100    0.025    0.028    0.028    0.035    0.001    33.98   239.23        .
  - combine                0.082      100    0.000    0.001    0.001    0.001    0.000     1.00     7.01        .
  - exhaustiveness         3.316      100    0.032    0.033    0.033    0.037    0.001    40.25   283.42        .
    - is_useful() 2        3.294      100    0.032    0.033    0.033    0.037    0.001    39.99   281.54        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.009      100    0.000    0.000    0.000    0.001    0.000     0.11     0.77        .
  + Overlap()              2.835      100    0.019    0.028    0.029    0.038    0.004    34.41   242.31        .
  + Difference()           2.426      100    0.019    0.024    0.024    0.030    0.003    29.45   207.35        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.314      100    0.012    0.013    0.013    0.018    0.001    15.95   112.31        .
  total                    8.238      100    0.081    0.082    0.082    0.087    0.001   100.00   704.10    0.071
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.165       10    0.015    0.017    0.016    0.018    0.001     3.95     5.64        .
  base                     2.925       10    0.285    0.292    0.290    0.307    0.007    69.94   100.00        .
  init                     0.614       10    0.058    0.061    0.060    0.067    0.003    14.68    20.99        .
  parse                    0.024       10    0.002    0.002    0.002    0.003    0.001     0.57     0.82        .
  check                    0.639       10    0.062    0.064    0.063    0.068    0.002    15.28    21.85        .
  - usefulness             0.295       10    0.028    0.029    0.029    0.033    0.001     7.05    10.09        .
    - is_useful() 1        0.274       10    0.026    0.027    0.027    0.031    0.002     6.55     9.37        .
  - combine                0.010       10    0.000    0.001    0.001    0.002    0.000     0.24     0.34        .
  - exhaustiveness         0.333       10    0.032    0.033    0.033    0.034    0.001     7.96    11.38        .
    - is_useful() 2        0.330       10    0.032    0.033    0.033    0.034    0.001     7.89    11.28        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.273       10    0.023    0.027    0.027    0.035    0.004     6.53     9.33        .
  + Difference()           0.256       10    0.022    0.026    0.026    0.032    0.003     6.12     8.75        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.905       10    0.284    0.290    0.290    0.298    0.004    69.46    99.32        .
  total                    4.182       10    0.411    0.418    0.415    0.435    0.008   100.00   142.97    0.126
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.226        1    0.226    0.226    0.226    0.226        .    14.83    19.07        .
  base                     1.185        1    1.185    1.185    1.185    1.185        .    77.76   100.00        .
  init                     0.322        1    0.322    0.322    0.322    0.322        .    21.13    27.17        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.13     0.17        .
  check                    0.064        1    0.064    0.064    0.064    0.064        .     4.20     5.40        .
  - usefulness             0.029        1    0.029    0.029    0.029    0.029        .     1.90     2.45        .
    - is_useful() 1        0.028        1    0.028    0.028    0.028    0.028        .     1.84     2.36        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.08        .
  - exhaustiveness         0.033        1    0.033    0.033    0.033    0.033        .     2.17     2.78        .
    - is_useful() 2        0.033        1    0.033    0.033    0.033    0.033        .     2.17     2.78        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.08        .
  + Overlap()              0.031        1    0.031    0.031    0.031    0.031        .     2.03     2.62        .
  + Difference()           0.021        1    0.021    0.021    0.021    0.021        .     1.38     1.77        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.136        1    1.136    1.136    1.136    1.136        .    74.54    95.86        .
  total                    1.524        1    1.524    1.524    1.524    1.524        .   100.00   128.61    0.339
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.197        1    3.197    3.197    3.197    3.197        .    22.98    28.57        .
  base                    11.192        1   11.192   11.192   11.192   11.192        .    80.43   100.00        .
  init                     3.215        1    3.215    3.215    3.215    3.215        .    23.10    28.73        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check                    0.063        1    0.063    0.063    0.063    0.063        .     0.45     0.56        .
  - usefulness             0.029        1    0.029    0.029    0.029    0.029        .     0.21     0.26        .
    - is_useful() 1        0.029        1    0.029    0.029    0.029    0.029        .     0.21     0.26        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.033        1    0.033    0.033    0.033    0.033        .     0.24     0.29        .
    - is_useful() 2        0.033        1    0.033    0.033    0.033    0.033        .     0.24     0.29        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.030        1    0.030    0.030    0.030    0.030        .     0.22     0.27        .
  + Difference()           0.025        1    0.025    0.025    0.025    0.025        .     0.18     0.22        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.634        1   10.634   10.634   10.634   10.634        .    76.42    95.01        .
  total                   13.915        1   13.915   13.915   13.915   13.915        .   100.00   124.33    2.723
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.139      100    0.001    0.001    0.001    0.003    0.001     2.37   131.13        .
  base                     0.106      100    0.001    0.001    0.001    0.002    0.000     1.80   100.00        .
  init                     0.059      100    0.000    0.001    0.001    0.001    0.000     1.00    55.66        .
  parse                    0.147      100    0.001    0.001    0.001    0.002    0.001     2.50   138.68        .
  check                    5.524      100    0.054    0.055    0.055    0.062    0.001    94.04  5211.32        .
  - usefulness             1.993      100    0.019    0.020    0.020    0.024    0.001    33.93  1880.19        .
    - is_useful() 1        1.941      100    0.017    0.019    0.020    0.023    0.001    33.04  1831.13        .
  - combine                0.035      100    0.000    0.000    0.000    0.001    0.000     0.60    33.02        .
  - exhaustiveness         3.479      100    0.034    0.035    0.035    0.042    0.001    59.23  3282.08        .
    - is_useful() 2        3.454      100    0.033    0.035    0.034    0.041    0.001    58.80  3258.49        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.03     1.89        .
  - print                  0.003      100    0.000    0.000    0.000    0.001    0.000     0.05     2.83        .
  + Overlap()              2.430      100    0.014    0.024    0.024    0.032    0.003    41.37  2292.45        .
  + Difference()           2.374      100    0.018    0.024    0.024    0.032    0.003    40.42  2239.62        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.141      100    0.001    0.001    0.001    0.003    0.001     2.40   133.02        .
  total                    5.874      100    0.057    0.059    0.058    0.066    0.001   100.00  5541.51    0.058
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.711      100    0.006    0.007    0.007    0.009    0.000     9.82    72.26        .
  base                     0.984      100    0.009    0.010    0.010    0.015    0.001    13.59   100.00        .
  init                     0.526      100    0.005    0.005    0.005    0.010    0.001     7.27    53.46        .
  parse                    0.149      100    0.001    0.001    0.001    0.002    0.001     2.06    15.14        .
  check                    5.532      100    0.054    0.055    0.055    0.060    0.001    76.42   562.20        .
  - usefulness             1.995      100    0.019    0.020    0.020    0.022    0.001    27.56   202.74        .
    - is_useful() 1        1.950      100    0.017    0.019    0.020    0.022    0.001    26.94   198.17        .
  - combine                0.031      100    0.000    0.000    0.000    0.001    0.000     0.43     3.15        .
  - exhaustiveness         3.487      100    0.034    0.035    0.035    0.039    0.001    48.17   354.37        .
    - is_useful() 2        3.460      100    0.033    0.035    0.034    0.039    0.001    47.80   351.63        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.10        .
  - print                  0.005      100    0.000    0.000    0.000    0.001    0.000     0.07     0.51        .
  + Overlap()              2.469      100    0.016    0.025    0.025    0.031    0.003    34.11   250.91        .
  + Difference()           2.349      100    0.018    0.023    0.023    0.030    0.003    32.45   238.72        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.028      100    0.009    0.010    0.010    0.012    0.000    14.20   104.47        .
  total                    7.239      100    0.071    0.072    0.072    0.077    0.001   100.00   735.67    0.063
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.628       10    0.062    0.063    0.062    0.066    0.001    29.07    65.55        .
  base                     0.958       10    0.094    0.096    0.095    0.100    0.002    44.35   100.00        .
  init                     0.599       10    0.058    0.060    0.059    0.065    0.002    27.73    62.53        .
  parse                    0.016       10    0.001    0.002    0.002    0.002    0.001     0.74     1.67        .
  check                    0.550       10    0.054    0.055    0.055    0.056    0.001    25.46    57.41        .
  - usefulness             0.199       10    0.019    0.020    0.020    0.022    0.001     9.21    20.77        .
    - is_useful() 1        0.195       10    0.018    0.019    0.019    0.021    0.001     9.03    20.35        .
  - combine                0.006       10    0.000    0.001    0.001    0.001    0.001     0.28     0.63        .
  - exhaustiveness         0.344       10    0.034    0.034    0.034    0.035    0.001    15.93    35.91        .
    - is_useful() 2        0.342       10    0.033    0.034    0.034    0.035    0.001    15.83    35.70        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.05     0.10        .
  + Overlap()              0.247       10    0.021    0.025    0.025    0.028    0.002    11.44    25.78        .
  + Difference()           0.223       10    0.018    0.022    0.022    0.026    0.002    10.32    23.28        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.995       10    0.098    0.100    0.099    0.103    0.002    46.06   103.86        .
  total                    2.160       10    0.213    0.216    0.215    0.219    0.002   100.00   225.47    0.120
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.715        1    0.715    0.715    0.715    0.715        .    46.46    74.02        .
  base                     0.966        1    0.966    0.966    0.966    0.966        .    62.77   100.00        .
  init                     0.484        1    0.484    0.484    0.484    0.484        .    31.45    50.10        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.10        .
  check                    0.056        1    0.056    0.056    0.056    0.056        .     3.64     5.80        .
  - usefulness             0.021        1    0.021    0.021    0.021    0.021        .     1.36     2.17        .
    - is_useful() 1        0.021        1    0.021    0.021    0.021    0.021        .     1.36     2.17        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.035        1    0.035    0.035    0.035    0.035        .     2.27     3.62        .
    - is_useful() 2        0.035        1    0.035    0.035    0.035    0.035        .     2.27     3.62        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.022        1    0.022    0.022    0.022    0.022        .     1.43     2.28        .
  + Difference()           0.027        1    0.027    0.027    0.027    0.027        .     1.75     2.80        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.998        1    0.998    0.998    0.998    0.998        .    64.85   103.31        .
  total                    1.539        1    1.539    1.539    1.539    1.539        .   100.00   159.32    0.573
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.431        1    8.431    8.431    8.431    8.431        .    57.23    87.12        .
  base                     9.678        1    9.678    9.678    9.678    9.678        .    65.69   100.00        .
  init                     4.851        1    4.851    4.851    4.851    4.851        .    32.93    50.12        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  check                    0.056        1    0.056    0.056    0.056    0.056        .     0.38     0.58        .
  - usefulness             0.021        1    0.021    0.021    0.021    0.021        .     0.14     0.22        .
    - is_useful() 1        0.021        1    0.021    0.021    0.021    0.021        .     0.14     0.22        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.034        1    0.034    0.034    0.034    0.034        .     0.23     0.35        .
    - is_useful() 2        0.034        1    0.034    0.034    0.034    0.034        .     0.23     0.35        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  + Overlap()              0.023        1    0.023    0.023    0.023    0.023        .     0.16     0.24        .
  + Difference()           0.025        1    0.025    0.025    0.025    0.025        .     0.17     0.26        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     9.825        1    9.825    9.825    9.825    9.825        .    66.69   101.52        .
  total                   14.733        1   14.733   14.733   14.733   14.733        .   100.00   152.23    5.055
-------------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.01    22.22        .
  base                     0.009        1    0.009    0.009    0.009    0.009        .     0.04   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.00    11.11        .
  parse                    0.132        1    0.132    0.132    0.132    0.132        .     0.64  1466.67        .
  check                   20.335        1   20.335   20.335   20.335   20.335        .    99.28  2.3e+05        .
  - usefulness            16.421        1   16.421   16.421   16.421   16.421        .    80.17  1.8e+05        .
    - is_useful() 1       16.207        1   16.207   16.207   16.207   16.207        .    79.13  1.8e+05        .
  - combine                0.115        1    0.115    0.115    0.115    0.115        .     0.56  1277.78        .
  - exhaustiveness         3.796        1    3.796    3.796    3.796    3.796        .    18.53 42177.78        .
    - is_useful() 2        3.793        1    3.793    3.793    3.793    3.793        .    18.52 42144.44        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00    11.11        .
  + Overlap()              9.453        1    9.453    9.453    9.453    9.453        .    46.15  1.1e+05        .
  + Difference()           2.813        1    2.813    2.813    2.813    2.813        .    13.73 31255.56        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.014        1    0.014    0.014    0.014    0.014        .     0.07   155.56        .
  total                   20.482        1   20.482   20.482   20.482   20.482        .   100.00  2.3e+05   20.473
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.003        1    0.003    0.003    0.003    0.003        .     0.01     3.09        .
  base                     0.097        1    0.097    0.097    0.097    0.097        .     0.44   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.01     2.06        .
  parse                    0.128        1    0.128    0.128    0.128    0.128        .     0.58   131.96        .
  check                   21.850        1   21.850   21.850   21.850   21.850        .    98.91 22525.77        .
  - usefulness            17.486        1   17.486   17.486   17.486   17.486        .    79.15 18026.80        .
    - is_useful() 1       17.259        1   17.259   17.259   17.259   17.259        .    78.13 17792.78        .
  - combine                0.119        1    0.119    0.119    0.119    0.119        .     0.54   122.68        .
  - exhaustiveness         4.240        1    4.240    4.240    4.240    4.240        .    19.19  4371.13        .
    - is_useful() 2        4.236        1    4.236    4.236    4.236    4.236        .    19.18  4367.01        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     1.03        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     1.03        .
  + Overlap()             10.231        1   10.231   10.231   10.231   10.231        .    46.31 10547.42        .
  + Difference()           3.132        1    3.132    3.132    3.132    3.132        .    14.18  3228.87        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.111        1    0.111    0.111    0.111    0.111        .     0.50   114.43        .
  total                   22.091        1   22.091   22.091   22.091   22.091        .   100.00 22774.23   21.994
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.021        1    0.021    0.021    0.021    0.021        .     0.09     2.22        .
  base                     0.948        1    0.948    0.948    0.948    0.948        .     3.95   100.00        .
  init                     0.013        1    0.013    0.013    0.013    0.013        .     0.05     1.37        .
  parse                    0.128        1    0.128    0.128    0.128    0.128        .     0.53    13.50        .
  check                   22.757        1   22.757   22.757   22.757   22.757        .    94.84  2400.53        .
  - usefulness            17.987        1   17.987   17.987   17.987   17.987        .    74.96  1897.36        .
    - is_useful() 1       17.757        1   17.757   17.757   17.757   17.757        .    74.01  1873.10        .
  - combine                0.139        1    0.139    0.139    0.139    0.139        .     0.58    14.66        .
  - exhaustiveness         4.628        1    4.628    4.628    4.628    4.628        .    19.29   488.19        .
    - is_useful() 2        4.625        1    4.625    4.625    4.625    4.625        .    19.28   487.87        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.11        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.11        .
  + Overlap()             10.444        1   10.444   10.444   10.444   10.444        .    43.53  1101.69        .
  + Difference()           3.354        1    3.354    3.354    3.354    3.354        .    13.98   353.80        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.095        1    1.095    1.095    1.095    1.095        .     4.56   115.51        .
  total                   23.994        1   23.994   23.994   23.994   23.994        .   100.00  2531.01   23.046
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.200        1    0.200    0.200    0.200    0.200        .     0.62     1.98        .
  base                    10.106        1   10.106   10.106   10.106   10.106        .    31.37   100.00        .
  init                     0.143        1    0.143    0.143    0.143    0.143        .     0.44     1.42        .
  parse                    0.141        1    0.141    0.141    0.141    0.141        .     0.44     1.40        .
  check                   21.943        1   21.943   21.943   21.943   21.943        .    68.11   217.13        .
  - usefulness            17.622        1   17.622   17.622   17.622   17.622        .    54.70   174.37        .
    - is_useful() 1       17.396        1   17.396   17.396   17.396   17.396        .    54.00   172.14        .
  - combine                0.118        1    0.118    0.118    0.118    0.118        .     0.37     1.17        .
  - exhaustiveness         4.200        1    4.200    4.200    4.200    4.200        .    13.04    41.56        .
    - is_useful() 2        4.195        1    4.195    4.195    4.195    4.195        .    13.02    41.51        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()             10.168        1   10.168   10.168   10.168   10.168        .    31.56   100.61        .
  + Difference()           3.085        1    3.085    3.085    3.085    3.085        .     9.58    30.53        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     9.989        1    9.989    9.989    9.989    9.989        .    31.01    98.84        .
  total                   32.216        1   32.216   32.216   32.216   32.216        .   100.00   318.78   22.110
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_integer, obs(10000000) levels(1000) rep(1)
. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.00    10.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.04   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.136        1    0.136    0.136    0.136    0.136        .     0.61  1360.00        .
  check                   22.320        1   22.320   22.320   22.320   22.320        .    99.32  2.2e+05        .
  - usefulness            17.347        1   17.347   17.347   17.347   17.347        .    77.19  1.7e+05        .
    - is_useful() 1       17.115        1   17.115   17.115   17.115   17.115        .    76.16  1.7e+05        .
  - combine                0.128        1    0.128    0.128    0.128    0.128        .     0.57  1280.00        .
  - exhaustiveness         4.840        1    4.840    4.840    4.840    4.840        .    21.54 48400.00        .
    - is_useful() 2        4.835        1    4.835    4.835    4.835    4.835        .    21.52 48350.00        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00    10.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00    10.00        .
  + Overlap()             10.462        1   10.462   10.462   10.462   10.462        .    46.56  1.0e+05        .
  + Difference()           3.297        1    3.297    3.297    3.297    3.297        .    14.67 32970.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.016        1    0.016    0.016    0.016    0.016        .     0.07   160.00        .
  total                   22.472        1   22.472   22.472   22.472   22.472        .   100.00  2.2e+05   22.462
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.004        1    0.004    0.004    0.004    0.004        .     0.02     3.13        .
  base                     0.128        1    0.128    0.128    0.128    0.128        .     0.56   100.00        .
  init                     0.004        1    0.004    0.004    0.004    0.004        .     0.02     3.13        .
  parse                    0.151        1    0.151    0.151    0.151    0.151        .     0.66   117.97        .
  check                   22.777        1   22.777   22.777   22.777   22.777        .    98.83 17794.53        .
  - usefulness            18.315        1   18.315   18.315   18.315   18.315        .    79.47 14308.59        .
    - is_useful() 1       18.072        1   18.072   18.072   18.072   18.072        .    78.42 14118.75        .
  - combine                0.125        1    0.125    0.125    0.125    0.125        .     0.54    97.66        .
  - exhaustiveness         4.334        1    4.334    4.334    4.334    4.334        .    18.81  3385.94        .
    - is_useful() 2        4.330        1    4.330    4.330    4.330    4.330        .    18.79  3382.81        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()             10.668        1   10.668   10.668   10.668   10.668        .    46.29  8334.38        .
  + Difference()           3.207        1    3.207    3.207    3.207    3.207        .    13.92  2505.47        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.113        1    0.113    0.113    0.113    0.113        .     0.49    88.28        .
  total                   23.046        1   23.046   23.046   23.046   23.046        .   100.00 18004.69   22.918
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.018        1    0.018    0.018    0.018    0.018        .     0.08     1.51        .
  base                     1.194        1    1.194    1.194    1.194    1.194        .     5.11   100.00        .
  init                     0.065        1    0.065    0.065    0.065    0.065        .     0.28     5.44        .
  parse                    0.159        1    0.159    0.159    0.159    0.159        .     0.68    13.32        .
  check                   21.925        1   21.925   21.925   21.925   21.925        .    93.85  1836.26        .
  - usefulness            17.495        1   17.495   17.495   17.495   17.495        .    74.89  1465.24        .
    - is_useful() 1       17.266        1   17.266   17.266   17.266   17.266        .    73.91  1446.06        .
  - combine                0.119        1    0.119    0.119    0.119    0.119        .     0.51     9.97        .
  - exhaustiveness         4.308        1    4.308    4.308    4.308    4.308        .    18.44   360.80        .
    - is_useful() 2        4.303        1    4.303    4.303    4.303    4.303        .    18.42   360.39        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              9.965        1    9.965    9.965    9.965    9.965        .    42.66   834.59        .
  + Difference()           3.167        1    3.167    3.167    3.167    3.167        .    13.56   265.24        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.212        1    1.212    1.212    1.212    1.212        .     5.19   101.51        .
  total                   23.361        1   23.361   23.361   23.361   23.361        .   100.00  1956.53   22.167
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.192        1    0.192    0.192    0.192    0.192        .     0.58     1.83        .
  base                    10.485        1   10.485   10.485   10.485   10.485        .    31.75   100.00        .
  init                     0.339        1    0.339    0.339    0.339    0.339        .     1.03     3.23        .
  parse                    0.128        1    0.128    0.128    0.128    0.128        .     0.39     1.22        .
  check                   22.260        1   22.260   22.260   22.260   22.260        .    67.41   212.30        .
  - usefulness            17.812        1   17.812   17.812   17.812   17.812        .    53.94   169.88        .
    - is_useful() 1       17.583        1   17.583   17.583   17.583   17.583        .    53.25   167.70        .
  - combine                0.129        1    0.129    0.129    0.129    0.129        .     0.39     1.23        .
  - exhaustiveness         4.314        1    4.314    4.314    4.314    4.314        .    13.06    41.14        .
    - is_useful() 2        4.309        1    4.309    4.309    4.309    4.309        .    13.05    41.10        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()             10.422        1   10.422   10.422   10.422   10.422        .    31.56    99.40        .
  + Difference()           3.089        1    3.089    3.089    3.089    3.089        .     9.35    29.46        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.293        1   10.293   10.293   10.293   10.293        .    31.17    98.17        .
  total                   33.021        1   33.021   33.021   33.021   33.021        .   100.00   314.94   22.536
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_float,   obs(10000000) levels(1000) rep(1)
. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.01     7.14        .
  base                     0.014        1    0.014    0.014    0.014    0.014        .     0.12   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01     7.14        .
  parse                    0.068        1    0.068    0.068    0.068    0.068        .     0.56   485.71        .
  check                   12.053        1   12.053   12.053   12.053   12.053        .    99.32 86092.86        .
  - usefulness             7.277        1    7.277    7.277    7.277    7.277        .    59.97 51978.57        .
    - is_useful() 1        7.195        1    7.195    7.195    7.195    7.195        .    59.29 51392.86        .
  - combine                0.051        1    0.051    0.051    0.051    0.051        .     0.42   364.29        .
  - exhaustiveness         4.721        1    4.721    4.721    4.721    4.721        .    38.90 33721.43        .
    - is_useful() 2        4.717        1    4.717    4.717    4.717    4.717        .    38.87 33692.86        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     7.14        .
  + Overlap()              5.545        1    5.545    5.545    5.545    5.545        .    45.69 39607.14        .
  + Difference()           3.175        1    3.175    3.175    3.175    3.175        .    26.16 22678.57        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.012        1    0.012    0.012    0.012    0.012        .     0.10    85.71        .
  total                   12.135        1   12.135   12.135   12.135   12.135        .   100.00 86678.57   12.121
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.017        1    0.017    0.017    0.017    0.017        .     0.14    16.04        .
  base                     0.106        1    0.106    0.106    0.106    0.106        .     0.87   100.00        .
  init                     0.007        1    0.007    0.007    0.007    0.007        .     0.06     6.60        .
  parse                    0.063        1    0.063    0.063    0.063    0.063        .     0.52    59.43        .
  check                   11.991        1   11.991   11.991   11.991   11.991        .    98.46 11312.26        .
  - usefulness             7.263        1    7.263    7.263    7.263    7.263        .    59.64  6851.89        .
    - is_useful() 1        7.163        1    7.163    7.163    7.163    7.163        .    58.82  6757.55        .
  - combine                0.048        1    0.048    0.048    0.048    0.048        .     0.39    45.28        .
  - exhaustiveness         4.677        1    4.677    4.677    4.677    4.677        .    38.41  4412.26        .
    - is_useful() 2        4.671        1    4.671    4.671    4.671    4.671        .    38.36  4406.60        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.94        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              5.376        1    5.376    5.376    5.376    5.376        .    44.15  5071.70        .
  + Difference()           3.256        1    3.256    3.256    3.256    3.256        .    26.74  3071.70        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.117        1    0.117    0.117    0.117    0.117        .     0.96   110.38        .
  total                   12.178        1   12.178   12.178   12.178   12.178        .   100.00 11488.68   12.072
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.119        1    0.119    0.119    0.119    0.119        .     0.93    12.65        .
  base                     0.941        1    0.941    0.941    0.941    0.941        .     7.32   100.00        .
  init                     0.070        1    0.070    0.070    0.070    0.070        .     0.54     7.44        .
  parse                    0.061        1    0.061    0.061    0.061    0.061        .     0.47     6.48        .
  check                   11.683        1   11.683   11.683   11.683   11.683        .    90.83  1241.55        .
  - usefulness             7.083        1    7.083    7.083    7.083    7.083        .    55.06   752.71        .
    - is_useful() 1        6.981        1    6.981    6.981    6.981    6.981        .    54.27   741.87        .
  - combine                0.061        1    0.061    0.061    0.061    0.061        .     0.47     6.48        .
  - exhaustiveness         4.537        1    4.537    4.537    4.537    4.537        .    35.27   482.15        .
    - is_useful() 2        4.533        1    4.533    4.533    4.533    4.533        .    35.24   481.72        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.11        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              5.248        1    5.248    5.248    5.248    5.248        .    40.80   557.70        .
  + Difference()           3.100        1    3.100    3.100    3.100    3.100        .    24.10   329.44        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.049        1    1.049    1.049    1.049    1.049        .     8.16   111.48        .
  total                   12.863        1   12.863   12.863   12.863   12.863        .   100.00  1366.95   11.922
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.743        1    0.743    0.743    0.743    0.743        .     3.27     7.32        .
  base                    10.152        1   10.152   10.152   10.152   10.152        .    44.67   100.00        .
  init                     0.539        1    0.539    0.539    0.539    0.539        .     2.37     5.31        .
  parse                    0.069        1    0.069    0.069    0.069    0.069        .     0.30     0.68        .
  check                   11.513        1   11.513   11.513   11.513   11.513        .    50.66   113.41        .
  - usefulness             6.891        1    6.891    6.891    6.891    6.891        .    30.32    67.88        .
    - is_useful() 1        6.784        1    6.784    6.784    6.784    6.784        .    29.85    66.82        .
  - combine                0.049        1    0.049    0.049    0.049    0.049        .     0.22     0.48        .
  - exhaustiveness         4.571        1    4.571    4.571    4.571    4.571        .    20.11    45.03        .
    - is_useful() 2        4.567        1    4.567    4.567    4.567    4.567        .    20.10    44.99        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  + Overlap()              5.188        1    5.188    5.188    5.188    5.188        .    22.83    51.10        .
  + Difference()           3.064        1    3.064    3.064    3.064    3.064        .    13.48    30.18        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.604        1   10.604   10.604   10.604   10.604        .    46.66   104.45        .
  total                   22.725        1   22.725   22.725   22.725   22.725        .   100.00   223.85   12.573
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_string,  obs(10000000) levels(1000) rep(1)
. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.747     1000    0.000    0.001    0.001    0.003    0.000    59.05   185.82        .
  base                     0.402     1000    0.000    0.000    0.000    0.003    0.001    31.78   100.00        .
  init                     0.092     1000    0.000    0.000    0.000    0.001    0.000     7.27    22.89        .
  parse                    0.639     1000    0.000    0.001    0.001    0.002    0.001    50.51   158.96        .
  check                    0.008     1000    0.000    0.000    0.000    0.001    0.000     0.63     1.99        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.485     1000    0.000    0.000    0.000    0.002    0.001    38.34   120.65        .
  total                    1.265     1000    0.000    0.001    0.001    0.004    0.001   100.00   314.68    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.268     1000    0.001    0.002    0.002    0.006    0.001    51.85    61.60        .
  base                     3.682     1000    0.002    0.004    0.003    0.011    0.001    84.18   100.00        .
  init                     0.125     1000    0.000    0.000    0.000    0.002    0.000     2.86     3.39        .
  parse                    0.711     1000    0.000    0.001    0.001    0.002    0.001    16.26    19.31        .
  check                    0.008     1000    0.000    0.000    0.000    0.001    0.000     0.18     0.22        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     3.494     1000    0.002    0.003    0.003    0.013    0.001    79.88    94.89        .
  total                    4.374     1000    0.003    0.004    0.004    0.013    0.002   100.00   118.79    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.559      100    0.010    0.016    0.015    0.023    0.003    54.97    54.66        .
  base                     2.852      100    0.025    0.029    0.026    0.049    0.004   100.56   100.00        .
  init                     0.015      100    0.000    0.000    0.000    0.002    0.000     0.53     0.53        .
  parse                    0.046      100    0.000    0.000    0.000    0.002    0.001     1.62     1.61        .
  check                    0.001      100    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.771      100    0.024    0.028    0.025    0.048    0.005    97.71    97.16        .
  total                    2.836      100    0.024    0.028    0.026    0.049    0.005   100.00    99.44   -0.000
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.039       10    0.191    0.204    0.204    0.217    0.007    74.94    71.64        .
  base                     2.846       10    0.251    0.285    0.279    0.314    0.018   104.59   100.00        .
  init                     0.005       10    0.000    0.001    0.000    0.001    0.001     0.18     0.18        .
  parse                    0.002       10    0.000    0.000    0.000    0.001    0.000     0.07     0.07        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.713       10    0.246    0.271    0.265    0.297    0.018    99.71    95.33        .
  total                    2.721       10    0.247    0.272    0.266    0.298    0.017   100.00    95.61   -0.013
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.365        1    3.365    3.365    3.365    3.365        .   121.35   122.63        .
  base                     2.744        1    2.744    2.744    2.744    2.744        .    98.95   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.773        1    2.773    2.773    2.773    2.773        .   100.00   101.06        .
  total                    2.773        1    2.773    2.773    2.773    2.773        .   100.00   101.06    0.029
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.821     1000    0.000    0.001    0.001    0.002    0.000    57.98   174.68        .
  base                     0.470     1000    0.000    0.000    0.000    0.002    0.001    33.19   100.00        .
  init                     0.100     1000    0.000    0.000    0.000    0.001    0.000     7.06    21.28        .
  parse                    0.725     1000    0.000    0.001    0.001    0.003    0.001    51.20   154.26        .
  check                    0.005     1000    0.000    0.000    0.000    0.001    0.000     0.35     1.06        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.556     1000    0.000    0.001    0.001    0.002    0.001    39.27   118.30        .
  total                    1.416     1000    0.000    0.001    0.001    0.004    0.001   100.00   301.28    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.838     1000    0.001    0.003    0.003    0.008    0.001    53.03    60.37        .
  base                     4.701     1000    0.002    0.005    0.004    0.013    0.002    87.84   100.00        .
  init                     0.146     1000    0.000    0.000    0.000    0.001    0.000     2.73     3.11        .
  parse                    0.819     1000    0.000    0.001    0.001    0.003    0.001    15.30    17.42        .
  check                    0.004     1000    0.000    0.000    0.000    0.001    0.000     0.07     0.09        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     4.344     1000    0.002    0.004    0.004    0.011    0.001    81.17    92.41        .
  total                    5.352     1000    0.003    0.005    0.005    0.013    0.002   100.00   113.85    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.053      100    0.015    0.021    0.020    0.032    0.003    30.44    31.39        .
  base                     6.540      100    0.060    0.065    0.063    0.078    0.005    96.96   100.00        .
  init                     0.009      100    0.000    0.000    0.000    0.001    0.000     0.13     0.14        .
  parse                    0.059      100    0.000    0.001    0.001    0.002    0.001     0.87     0.90        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     6.676      100    0.060    0.067    0.065    0.086    0.006    98.98   102.08        .
  total                    6.745      100    0.060    0.067    0.065    0.088    0.006   100.00   103.13    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.047       10    0.187    0.205    0.205    0.217    0.010    73.47    73.29        .
  base                     2.793       10    0.263    0.279    0.277    0.299    0.011   100.25   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  parse                    0.004       10    0.000    0.000    0.000    0.001    0.001     0.14     0.14        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.781       10    0.260    0.278    0.273    0.319    0.017    99.82    99.57        .
  total                    2.786       10    0.260    0.279    0.274    0.319    0.017   100.00    99.75   -0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.404        1    3.404    3.404    3.404    3.404        .   125.29   118.98        .
  base                     2.861        1    2.861    2.861    2.861    2.861        .   105.30   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.03        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.716        1    2.716    2.716    2.716    2.716        .    99.96    94.93        .
  total                    2.717        1    2.717    2.717    2.717    2.717        .   100.00    94.97   -0.144
-------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.784     1000    0.001    0.002    0.002    0.007    0.001   139.81   606.80        .
  base                     0.294     1000    0.000    0.000    0.000    0.002    0.000    23.04   100.00        .
  init                     0.138     1000    0.000    0.000    0.000    0.001    0.000    10.82    46.94        .
  parse                    0.730     1000    0.000    0.001    0.001    0.003    0.001    57.21   248.30        .
  check                    0.010     1000    0.000    0.000    0.000    0.001    0.000     0.78     3.40        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.349     1000    0.000    0.000    0.000    0.003    0.000    27.35   118.71        .
  total                    1.276     1000    0.000    0.001    0.001    0.004    0.001   100.00   434.01    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data              11.155     1000    0.006    0.011    0.011    0.020    0.003   302.88   450.53        .
  base                     2.476     1000    0.001    0.002    0.002    0.007    0.001    67.23   100.00        .
  init                     0.130     1000    0.000    0.000    0.000    0.001    0.000     3.53     5.25        .
  parse                    0.773     1000    0.000    0.001    0.001    0.002    0.001    20.99    31.22        .
  check                    0.007     1000    0.000    0.000    0.000    0.001    0.000     0.19     0.28        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.728     1000    0.001    0.003    0.002    0.007    0.001    74.07   110.18        .
  total                    3.683     1000    0.002    0.004    0.003    0.010    0.001   100.00   148.75    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.001      100    0.060    0.070    0.068    0.097    0.008   417.72   387.44        .
  base                     1.807      100    0.014    0.018    0.017    0.037    0.004   107.82   100.00        .
  init                     0.008      100    0.000    0.000    0.000    0.001    0.000     0.48     0.44        .
  parse                    0.060      100    0.000    0.001    0.001    0.002    0.001     3.58     3.32        .
  check                    0.001      100    0.000    0.000    0.000    0.001    0.000     0.06     0.06        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.604      100    0.014    0.016    0.015    0.029    0.003    95.70    88.77        .
  total                    1.676      100    0.015    0.017    0.016    0.029    0.003   100.00    92.75   -0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.327       10    0.684    0.733    0.723    0.791    0.033   445.41   435.61        .
  base                     1.682       10    0.147    0.168    0.169    0.192    0.014   102.25   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.06     0.06        .
  parse                    0.004       10    0.000    0.000    0.000    0.001    0.001     0.24     0.24        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.640       10    0.150    0.164    0.163    0.181    0.009    99.70    97.50        .
  total                    1.645       10    0.150    0.165    0.164    0.182    0.009   100.00    97.80   -0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.885        1    8.885    8.885    8.885    8.885        .   506.27   435.11        .
  base                     2.042        1    2.042    2.042    2.042    2.042        .   116.35   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.05        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.06     0.05        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.753        1    1.753    1.753    1.753    1.753        .    99.89    85.85        .
  total                    1.755        1    1.755    1.755    1.755    1.755        .   100.00    85.95   -0.287
-------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  28 Oct 2024, 15:16:56
----------------------------------------------------------------------------------------------------------------------------------------
