---------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  24 Sep 2024, 16:24:13

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.402     1000    0.000    0.000    0.000    0.004    0.001     8.00   100.00        .
  init                0.609     1000    0.000    0.001    0.001    0.003    0.001    12.11   151.49        .
  parse               0.801     1000    0.000    0.001    0.001    0.003    0.000    15.93   199.25        .
  check               3.141     1000    0.002    0.003    0.003    0.032    0.001    62.47   781.34        .
  eval                0.439     1000    0.000    0.000    0.000    0.009    0.001     8.73   109.20        .
  total               5.028     1000    0.004    0.005    0.005    0.034    0.001   100.00  1250.75    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.895     1000    0.002    0.003    0.003    0.006    0.001    38.15   100.00        .
  init                0.947     1000    0.000    0.001    0.001    0.004    0.000    12.48    32.71        .
  parse               0.773     1000    0.000    0.001    0.001    0.002    0.000    10.19    26.70        .
  check               2.908     1000    0.002    0.003    0.003    0.009    0.001    38.32   100.45        .
  eval                2.912     1000    0.002    0.003    0.003    0.007    0.001    38.37   100.59        .
  total               7.589     1000    0.006    0.008    0.007    0.014    0.001   100.00   262.14    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.771      100    0.026    0.028    0.027    0.032    0.001    73.56   100.00        .
  init                0.547      100    0.005    0.005    0.005    0.007    0.001    14.52    19.74        .
  parse               0.082      100    0.000    0.001    0.001    0.002    0.000     2.18     2.96        .
  check               0.286      100    0.002    0.003    0.003    0.004    0.001     7.59    10.32        .
  eval                2.846      100    0.026    0.028    0.028    0.033    0.001    75.55   102.71        .
  total               3.767      100    0.035    0.038    0.037    0.044    0.002   100.00   135.94    0.010
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                3.334       10    0.277    0.333    0.283    0.478    0.078    78.99   100.00        .
  init                0.580       10    0.047    0.058    0.050    0.084    0.014    13.74    17.40        .
  parse               0.009       10    0.000    0.001    0.001    0.002    0.001     0.21     0.27        .
  check               0.039       10    0.003    0.004    0.003    0.007    0.001     0.92     1.17        .
  eval                3.592       10    0.276    0.359    0.302    0.472    0.089    85.10   107.74        .
  total               4.221       10    0.330    0.422    0.356    0.562    0.101   100.00   126.60    0.089
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                4.612        1    4.612    4.612    4.612    4.612        .    89.19   100.00        .
  init                0.773        1    0.773    0.773    0.773    0.773        .    14.95    16.76        .
  parse               0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.02        .
  check               0.003        1    0.003    0.003    0.003    0.003        .     0.06     0.07        .
  eval                4.394        1    4.394    4.394    4.394    4.394        .    84.97    95.27        .
  total               5.171        1    5.171    5.171    5.171    5.171        .   100.00   112.12    0.559
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.511     1000    0.000    0.001    0.001    0.002    0.001     7.64   100.00        .
  init                1.670     1000    0.000    0.002    0.002    0.005    0.001    24.96   326.81        .
  parse               1.389     1000    0.000    0.001    0.001    0.004    0.001    20.76   271.82        .
  check               2.765     1000    0.001    0.003    0.003    0.008    0.001    41.33   541.10        .
  eval                0.793     1000    0.000    0.001    0.001    0.004    0.001    11.85   155.19        .
  total               6.690     1000    0.003    0.007    0.007    0.014    0.002   100.00  1309.20    0.006
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                5.722     1000    0.002    0.006    0.006    0.012    0.002    35.50   100.00        .
  init                6.548     1000    0.003    0.007    0.006    0.016    0.002    40.62   114.44        .
  parse               1.083     1000    0.000    0.001    0.001    0.004    0.001     6.72    18.93        .
  check               2.672     1000    0.001    0.003    0.002    0.009    0.001    16.58    46.70        .
  eval                5.754     1000    0.002    0.006    0.006    0.015    0.002    35.69   100.56        .
  total              16.120     1000    0.008    0.016    0.016    0.028    0.004   100.00   281.72    0.010
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                4.487      100    0.032    0.045    0.044    0.061    0.007    31.93   100.00        .
  init                8.917      100    0.058    0.089    0.087    0.124    0.014    63.46   198.73        .
  parse               0.127      100    0.000    0.001    0.001    0.003    0.001     0.90     2.83        .
  check               0.268      100    0.001    0.003    0.002    0.007    0.001     1.91     5.97        .
  eval                4.731      100    0.033    0.047    0.048    0.067    0.007    33.67   105.44        .
  total              14.051      100    0.110    0.141    0.139    0.185    0.017   100.00   313.15    0.096
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                4.563       10    0.411    0.456    0.444    0.498    0.031    41.76   100.00        .
  init                6.221       10    0.534    0.622    0.621    0.706    0.048    56.93   136.34        .
  parse               0.013       10    0.001    0.001    0.001    0.002    0.000     0.12     0.28        .
  check               0.025       10    0.001    0.003    0.003    0.004    0.001     0.23     0.55        .
  eval                4.668       10    0.424    0.467    0.458    0.533    0.031    42.72   102.30        .
  total              10.927       10    0.994    1.093    1.104    1.169    0.052   100.00   239.47    0.636
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                4.213        1    4.213    4.213    4.213    4.213        .    45.42   100.00        .
  init                5.350        1    5.350    5.350    5.350    5.350        .    57.68   126.99        .
  parse               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.02        .
  check               0.004        1    0.004    0.004    0.004    0.004        .     0.04     0.09        .
  eval                3.920        1    3.920    3.920    3.920    3.920        .    42.26    93.05        .
  total               9.275        1    9.275    9.275    9.275    9.275        .   100.00   220.15    5.062
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.413     1000    0.000    0.000    0.000    0.002    0.001     6.46   100.00        .
  init                0.868     1000    0.000    0.001    0.001    0.009    0.001    13.57   210.17        .
  parse               0.860     1000    0.000    0.001    0.001    0.004    0.001    13.45   208.23        .
  check               4.158     1000    0.002    0.004    0.004    0.019    0.002    65.02  1006.78        .
  eval                0.474     1000    0.000    0.000    0.000    0.002    0.001     7.41   114.77        .
  total               6.395     1000    0.004    0.006    0.006    0.022    0.002   100.00  1548.43    0.006
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                3.222     1000    0.002    0.003    0.003    0.009    0.001    22.50   100.00        .
  init                6.557     1000    0.004    0.007    0.006    0.020    0.002    45.80   203.51        .
  parse               0.803     1000    0.000    0.001    0.001    0.005    0.001     5.61    24.92        .
  check               3.772     1000    0.002    0.004    0.003    0.013    0.001    26.35   117.07        .
  eval                3.149     1000    0.002    0.003    0.003    0.010    0.001    21.99    97.73        .
  total              14.317     1000    0.010    0.014    0.014    0.040    0.003   100.00   444.35    0.011
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.680      100    0.022    0.027    0.026    0.039    0.003    20.27   100.00        .
  init                9.966      100    0.080    0.100    0.097    0.191    0.018    75.39   371.87        .
  parse               0.072      100    0.000    0.001    0.001    0.002    0.001     0.54     2.69        .
  check               0.347      100    0.002    0.003    0.003    0.008    0.001     2.62    12.95        .
  eval                2.832      100    0.023    0.028    0.028    0.047    0.004    21.42   105.67        .
  total              13.220      100    0.109    0.132    0.129    0.229    0.020   100.00   493.28    0.105
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.610       10    0.249    0.261    0.262    0.270    0.008    30.56   100.00        .
  init                5.779       10    0.558    0.578    0.573    0.616    0.017    67.67   221.42        .
  parse               0.010       10    0.000    0.001    0.001    0.002    0.000     0.12     0.38        .
  check               0.040       10    0.003    0.004    0.003    0.006    0.001     0.47     1.53        .
  eval                2.710       10    0.251    0.271    0.268    0.287    0.010    31.73   103.83        .
  total               8.540       10    0.816    0.854    0.852    0.904    0.024   100.00   327.20    0.593
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.744        1    2.744    2.744    2.744    2.744        .    32.13   100.00        .
  init                5.788        1    5.788    5.788    5.788    5.788        .    67.78   210.93        .
  parse               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check               0.003        1    0.003    0.003    0.003    0.003        .     0.04     0.11        .
  eval                2.748        1    2.748    2.748    2.748    2.748        .    32.18   100.15        .
  total               8.539        1    8.539    8.539    8.539    8.539        .   100.00   311.19    5.795
--------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.171      100    0.001    0.002    0.001    0.007    0.001     1.11   100.00        .
  init                0.094      100    0.000    0.001    0.001    0.003    0.001     0.61    54.97        .
  parse               0.447      100    0.003    0.004    0.004    0.010    0.001     2.89   261.40        .
  check              14.699      100    0.131    0.147    0.146    0.175    0.008    95.11  8595.91        .
  eval                0.210      100    0.001    0.002    0.002    0.005    0.001     1.36   122.81        .
  total              15.455      100    0.138    0.155    0.153    0.182    0.009   100.00  9038.01    0.153
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.383      100    0.010    0.014    0.013    0.023    0.002     8.17   100.00        .
  init                0.203      100    0.001    0.002    0.002    0.005    0.001     1.20    14.68        .
  parse               0.402      100    0.003    0.004    0.004    0.008    0.001     2.38    29.07        .
  check              14.824      100    0.134    0.148    0.148    0.167    0.008    87.62  1071.87        .
  eval                1.481      100    0.011    0.015    0.014    0.024    0.003     8.75   107.09        .
  total              16.918      100    0.153    0.169    0.169    0.193    0.008   100.00  1223.28    0.155
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.391       10    0.124    0.139    0.137    0.151    0.009    43.80   100.00        .
  init                0.170       10    0.014    0.017    0.016    0.024    0.003     5.35    12.22        .
  parse               0.044       10    0.003    0.004    0.004    0.008    0.002     1.39     3.16        .
  check               1.493       10    0.139    0.149    0.147    0.163    0.007    47.01   107.33        .
  eval                1.468       10    0.134    0.147    0.143    0.179    0.013    46.22   105.54        .
  total               3.176       10    0.301    0.318    0.313    0.363    0.017   100.00   228.32    0.178
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.389        1    1.389    1.389    1.389    1.389        .    82.83   100.00        .
  init                0.150        1    0.150    0.150    0.150    0.150        .     8.94    10.80        .
  parse               0.007        1    0.007    0.007    0.007    0.007        .     0.42     0.50        .
  check               0.139        1    0.139    0.139    0.139    0.139        .     8.29    10.01        .
  eval                1.381        1    1.381    1.381    1.381    1.381        .    82.35    99.42        .
  total               1.677        1    1.677    1.677    1.677    1.677        .   100.00   120.73    0.288
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               13.893        1   13.893   13.893   13.893   13.893        .    89.81   100.00        .
  init                1.503        1    1.503    1.503    1.503    1.503        .     9.72    10.82        .
  parse               0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.02        .
  check               0.154        1    0.154    0.154    0.154    0.154        .     1.00     1.11        .
  eval               13.810        1   13.810   13.810   13.810   13.810        .    89.27    99.40        .
  total              15.470        1   15.470   15.470   15.470   15.470        .   100.00   111.35    1.577
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.178      100    0.001    0.002    0.002    0.006    0.001     5.97   100.00        .
  init                0.128      100    0.000    0.001    0.001    0.004    0.001     4.29    71.91        .
  parse               0.379      100    0.002    0.004    0.003    0.007    0.001    12.71   212.92        .
  check               2.259      100    0.019    0.023    0.022    0.045    0.003    75.75  1269.10        .
  eval                0.212      100    0.001    0.002    0.002    0.006    0.001     7.11   119.10        .
  total               2.982      100    0.024    0.030    0.029    0.060    0.004   100.00  1675.28    0.028
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.422      100    0.011    0.014    0.013    0.022    0.002    30.96   100.00        .
  init                0.414      100    0.003    0.004    0.004    0.008    0.001     9.01    29.11        .
  parse               0.383      100    0.002    0.004    0.004    0.007    0.001     8.34    26.93        .
  check               2.315      100    0.018    0.023    0.023    0.032    0.003    50.40   162.80        .
  eval                1.476      100    0.011    0.015    0.014    0.021    0.002    32.14   103.80        .
  total               4.593      100    0.038    0.046    0.045    0.057    0.004   100.00   323.00    0.032
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.373       10    0.129    0.137    0.136    0.146    0.006    60.86   100.00        .
  init                0.605       10    0.053    0.060    0.060    0.065    0.004    26.82    44.06        .
  parse               0.040       10    0.003    0.004    0.003    0.008    0.002     1.77     2.91        .
  check               0.230       10    0.019    0.023    0.022    0.028    0.003    10.20    16.75        .
  eval                1.381       10    0.126    0.138    0.138    0.148    0.006    61.21   100.58        .
  total               2.256       10    0.220    0.226    0.224    0.236    0.005   100.00   164.31    0.088
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.364        1    1.364    1.364    1.364    1.364        .    74.33   100.00        .
  init                0.388        1    0.388    0.388    0.388    0.388        .    21.14    28.45        .
  parse               0.005        1    0.005    0.005    0.005    0.005        .     0.27     0.37        .
  check               0.028        1    0.028    0.028    0.028    0.028        .     1.53     2.05        .
  eval                1.414        1    1.414    1.414    1.414    1.414        .    77.06   103.67        .
  total               1.835        1    1.835    1.835    1.835    1.835        .   100.00   134.53    0.471
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               14.198        1   14.198   14.198   14.198   14.198        .    79.99   100.00        .
  init                3.884        1    3.884    3.884    3.884    3.884        .    21.88    27.36        .
  parse               0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.02        .
  check               0.023        1    0.023    0.023    0.023    0.023        .     0.13     0.16        .
  eval               13.839        1   13.839   13.839   13.839   13.839        .    77.97    97.47        .
  total              17.749        1   17.749   17.749   17.749   17.749        .   100.00   125.01    3.551
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.179      100    0.001    0.002    0.002    0.005    0.001     1.04   100.00        .
  init                0.107      100    0.000    0.001    0.001    0.003    0.001     0.62    59.78        .
  parse               0.295      100    0.002    0.003    0.003    0.007    0.001     1.72   164.80        .
  check              16.519      100    0.148    0.165    0.163    0.208    0.011    96.36  9228.49        .
  eval                0.216      100    0.001    0.002    0.002    0.008    0.001     1.26   120.67        .
  total              17.143      100    0.154    0.171    0.170    0.214    0.011   100.00  9577.09    0.170
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.729      100    0.012    0.017    0.017    0.030    0.004     8.91   100.00        .
  init                0.795      100    0.005    0.008    0.008    0.018    0.002     4.10    45.98        .
  parse               0.283      100    0.002    0.003    0.003    0.007    0.001     1.46    16.37        .
  check              16.325      100    0.149    0.163    0.164    0.185    0.008    84.11   944.19        .
  eval                2.000      100    0.014    0.020    0.019    0.033    0.004    10.30   115.67        .
  total              19.409      100    0.176    0.194    0.195    0.215    0.009   100.00  1122.56    0.177
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                3.188       10    0.290    0.319    0.304    0.443    0.045    48.99   100.00        .
  init                1.650       10    0.145    0.165    0.156    0.215    0.021    25.36    51.76        .
  parse               0.031       10    0.002    0.003    0.002    0.006    0.001     0.48     0.97        .
  check               1.671       10    0.158    0.167    0.162    0.195    0.011    25.68    52.42        .
  eval                3.155       10    0.287    0.316    0.309    0.347    0.017    48.49    98.96        .
  total               6.507       10    0.600    0.651    0.638    0.721    0.034   100.00   204.11    0.332
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.506        1    1.506    1.506    1.506    1.506        .    63.81   100.00        .
  init                0.621        1    0.621    0.621    0.621    0.621        .    26.31    41.24        .
  parse               0.002        1    0.002    0.002    0.002    0.002        .     0.08     0.13        .
  check               0.198        1    0.198    0.198    0.198    0.198        .     8.39    13.15        .
  eval                1.539        1    1.539    1.539    1.539    1.539        .    65.21   102.19        .
  total               2.360        1    2.360    2.360    2.360    2.360        .   100.00   156.71    0.854
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               14.097        1   14.097   14.097   14.097   14.097        .    66.57   100.00        .
  init                6.180        1    6.180    6.180    6.180    6.180        .    29.18    43.84        .
  parse               0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.01        .
  check               0.167        1    0.167    0.167    0.167    0.167        .     0.79     1.18        .
  eval               14.827        1   14.827   14.827   14.827   14.827        .    70.02   105.18        .
  total              21.176        1   21.176   21.176   21.176   21.176        .   100.00   150.22    7.079
--------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.125       10    0.010    0.013    0.011    0.017    0.003     0.15   100.00        .
  init                0.009       10    0.000    0.001    0.001    0.001    0.000     0.01     7.20        .
  parse               1.864       10    0.150    0.186    0.186    0.208    0.016     2.18  1491.20        .
  check              83.393       10    7.701    8.339    8.327    8.797    0.336    97.57 66714.40        .
  eval                0.195       10    0.014    0.019    0.017    0.043    0.008     0.23   156.00        .
  total              85.469       10    7.871    8.547    8.544    9.020    0.345   100.00 68375.20    8.534
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.104       10    0.104    0.110    0.106    0.125    0.007     0.81   100.00        .
  init                0.019       10    0.001    0.002    0.002    0.003    0.001     0.01     1.72        .
  parse               1.885       10    0.155    0.189    0.190    0.207    0.015     1.39   170.74        .
  check             132.536       10   13.097   13.254   13.173   13.679    0.189    97.73 12005.07        .
  eval                1.163       10    0.098    0.116    0.113    0.125    0.008     0.86   105.34        .
  total             135.613       10   13.413   13.561   13.492   13.998    0.191   100.00 12283.79   13.451
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.127        1    1.127    1.127    1.127    1.127        .     7.69   100.00        .
  init                0.013        1    0.013    0.013    0.013    0.013        .     0.09     1.15        .
  parse               0.189        1    0.189    0.189    0.189    0.189        .     1.29    16.77        .
  check              13.325        1   13.325   13.325   13.325   13.325        .    90.97  1182.34        .
  eval                1.119        1    1.119    1.119    1.119    1.119        .     7.64    99.29        .
  total              14.647        1   14.647   14.647   14.647   14.647        .   100.00  1299.65   13.520
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               11.798        1   11.798   11.798   11.798   11.798        .    48.01   100.00        .
  init                0.150        1    0.150    0.150    0.150    0.150        .     0.61     1.27        .
  parse               0.153        1    0.153    0.153    0.153    0.153        .     0.62     1.30        .
  check              12.989        1   12.989   12.989   12.989   12.989        .    52.86   110.09        .
  eval               11.280        1   11.280   11.280   11.280   11.280        .    45.91    95.61        .
  total              24.572        1   24.572   24.572   24.572   24.572        .   100.00   208.27   12.774
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base              115.443        1  115.443  115.443  115.443  115.443        .    87.37   100.00        .
  init                1.866        1    1.866    1.866    1.866    1.866        .     1.41     1.62        .
  parse               0.165        1    0.165    0.165    0.165    0.165        .     0.12     0.14        .
  check              13.470        1   13.470   13.470   13.470   13.470        .    10.19    11.67        .
  eval              116.631        1  116.631  116.631  116.631  116.631        .    88.27   101.03        .
  total             132.132        1  132.132  132.132  132.132  132.132        .   100.00   114.46   16.689
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.120       10    0.011    0.012    0.011    0.014    0.001     0.56   100.00        .
  init                0.012       10    0.001    0.001    0.001    0.002    0.000     0.06    10.00        .
  parse               1.897       10    0.174    0.190    0.188    0.215    0.012     8.84  1580.83        .
  check              19.369       10    1.866    1.937    1.909    2.057    0.067    90.28 16140.83        .
  eval                0.170       10    0.014    0.017    0.017    0.021    0.002     0.79   141.67        .
  total              21.454       10    2.064    2.145    2.110    2.272    0.072   100.00 17878.33    2.133
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.393       10    0.123    0.139    0.135    0.173    0.015     6.00   100.00        .
  init                0.058       10    0.004    0.006    0.005    0.009    0.001     0.25     4.16        .
  parse               1.998       10    0.179    0.200    0.193    0.279    0.029     8.61   143.43        .
  check              19.527       10    1.874    1.953    1.933    2.076    0.063    84.11  1401.79        .
  eval                1.625       10    0.139    0.163    0.155    0.239    0.028     7.00   116.65        .
  total              23.216       10    2.221    2.322    2.285    2.530    0.101   100.00  1666.62    2.182
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                3.379        1    3.379    3.379    3.379    3.379        .    58.18   100.00        .
  init                0.104        1    0.104    0.104    0.104    0.104        .     1.79     3.08        .
  parse               0.190        1    0.190    0.190    0.190    0.190        .     3.27     5.62        .
  check               1.890        1    1.890    1.890    1.890    1.890        .    32.54    55.93        .
  eval                3.623        1    3.623    3.623    3.623    3.623        .    62.38   107.22        .
  total               5.808        1    5.808    5.808    5.808    5.808        .   100.00   171.89    2.429
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               12.300        1   12.300   12.300   12.300   12.300        .    87.24   100.00        .
  init                0.389        1    0.389    0.389    0.389    0.389        .     2.76     3.16        .
  parse               0.179        1    0.179    0.179    0.179    0.179        .     1.27     1.46        .
  check               1.771        1    1.771    1.771    1.771    1.771        .    12.56    14.40        .
  eval               11.759        1   11.759   11.759   11.759   11.759        .    83.40    95.60        .
  total              14.099        1   14.099   14.099   14.099   14.099        .   100.00   114.63    1.799
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base              118.154        1  118.154  118.154  118.154  118.154        .    97.63   100.00        .
  init                4.225        1    4.225    4.225    4.225    4.225        .     3.49     3.58        .
  parse               0.191        1    0.191    0.191    0.191    0.191        .     0.16     0.16        .
  check               1.953        1    1.953    1.953    1.953    1.953        .     1.61     1.65        .
  eval              114.652        1  114.652  114.652  114.652  114.652        .    94.74    97.04        .
  total             121.021        1  121.021  121.021  121.021  121.021        .   100.00   102.43    2.867
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.132       10    0.011    0.013    0.012    0.019    0.002     0.16   100.00        .
  init                0.010       10    0.001    0.001    0.001    0.001    0.000     0.01     7.58        .
  parse               0.897       10    0.077    0.090    0.085    0.116    0.011     1.10   679.55        .
  check              80.726       10    7.804    8.073    8.067    8.247    0.146    98.67 61156.06        .
  eval                0.177       10    0.014    0.018    0.017    0.028    0.004     0.22   134.09        .
  total              81.815       10    7.940    8.181    8.168    8.362    0.142   100.00 61981.06    8.168
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.383       10    0.123    0.138    0.135    0.163    0.012     0.90   100.00        .
  init                0.101       10    0.008    0.010    0.009    0.014    0.002     0.07     7.30        .
  parse               0.916       10    0.083    0.092    0.086    0.111    0.010     0.60    66.23        .
  check             150.307       10   14.520   15.031   14.729   16.311    0.581    98.27 10868.19        .
  eval                1.620       10    0.146    0.162    0.163    0.173    0.008     1.06   117.14        .
  total             152.950       10   14.764   15.295   14.996   16.595    0.586   100.00 11059.29   15.157
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.534        1    1.534    1.534    1.534    1.534        .     9.10   100.00        .
  init                0.146        1    0.146    0.146    0.146    0.146        .     0.87     9.52        .
  parse               0.097        1    0.097    0.097    0.097    0.097        .     0.58     6.32        .
  check              15.319        1   15.319   15.319   15.319   15.319        .    90.89   998.63        .
  eval                1.292        1    1.292    1.292    1.292    1.292        .     7.67    84.22        .
  total              16.855        1   16.855   16.855   16.855   16.855        .   100.00  1098.76   15.321
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               12.242        1   12.242   12.242   12.242   12.242        .    43.42   100.00        .
  init                0.732        1    0.732    0.732    0.732    0.732        .     2.60     5.98        .
  parse               0.084        1    0.084    0.084    0.084    0.084        .     0.30     0.69        .
  check              14.775        1   14.775   14.775   14.775   14.775        .    52.40   120.69        .
  eval               12.604        1   12.604   12.604   12.604   12.604        .    44.70   102.96        .
  total              28.195        1   28.195   28.195   28.195   28.195        .   100.00   230.31   15.953
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base              120.689        1  120.689  120.689  120.689  120.689        .    84.51   100.00        .
  init                6.362        1    6.362    6.362    6.362    6.362        .     4.45     5.27        .
  parse               0.066        1    0.066    0.066    0.066    0.066        .     0.05     0.05        .
  check              13.982        1   13.982   13.982   13.982   13.982        .     9.79    11.59        .
  eval              122.397        1  122.397  122.397  122.397  122.397        .    85.71   101.42        .
  total             142.807        1  142.807  142.807  142.807  142.807        .   100.00   118.33   22.118
--------------------------------------------------------------------------------------------------------------

. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.472     1000    0.000    0.000    0.000    0.002    0.001    27.25   100.00        .
  init                0.112     1000    0.000    0.000    0.000    0.001    0.000     6.47    23.73        .
  parse               1.004     1000    0.000    0.001    0.001    0.005    0.001    57.97   212.71        .
  check               0.007     1000    0.000    0.000    0.000    0.001    0.000     0.40     1.48        .
  eval                0.575     1000    0.000    0.001    0.001    0.002    0.001    33.20   121.82        .
  total               1.732     1000    0.001    0.002    0.002    0.006    0.001   100.00   366.95    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                4.288     1000    0.002    0.004    0.004    0.011    0.002    87.90   100.00        .
  init                0.121     1000    0.000    0.000    0.000    0.001    0.000     2.48     2.82        .
  parse               0.922     1000    0.000    0.001    0.001    0.003    0.001    18.90    21.50        .
  check               0.004     1000    0.000    0.000    0.000    0.001    0.000     0.08     0.09        .
  eval                3.796     1000    0.002    0.004    0.003    0.013    0.001    77.82    88.53        .
  total               4.878     1000    0.003    0.005    0.004    0.015    0.002   100.00   113.76    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                7.361      100    0.062    0.074    0.072    0.098    0.008    97.10   100.00        .
  init                0.014      100    0.000    0.000    0.000    0.001    0.000     0.18     0.19        .
  parse               0.094      100    0.000    0.001    0.001    0.002    0.001     1.24     1.28        .
  check               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                7.467      100    0.063    0.075    0.073    0.103    0.008    98.50   101.44        .
  total               7.581      100    0.064    0.076    0.074    0.104    0.008   100.00   102.99    0.002
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                3.310       10    0.306    0.331    0.336    0.352    0.017   101.07   100.00        .
  init                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  parse               0.009       10    0.000    0.001    0.001    0.002    0.001     0.27     0.27        .
  check               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                3.266       10    0.291    0.327    0.324    0.380    0.025    99.73    98.67        .
  total               3.275       10    0.292    0.328    0.325    0.381    0.026   100.00    98.94   -0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                3.309        1    3.309    3.309    3.309    3.309        .   106.98   100.00        .
  init                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse               0.002        1    0.002    0.002    0.002    0.002        .     0.06     0.06        .
  check               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                3.091        1    3.091    3.091    3.091    3.091        .    99.94    93.41        .
  total               3.093        1    3.093    3.093    3.093    3.093        .   100.00    93.47   -0.216
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.579     1000    0.000    0.001    0.001    0.004    0.001    30.70   100.00        .
  init                0.119     1000    0.000    0.000    0.000    0.001    0.000     6.31    20.55        .
  parse               1.081     1000    0.000    0.001    0.001    0.003    0.001    57.32   186.70        .
  check               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.32     1.04        .
  eval                0.636     1000    0.000    0.001    0.001    0.002    0.001    33.72   109.84        .
  total               1.886     1000    0.001    0.002    0.002    0.006    0.001   100.00   325.73    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                4.000     1000    0.002    0.004    0.003    0.011    0.002    86.69   100.00        .
  init                0.108     1000    0.000    0.000    0.000    0.001    0.000     2.34     2.70        .
  parse               0.948     1000    0.000    0.001    0.001    0.006    0.001    20.55    23.70        .
  check               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.11     0.13        .
  eval                3.519     1000    0.002    0.004    0.003    0.013    0.001    76.27    87.98        .
  total               4.614     1000    0.003    0.005    0.004    0.014    0.001   100.00   115.35    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                3.051      100    0.025    0.031    0.028    0.056    0.006    89.11   100.00        .
  init                0.009      100    0.000    0.000    0.000    0.001    0.000     0.26     0.29        .
  parse               0.079      100    0.000    0.001    0.001    0.003    0.001     2.31     2.59        .
  check               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                3.334      100    0.025    0.033    0.032    0.056    0.007    97.37   109.28        .
  total               3.424      100    0.026    0.034    0.033    0.057    0.007   100.00   112.23    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                3.115       10    0.285    0.311    0.310    0.346    0.017    98.48   100.00        .
  init                0.002       10    0.000    0.000    0.000    0.001    0.000     0.06     0.06        .
  parse               0.005       10    0.000    0.001    0.000    0.001    0.001     0.16     0.16        .
  check               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                3.155       10    0.302    0.316    0.309    0.352    0.015    99.75   101.28        .
  total               3.163       10    0.303    0.316    0.310    0.353    0.015   100.00   101.54    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                3.103        1    3.103    3.103    3.103    3.103        .    94.03   100.00        .
  init                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                3.300        1    3.300    3.300    3.300    3.300        .   100.00   106.35        .
  total               3.300        1    3.300    3.300    3.300    3.300        .   100.00   106.35    0.197
--------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.386     1000    0.000    0.000    0.000    0.034    0.001    27.79   100.00        .
  init                0.122     1000    0.000    0.000    0.000    0.001    0.000     8.78    31.61        .
  parse               0.755     1000    0.000    0.001    0.001    0.002    0.001    54.36   195.60        .
  check               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.36     1.30        .
  eval                0.469     1000    0.000    0.000    0.000    0.007    0.001    33.77   121.50        .
  total               1.389     1000    0.000    0.001    0.001    0.009    0.001   100.00   359.84    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                3.331     1000    0.002    0.003    0.003    0.010    0.001    80.91   100.00        .
  init                0.125     1000    0.000    0.000    0.000    0.001    0.000     3.04     3.75        .
  parse               0.787     1000    0.000    0.001    0.001    0.006    0.001    19.12    23.63        .
  check               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.15     0.18        .
  eval                3.164     1000    0.002    0.003    0.003    0.009    0.001    76.85    94.99        .
  total               4.117     1000    0.002    0.004    0.004    0.015    0.001   100.00   123.60    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.676      100    0.022    0.027    0.025    0.040    0.005    94.63   100.00        .
  init                0.011      100    0.000    0.000    0.000    0.001    0.000     0.39     0.41        .
  parse               0.058      100    0.000    0.001    0.001    0.001    0.000     2.05     2.17        .
  check               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                2.756      100    0.022    0.028    0.026    0.044    0.005    97.45   102.99        .
  total               2.828      100    0.023    0.028    0.026    0.045    0.005   100.00   105.68    0.002
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.466       10    0.235    0.247    0.246    0.262    0.008    97.86   100.00        .
  init                0.003       10    0.000    0.000    0.000    0.001    0.000     0.12     0.12        .
  parse               0.004       10    0.000    0.000    0.000    0.001    0.001     0.16     0.16        .
  check               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                2.513       10    0.242    0.251    0.249    0.261    0.006    99.72   101.91        .
  total               2.520       10    0.243    0.252    0.250    0.262    0.006   100.00   102.19    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.458        1    2.458    2.458    2.458    2.458        .    98.71   100.00        .
  init                0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  parse               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                2.489        1    2.489    2.489    2.489    2.489        .    99.96   101.26        .
  total               2.490        1    2.490    2.490    2.490    2.490        .   100.00   101.30    0.032
--------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  24 Sep 2024, 16:59:16
---------------------------------------------------------------------------------------------------------------------------
