---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  19 Aug 2024, 11:50:33

. 
. dis "`c(current_date)'"
19 Aug 2024

. dis "`c(current_time)'"
11:50:33

. 
. profile_obs_integer, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.427     1000    0.000    0.000    0.000    0.005    0.001     4.38   100.00        .
        init          0.389     1000    0.000    0.000    0.000    0.004    0.001     3.99    91.10        .
       parse          1.234     1000    0.000    0.001    0.001    0.007    0.001    12.67   288.99        .
       check          6.750     1000    0.002    0.007    0.008    0.016    0.003    69.29  1580.80        .
        eval          1.054     1000    0.000    0.001    0.001    0.050    0.002    10.82   246.84        .
       total          9.742     1000    0.004    0.010    0.012    0.057    0.004   100.00  2281.50    0.009
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.880     1000    0.003    0.005    0.005    0.014    0.001    20.71   100.00        .
        init          4.108     1000    0.002    0.004    0.004    0.009    0.001    17.44    84.18        .
       parse          1.699     1000    0.001    0.002    0.002    0.005    0.001     7.21    34.82        .
       check          8.910     1000    0.006    0.009    0.009    0.015    0.001    37.82   182.58        .
        eval          8.423     1000    0.006    0.008    0.008    0.020    0.001    35.75   172.60        .
       total         23.559     1000    0.019    0.024    0.023    0.040    0.002   100.00   482.77    0.019
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          5.556      100    0.043    0.056    0.057    0.080    0.008    43.02   100.00        .
        init          4.470      100    0.038    0.045    0.044    0.065    0.004    34.61    80.45        .
       parse          0.182      100    0.001    0.002    0.002    0.003    0.000     1.41     3.28        .
       check          0.903      100    0.007    0.009    0.009    0.014    0.001     6.99    16.25        .
        eval          7.319      100    0.062    0.073    0.074    0.086    0.007    56.67   131.73        .
       total         12.916      100    0.112    0.129    0.131    0.161    0.010   100.00   232.47    0.074
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.175       10    0.400    0.417    0.418    0.429    0.008    43.44   100.00        .
        init          3.608       10    0.345    0.361    0.362    0.375    0.008    37.54    86.42        .
       parse          0.016       10    0.001    0.002    0.002    0.002    0.001     0.17     0.38        .
       check          0.094       10    0.008    0.009    0.009    0.010    0.001     0.98     2.25        .
        eval          5.885       10    0.569    0.589    0.588    0.612    0.012    61.24   140.96        .
       total          9.610       10    0.925    0.961    0.959    1.000    0.019   100.00   230.18    0.543
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         36.311       10    1.407    3.631    4.144    4.278    1.163    45.58   100.00        .
        init         31.383       10    1.228    3.138    3.571    3.668    0.978    39.40    86.43        .
       parse          0.017       10    0.000    0.002    0.002    0.003    0.001     0.02     0.05        .
       check          0.072       10    0.002    0.007    0.008    0.009    0.003     0.09     0.20        .
        eval         48.182       10    1.991    4.818    5.793    5.872    1.656    60.48   132.69        .
       total         79.660       10    3.222    7.966    9.371    9.551    2.566   100.00   219.38    4.335
---------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.170     1000    0.000    0.000    0.000    0.001    0.000     4.12   100.00        .
        init          0.061     1000    0.000    0.000    0.000    0.001    0.000     1.48    35.88        .
       parse          0.524     1000    0.000    0.001    0.001    0.003    0.001    12.69   308.24        .
       check          2.990     1000    0.002    0.003    0.003    0.006    0.001    72.43  1758.82        .
        eval          0.410     1000    0.000    0.000    0.000    0.003    0.001     9.93   241.18        .
       total          4.128     1000    0.003    0.004    0.004    0.008    0.001   100.00  2428.24    0.004
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.793     1000    0.001    0.002    0.002    0.004    0.001    24.43   100.00        .
        init          0.270     1000    0.000    0.000    0.000    0.003    0.000     3.68    15.06        .
       parse          0.567     1000    0.000    0.001    0.001    0.003    0.001     7.73    31.62        .
       check          3.094     1000    0.002    0.003    0.003    0.007    0.001    42.16   172.56        .
        eval          3.253     1000    0.002    0.003    0.003    0.007    0.001    44.33   181.43        .
       total          7.338     1000    0.006    0.007    0.007    0.013    0.001   100.00   409.26    0.006
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.725      100    0.015    0.017    0.017    0.021    0.001    48.52   100.00        .
        init          0.328      100    0.003    0.003    0.003    0.004    0.000     9.23    19.01        .
       parse          0.065      100    0.000    0.001    0.001    0.001    0.000     1.83     3.77        .
       check          0.302      100    0.002    0.003    0.003    0.005    0.000     8.50    17.51        .
        eval          2.844      100    0.026    0.028    0.027    0.042    0.002    80.00   164.87        .
       total          3.555      100    0.033    0.036    0.035    0.048    0.002   100.00   206.09    0.018
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.481       10    0.140    0.148    0.146    0.159    0.006    53.66   100.00        .
        init          0.138       10    0.013    0.014    0.013    0.016    0.001     5.00     9.32        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.25     0.47        .
       check          0.030       10    0.003    0.003    0.003    0.003    0.000     1.09     2.03        .
        eval          2.581       10    0.246    0.258    0.254    0.281    0.011    93.51   174.27        .
       total          2.760       10    0.263    0.276    0.272    0.299    0.011   100.00   186.36    0.128
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         37.028       10    1.498    3.703    4.199    4.339    1.127    54.14   100.00        .
        init          3.844       10    0.139    0.384    0.401    0.660    0.149     5.62    10.38        .
       parse          0.012       10    0.000    0.001    0.001    0.002    0.001     0.02     0.03        .
       check          0.074       10    0.003    0.007    0.008    0.009    0.002     0.11     0.20        .
        eval         64.458       10    2.758    6.446    7.319    7.495    1.941    94.25   174.08        .
       total         68.393       10    2.910    6.839    7.745    8.076    2.072   100.00   184.71    3.136
---------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.480     1000    0.000    0.000    0.000    0.002    0.001     5.22   100.00        .
        init          1.270     1000    0.000    0.001    0.001    0.003    0.000    13.82   264.58        .
       parse          1.311     1000    0.000    0.001    0.001    0.006    0.001    14.27   273.13        .
       check          5.055     1000    0.003    0.005    0.005    0.011    0.001    55.02  1053.13        .
        eval          1.157     1000    0.000    0.001    0.001    0.009    0.000    12.59   241.04        .
       total          9.187     1000    0.005    0.009    0.009    0.017    0.001   100.00  1913.96    0.009
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.066     1000    0.002    0.004    0.004    0.008    0.001    14.68   100.00        .
        init         12.823     1000    0.009    0.013    0.013    0.019    0.001    46.29   315.37        .
       parse          1.516     1000    0.001    0.002    0.002    0.006    0.001     5.47    37.28        .
       check          5.141     1000    0.004    0.005    0.005    0.010    0.001    18.56   126.44        .
        eval          7.777     1000    0.006    0.008    0.008    0.013    0.001    28.07   191.27        .
       total         27.702     1000    0.023    0.028    0.028    0.036    0.001   100.00   681.31    0.024
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.041      100    0.037    0.040    0.040    0.051    0.002    16.86   100.00        .
        init         15.815      100    0.148    0.158    0.158    0.172    0.005    65.99   391.36        .
       parse          0.176      100    0.001    0.002    0.002    0.005    0.001     0.73     4.36        .
       check          0.520      100    0.004    0.005    0.005    0.007    0.001     2.17    12.87        .
        eval          7.411      100    0.070    0.074    0.074    0.089    0.003    30.93   183.40        .
       total         23.964      100    0.226    0.240    0.239    0.266    0.007   100.00   593.02    0.199
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.972       10    0.385    0.397    0.391    0.429    0.013    11.25   100.00        .
        init         27.962       10    2.697    2.796    2.798    2.879    0.068    79.20   703.98        .
       parse          0.016       10    0.001    0.002    0.002    0.002    0.001     0.05     0.40        .
       check          0.052       10    0.005    0.005    0.005    0.006    0.000     0.15     1.31        .
        eval          7.271       10    0.709    0.727    0.723    0.752    0.014    20.60   183.06        .
       total         35.304       10    3.427    3.530    3.541    3.617    0.067   100.00   888.82    3.133
---------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         21.712       10    1.319    2.171    1.346    4.196    1.332     6.95   100.00        .
        init        278.009       10   21.002   27.801   21.636   51.982   11.360    88.99  1280.44        .
       parse          0.010       10    0.000    0.001    0.001    0.002    0.000     0.00     0.05        .
       check          0.027       10    0.002    0.003    0.002    0.006    0.001     0.01     0.12        .
        eval         34.367       10    2.435    3.437    2.457    7.440    2.052    11.00   158.29        .
       total        312.418       10   23.510   31.242   24.084   59.205   13.325   100.00  1438.92   29.071
---------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  19 Aug 2024, 12:05:13
---------------------------------------------------------------------------------------------------------------------------------------
