------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  24 Sep 2024, 20:30:08

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.305     1000    0.000    0.000    0.000    0.001    0.000     7.12   100.00        .
  init                0.528     1000    0.000    0.001    0.001    0.003    0.001    12.33   173.11        .
  parse               0.696     1000    0.000    0.001    0.001    0.002    0.000    16.25   228.20        .
  check               2.659     1000    0.002    0.003    0.003    0.005    0.001    62.10   871.80        .
  eval                0.358     1000    0.000    0.000    0.000    0.005    0.001     8.36   117.38        .
  total               4.282     1000    0.004    0.004    0.004    0.009    0.001   100.00  1403.93    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.657     1000    0.002    0.003    0.003    0.005    0.000    37.78   100.00        .
  init                0.872     1000    0.000    0.001    0.001    0.002    0.000    12.40    32.82        .
  parse               0.703     1000    0.000    0.001    0.001    0.002    0.000    10.00    26.46        .
  check               2.637     1000    0.002    0.003    0.003    0.004    0.000    37.49    99.25        .
  eval                2.790     1000    0.002    0.003    0.003    0.004    0.000    39.67   105.01        .
  total               7.033     1000    0.006    0.007    0.007    0.009    0.000   100.00   264.70    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.929      100    0.028    0.029    0.029    0.034    0.001    76.82   100.00        .
  init                0.524      100    0.005    0.005    0.005    0.007    0.000    13.74    17.89        .
  parse               0.074      100    0.000    0.001    0.001    0.001    0.000     1.94     2.53        .
  check               0.266      100    0.002    0.003    0.003    0.004    0.001     6.98     9.08        .
  eval                2.949      100    0.028    0.029    0.029    0.033    0.001    77.34   100.68        .
  total               3.813      100    0.037    0.038    0.038    0.042    0.001   100.00   130.18    0.009
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.434       10    0.242    0.243    0.243    0.247    0.002    83.56   100.00        .
  init                0.432       10    0.043    0.043    0.043    0.044    0.000    14.83    17.75        .
  parse               0.009       10    0.000    0.001    0.001    0.001    0.000     0.31     0.37        .
  check               0.026       10    0.002    0.003    0.003    0.003    0.001     0.89     1.07        .
  eval                2.446       10    0.242    0.245    0.244    0.249    0.002    83.97   100.49        .
  total               2.913       10    0.289    0.291    0.291    0.295    0.002   100.00   119.68    0.048
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.420        1    2.420    2.420    2.420    2.420        .    84.70   100.00        .
  init                0.425        1    0.425    0.425    0.425    0.425        .    14.88    17.56        .
  parse               0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  check               0.003        1    0.003    0.003    0.003    0.003        .     0.11     0.12        .
  eval                2.428        1    2.428    2.428    2.428    2.428        .    84.98   100.33        .
  total               2.857        1    2.857    2.857    2.857    2.857        .   100.00   118.06    0.437
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.255     1000    0.000    0.000    0.000    0.001    0.000     5.70   100.00        .
  init                0.744     1000    0.000    0.001    0.001    0.002    0.000    16.64   291.76        .
  parse               0.727     1000    0.000    0.001    0.001    0.002    0.000    16.26   285.10        .
  check               2.608     1000    0.002    0.003    0.003    0.004    0.000    58.33  1022.75        .
  eval                0.369     1000    0.000    0.000    0.000    0.002    0.000     8.25   144.71        .
  total               4.471     1000    0.004    0.004    0.004    0.008    0.001   100.00  1753.33    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.517     1000    0.002    0.003    0.003    0.004    0.001    27.11   100.00        .
  init                3.219     1000    0.003    0.003    0.003    0.005    0.000    34.67   127.89        .
  parse               0.683     1000    0.000    0.001    0.001    0.002    0.000     7.36    27.14        .
  check               2.793     1000    0.002    0.003    0.003    0.006    0.000    30.08   110.97        .
  eval                2.556     1000    0.002    0.003    0.003    0.004    0.001    27.53   101.55        .
  total               9.285     1000    0.009    0.009    0.009    0.013    0.001   100.00   368.89    0.007
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.497      100    0.024    0.025    0.025    0.029    0.001    39.46   100.00        .
  init                3.523      100    0.034    0.035    0.035    0.046    0.001    55.67   141.09        .
  parse               0.078      100    0.000    0.001    0.001    0.001    0.000     1.23     3.12        .
  check               0.264      100    0.002    0.003    0.003    0.004    0.001     4.17    10.57        .
  eval                2.459      100    0.024    0.025    0.025    0.026    0.001    38.86    98.48        .
  total               6.328      100    0.062    0.063    0.063    0.074    0.001   100.00   253.42    0.038
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.467       10    0.244    0.247    0.246    0.250    0.002    41.28   100.00        .
  init                3.478       10    0.343    0.348    0.347    0.353    0.003    58.20   140.98        .
  parse               0.008       10    0.000    0.001    0.001    0.001    0.000     0.13     0.32        .
  check               0.029       10    0.002    0.003    0.003    0.004    0.001     0.49     1.18        .
  eval                2.461       10    0.243    0.246    0.246    0.249    0.002    41.18    99.76        .
  total               5.976       10    0.593    0.598    0.597    0.603    0.003   100.00   242.24    0.351
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.477        1    2.477    2.477    2.477    2.477        .    41.51   100.00        .
  init                3.441        1    3.441    3.441    3.441    3.441        .    57.67   138.92        .
  parse               0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  check               0.003        1    0.003    0.003    0.003    0.003        .     0.05     0.12        .
  eval                2.522        1    2.522    2.522    2.522    2.522        .    42.27   101.82        .
  total               5.967        1    5.967    5.967    5.967    5.967        .   100.00   240.90    3.490
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.238     1000    0.000    0.000    0.000    0.001    0.000     5.77   100.00        .
  init                0.531     1000    0.000    0.001    0.001    0.001    0.000    12.88   223.11        .
  parse               0.551     1000    0.000    0.001    0.001    0.002    0.001    13.36   231.51        .
  check               2.743     1000    0.002    0.003    0.003    0.005    0.000    66.51  1152.52        .
  eval                0.265     1000    0.000    0.000    0.000    0.001    0.000     6.43   111.34        .
  total               4.124     1000    0.004    0.004    0.004    0.007    0.000   100.00  1732.77    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.239     1000    0.002    0.002    0.002    0.003    0.000    21.31   100.00        .
  init                4.743     1000    0.004    0.005    0.005    0.009    0.000    45.13   211.84        .
  parse               0.610     1000    0.000    0.001    0.001    0.001    0.000     5.80    27.24        .
  check               2.731     1000    0.002    0.003    0.003    0.004    0.000    25.99   121.97        .
  eval                2.395     1000    0.002    0.002    0.002    0.005    0.000    22.79   106.97        .
  total              10.509     1000    0.010    0.011    0.010    0.016    0.001   100.00   469.36    0.008
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                3.944      100    0.038    0.039    0.039    0.042    0.001    32.19   100.00        .
  init                7.902      100    0.075    0.079    0.079    0.086    0.002    64.49   200.35        .
  parse               0.057      100    0.000    0.001    0.001    0.001    0.000     0.47     1.45        .
  check               0.271      100    0.002    0.003    0.003    0.004    0.000     2.21     6.87        .
  eval                4.017      100    0.038    0.040    0.040    0.046    0.001    32.78   101.85        .
  total              12.253      100    0.118    0.123    0.122    0.130    0.003   100.00   310.67    0.083
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.046       10    0.200    0.205    0.205    0.207    0.002    30.37   100.00        .
  init                4.617       10    0.457    0.462    0.460    0.468    0.004    68.54   225.66        .
  parse               0.007       10    0.000    0.001    0.001    0.001    0.000     0.10     0.34        .
  check               0.030       10    0.002    0.003    0.003    0.004    0.000     0.45     1.47        .
  eval                2.082       10    0.202    0.208    0.208    0.213    0.004    30.91   101.76        .
  total               6.736       10    0.663    0.674    0.674    0.682    0.006   100.00   329.23    0.469
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.036        1    2.036    2.036    2.036    2.036        .    30.65   100.00        .
  init                4.597        1    4.597    4.597    4.597    4.597        .    69.20   225.79        .
  parse               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check               0.003        1    0.003    0.003    0.003    0.003        .     0.05     0.15        .
  eval                2.043        1    2.043    2.043    2.043    2.043        .    30.75   100.34        .
  total               6.643        1    6.643    6.643    6.643    6.643        .   100.00   326.28    4.607
--------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.112      100    0.001    0.001    0.001    0.002    0.000     0.94   100.00        .
  init                0.059      100    0.000    0.001    0.001    0.001    0.000     0.49    52.68        .
  parse               0.314      100    0.003    0.003    0.003    0.004    0.000     2.63   280.36        .
  check              11.406      100    0.112    0.114    0.114    0.122    0.002    95.60 10183.93        .
  eval                0.150      100    0.001    0.002    0.001    0.003    0.001     1.26   133.93        .
  total              11.931      100    0.117    0.119    0.119    0.127    0.002   100.00 10652.68    0.118
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.033      100    0.010    0.010    0.010    0.012    0.001     7.97   100.00        .
  init                0.165      100    0.001    0.002    0.002    0.003    0.001     1.27    15.97        .
  parse               0.308      100    0.003    0.003    0.003    0.004    0.000     2.38    29.82        .
  check              11.404      100    0.112    0.114    0.114    0.118    0.001    88.01  1103.97        .
  eval                1.076      100    0.010    0.011    0.011    0.011    0.000     8.30   104.16        .
  total              12.957      100    0.128    0.130    0.129    0.134    0.001   100.00  1254.31    0.119
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.035       10    0.102    0.103    0.103    0.108    0.002    44.40   100.00        .
  init                0.125       10    0.012    0.013    0.012    0.013    0.001     5.36    12.08        .
  parse               0.030       10    0.003    0.003    0.003    0.003    0.000     1.29     2.90        .
  check               1.148       10    0.113    0.115    0.114    0.119    0.002    49.25   110.92        .
  eval                1.028       10    0.102    0.103    0.103    0.104    0.001    44.10    99.32        .
  total               2.331       10    0.230    0.233    0.232    0.237    0.002   100.00   225.22    0.130
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.036        1    1.036    1.036    1.036    1.036        .    81.90   100.00        .
  init                0.121        1    0.121    0.121    0.121    0.121        .     9.57    11.68        .
  parse               0.003        1    0.003    0.003    0.003    0.003        .     0.24     0.29        .
  check               0.114        1    0.114    0.114    0.114    0.114        .     9.01    11.00        .
  eval                1.027        1    1.027    1.027    1.027    1.027        .    81.19    99.13        .
  total               1.265        1    1.265    1.265    1.265    1.265        .   100.00   122.10    0.229
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               10.369        1   10.369   10.369   10.369   10.369        .    88.95   100.00        .
  init                1.238        1    1.238    1.238    1.238    1.238        .    10.62    11.94        .
  parse               0.003        1    0.003    0.003    0.003    0.003        .     0.03     0.03        .
  check               0.113        1    0.113    0.113    0.113    0.113        .     0.97     1.09        .
  eval               10.303        1   10.303   10.303   10.303   10.303        .    88.38    99.36        .
  total              11.657        1   11.657   11.657   11.657   11.657        .   100.00   112.42    1.288
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.120      100    0.001    0.001    0.001    0.002    0.000     1.01   100.00        .
  init                0.085      100    0.000    0.001    0.001    0.001    0.000     0.71    70.83        .
  parse               0.312      100    0.003    0.003    0.003    0.004    0.000     2.62   260.00        .
  check              11.380      100    0.112    0.114    0.114    0.118    0.001    95.40  9483.33        .
  eval                0.150      100    0.001    0.002    0.001    0.002    0.001     1.26   125.00        .
  total              11.929      100    0.118    0.119    0.119    0.125    0.001   100.00  9940.83    0.118
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.074      100    0.010    0.011    0.011    0.014    0.001     8.08   100.00        .
  init                0.332      100    0.003    0.003    0.003    0.005    0.000     2.50    30.91        .
  parse               0.321      100    0.003    0.003    0.003    0.004    0.000     2.41    29.89        .
  check              11.411      100    0.112    0.114    0.114    0.119    0.001    85.84  1062.48        .
  eval                1.230      100    0.011    0.012    0.012    0.014    0.001     9.25   114.53        .
  total              13.294      100    0.131    0.133    0.133    0.137    0.001   100.00  1237.80    0.122
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.225       10    0.121    0.123    0.122    0.126    0.002    41.82   100.00        .
  init                0.519       10    0.048    0.052    0.052    0.055    0.002    17.72    42.37        .
  parse               0.030       10    0.003    0.003    0.003    0.003    0.000     1.02     2.45        .
  check               1.141       10    0.113    0.114    0.114    0.117    0.001    38.96    93.14        .
  eval                1.239       10    0.122    0.124    0.123    0.127    0.001    42.30   101.14        .
  total               2.929       10    0.289    0.293    0.293    0.297    0.003   100.00   239.10    0.170
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.045        1    1.045    1.045    1.045    1.045        .    69.81   100.00        .
  init                0.316        1    0.316    0.316    0.316    0.316        .    21.11    30.24        .
  parse               0.003        1    0.003    0.003    0.003    0.003        .     0.20     0.29        .
  check               0.116        1    0.116    0.116    0.116    0.116        .     7.75    11.10        .
  eval                1.062        1    1.062    1.062    1.062    1.062        .    70.94   101.63        .
  total               1.497        1    1.497    1.497    1.497    1.497        .   100.00   143.25    0.452
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               10.407        1   10.407   10.407   10.407   10.407        .    76.32   100.00        .
  init                3.105        1    3.105    3.105    3.105    3.105        .    22.77    29.84        .
  parse               0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check               0.114        1    0.114    0.114    0.114    0.114        .     0.84     1.10        .
  eval               10.414        1   10.414   10.414   10.414   10.414        .    76.37   100.07        .
  total              13.636        1   13.636   13.636   13.636   13.636        .   100.00   131.03    3.229
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.112      100    0.001    0.001    0.001    0.002    0.000     0.86   100.00        .
  init                0.067      100    0.000    0.001    0.001    0.001    0.000     0.51    59.82        .
  parse               0.215      100    0.002    0.002    0.002    0.003    0.000     1.65   191.96        .
  check              12.620      100    0.125    0.126    0.126    0.135    0.002    96.78 11267.86        .
  eval                0.137      100    0.001    0.001    0.001    0.002    0.000     1.05   122.32        .
  total              13.040      100    0.129    0.130    0.130    0.140    0.002   100.00 11642.86    0.129
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.056      100    0.010    0.011    0.011    0.013    0.001     7.30   100.00        .
  init                0.520      100    0.005    0.005    0.005    0.006    0.000     3.59    49.24        .
  parse               0.218      100    0.002    0.002    0.002    0.003    0.000     1.51    20.64        .
  check              12.630      100    0.125    0.126    0.126    0.133    0.001    87.31  1196.02        .
  eval                1.093      100    0.010    0.011    0.011    0.013    0.000     7.56   103.50        .
  total              14.466      100    0.143    0.145    0.144    0.151    0.001   100.00  1369.89    0.134
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.038       10    0.103    0.104    0.104    0.105    0.001    35.01   100.00        .
  init                0.622       10    0.061    0.062    0.062    0.065    0.001    20.98    59.92        .
  parse               0.021       10    0.002    0.002    0.002    0.003    0.000     0.71     2.02        .
  check               1.260       10    0.125    0.126    0.126    0.127    0.001    42.50   121.39        .
  eval                1.061       10    0.105    0.106    0.106    0.107    0.001    35.78   102.22        .
  total               2.965       10    0.295    0.296    0.296    0.299    0.001   100.00   285.65    0.193
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.042        1    1.042    1.042    1.042    1.042        .    61.33   100.00        .
  init                0.482        1    0.482    0.482    0.482    0.482        .    28.37    46.26        .
  parse               0.002        1    0.002    0.002    0.002    0.002        .     0.12     0.19        .
  check               0.128        1    0.128    0.128    0.128    0.128        .     7.53    12.28        .
  eval                1.087        1    1.087    1.087    1.087    1.087        .    63.98   104.32        .
  total               1.699        1    1.699    1.699    1.699    1.699        .   100.00   163.05    0.657
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               10.704        1   10.704   10.704   10.704   10.704        .    68.65   100.00        .
  init                4.821        1    4.821    4.821    4.821    4.821        .    30.92    45.04        .
  parse               0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.02        .
  check               0.125        1    0.125    0.125    0.125    0.125        .     0.80     1.17        .
  eval               10.645        1   10.645   10.645   10.645   10.645        .    68.27    99.45        .
  total              15.593        1   15.593   15.593   15.593   15.593        .   100.00   145.67    4.889
--------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.010        1    0.010    0.010    0.010    0.010        .     0.15   100.00        .
  init                0.001        1    0.001    0.001    0.001    0.001        .     0.02    10.00        .
  parse               0.139        1    0.139    0.139    0.139    0.139        .     2.09  1390.00        .
  check               6.482        1    6.482    6.482    6.482    6.482        .    97.69 64820.00        .
  eval                0.013        1    0.013    0.013    0.013    0.013        .     0.20   130.00        .
  total               6.635        1    6.635    6.635    6.635    6.635        .   100.00 66350.00    6.625
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.092        1    0.092    0.092    0.092    0.092        .     0.86   100.00        .
  init                0.002        1    0.002    0.002    0.002    0.002        .     0.02     2.17        .
  parse               0.134        1    0.134    0.134    0.134    0.134        .     1.25   145.65        .
  check              10.502        1   10.502   10.502   10.502   10.502        .    97.86 11415.22        .
  eval                0.093        1    0.093    0.093    0.093    0.093        .     0.87   101.09        .
  total              10.732        1   10.732   10.732   10.732   10.732        .   100.00 11665.22   10.640
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.886        1    0.886    0.886    0.886    0.886        .     7.73   100.00        .
  init                0.013        1    0.013    0.013    0.013    0.013        .     0.11     1.47        .
  parse               0.135        1    0.135    0.135    0.135    0.135        .     1.18    15.24        .
  check              10.421        1   10.421   10.421   10.421   10.421        .    90.87  1176.19        .
  eval                0.898        1    0.898    0.898    0.898    0.898        .     7.83   101.35        .
  total              11.468        1   11.468   11.468   11.468   11.468        .   100.00  1294.36   10.582
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                8.885        1    8.885    8.885    8.885    8.885        .    45.20   100.00        .
  init                0.119        1    0.119    0.119    0.119    0.119        .     0.61     1.34        .
  parse               0.137        1    0.137    0.137    0.137    0.137        .     0.70     1.54        .
  check              10.453        1   10.453   10.453   10.453   10.453        .    53.18   117.65        .
  eval                8.947        1    8.947    8.947    8.947    8.947        .    45.52   100.70        .
  total              19.656        1   19.656   19.656   19.656   19.656        .   100.00   221.23   10.771
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               89.440        1   89.440   89.440   89.440   89.440        .    88.79   100.00        .
  init                1.201        1    1.201    1.201    1.201    1.201        .     1.19     1.34        .
  parse               0.136        1    0.136    0.136    0.136    0.136        .     0.14     0.15        .
  check              10.418        1   10.418   10.418   10.418   10.418        .    10.34    11.65        .
  eval               88.974        1   88.974   88.974   88.974   88.974        .    88.33    99.48        .
  total             100.729        1  100.729  100.729  100.729  100.729        .   100.00   112.62   11.289
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.010        1    0.010    0.010    0.010    0.010        .     0.16   100.00        .
  init                0.001        1    0.001    0.001    0.001    0.001        .     0.02    10.00        .
  parse               0.137        1    0.137    0.137    0.137    0.137        .     2.14  1370.00        .
  check               6.259        1    6.259    6.259    6.259    6.259        .    97.64 62590.00        .
  eval                0.013        1    0.013    0.013    0.013    0.013        .     0.20   130.00        .
  total               6.410        1    6.410    6.410    6.410    6.410        .   100.00 64100.00    6.400
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.097        1    0.097    0.097    0.097    0.097        .     0.90   100.00        .
  init                0.004        1    0.004    0.004    0.004    0.004        .     0.04     4.12        .
  parse               0.137        1    0.137    0.137    0.137    0.137        .     1.28   141.24        .
  check              10.492        1   10.492   10.492   10.492   10.492        .    97.75 10816.49        .
  eval                0.100        1    0.100    0.100    0.100    0.100        .     0.93   103.09        .
  total              10.733        1   10.733   10.733   10.733   10.733        .   100.00 11064.95   10.636
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.382        1    2.382    2.382    2.382    2.382        .    18.28   100.00        .
  init                0.066        1    0.066    0.066    0.066    0.066        .     0.51     2.77        .
  parse               0.135        1    0.135    0.135    0.135    0.135        .     1.04     5.67        .
  check              10.447        1   10.447   10.447   10.447   10.447        .    80.15   438.58        .
  eval                2.386        1    2.386    2.386    2.386    2.386        .    18.31   100.17        .
  total              13.034        1   13.034   13.034   13.034   13.034        .   100.00   547.19   10.652
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                9.290        1    9.290    9.290    9.290    9.290        .    46.06   100.00        .
  init                0.319        1    0.319    0.319    0.319    0.319        .     1.58     3.43        .
  parse               0.136        1    0.136    0.136    0.136    0.136        .     0.67     1.46        .
  check              10.450        1   10.450   10.450   10.450   10.450        .    51.81   112.49        .
  eval                9.261        1    9.261    9.261    9.261    9.261        .    45.92    99.69        .
  total              20.168        1   20.168   20.168   20.168   20.168        .   100.00   217.09   10.878
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               90.999        1   90.999   90.999   90.999   90.999        .    87.68   100.00        .
  init                3.162        1    3.162    3.162    3.162    3.162        .     3.05     3.47        .
  parse               0.136        1    0.136    0.136    0.136    0.136        .     0.13     0.15        .
  check              10.519        1   10.519   10.519   10.519   10.519        .    10.14    11.56        .
  eval               89.963        1   89.963   89.963   89.963   89.963        .    86.69    98.86        .
  total             103.780        1  103.780  103.780  103.780  103.780        .   100.00   114.05   12.781
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.010        1    0.010    0.010    0.010    0.010        .     0.16   100.00        .
  init                0.001        1    0.001    0.001    0.001    0.001        .     0.02    10.00        .
  parse               0.067        1    0.067    0.067    0.067    0.067        .     1.05   670.00        .
  check               6.331        1    6.331    6.331    6.331    6.331        .    98.75 63310.00        .
  eval                0.012        1    0.012    0.012    0.012    0.012        .     0.19   120.00        .
  total               6.411        1    6.411    6.411    6.411    6.411        .   100.00 64110.00    6.401
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.101        1    0.101    0.101    0.101    0.101        .     0.86   100.00        .
  init                0.007        1    0.007    0.007    0.007    0.007        .     0.06     6.93        .
  parse               0.064        1    0.064    0.064    0.064    0.064        .     0.55    63.37        .
  check              11.540        1   11.540   11.540   11.540   11.540        .    98.52 11425.74        .
  eval                0.102        1    0.102    0.102    0.102    0.102        .     0.87   100.99        .
  total              11.713        1   11.713   11.713   11.713   11.713        .   100.00 11597.03   11.612
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.869        1    1.869    1.869    1.869    1.869        .    13.72   100.00        .
  init                0.093        1    0.093    0.093    0.093    0.093        .     0.68     4.98        .
  parse               0.065        1    0.065    0.065    0.065    0.065        .     0.48     3.48        .
  check              11.575        1   11.575   11.575   11.575   11.575        .    84.97   619.32        .
  eval                1.888        1    1.888    1.888    1.888    1.888        .    13.86   101.02        .
  total              13.622        1   13.622   13.622   13.622   13.622        .   100.00   728.84   11.753
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                9.987        1    9.987    9.987    9.987    9.987        .    45.18   100.00        .
  init                0.540        1    0.540    0.540    0.540    0.540        .     2.44     5.41        .
  parse               0.066        1    0.066    0.066    0.066    0.066        .     0.30     0.66        .
  check              11.558        1   11.558   11.558   11.558   11.558        .    52.28   115.73        .
  eval                9.942        1    9.942    9.942    9.942    9.942        .    44.97    99.55        .
  total              22.106        1   22.106   22.106   22.106   22.106        .   100.00   221.35   12.119
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               98.456        1   98.456   98.456   98.456   98.456        .    87.21   100.00        .
  init                5.176        1    5.176    5.176    5.176    5.176        .     4.58     5.26        .
  parse               0.065        1    0.065    0.065    0.065    0.065        .     0.06     0.07        .
  check              11.556        1   11.556   11.556   11.556   11.556        .    10.24    11.74        .
  eval               96.094        1   96.094   96.094   96.094   96.094        .    85.12    97.60        .
  total             112.891        1  112.891  112.891  112.891  112.891        .   100.00   114.66   14.435
--------------------------------------------------------------------------------------------------------------

. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.281     1000    0.000    0.000    0.000    0.001    0.000    26.89   100.00        .
  init                0.068     1000    0.000    0.000    0.000    0.001    0.000     6.51    24.20        .
  parse               0.601     1000    0.000    0.001    0.001    0.001    0.000    57.51   213.88        .
  check               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.57     2.14        .
  eval                0.342     1000    0.000    0.000    0.000    0.001    0.000    32.73   121.71        .
  total               1.045     1000    0.001    0.001    0.001    0.002    0.000   100.00   371.89    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.644     1000    0.002    0.003    0.003    0.004    0.000    75.09   100.00        .
  init                0.091     1000    0.000    0.000    0.000    0.001    0.000     2.58     3.44        .
  parse               0.644     1000    0.000    0.001    0.001    0.001    0.000    18.29    24.36        .
  check               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.14     0.19        .
  eval                2.758     1000    0.002    0.003    0.003    0.004    0.000    78.33   104.31        .
  total               3.521     1000    0.003    0.004    0.004    0.005    0.001   100.00   133.17    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                5.898      100    0.057    0.059    0.059    0.063    0.001    98.66   100.00        .
  init                0.010      100    0.000    0.000    0.000    0.001    0.000     0.17     0.17        .
  parse               0.067      100    0.000    0.001    0.001    0.001    0.000     1.12     1.14        .
  check               0.001      100    0.000    0.000    0.000    0.001    0.000     0.02     0.02        .
  eval                5.897      100    0.057    0.059    0.059    0.063    0.001    98.65    99.98        .
  total               5.978      100    0.058    0.060    0.060    0.064    0.001   100.00   101.36    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.624       10    0.258    0.262    0.262    0.266    0.002    99.21   100.00        .
  init                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  parse               0.007       10    0.000    0.001    0.001    0.001    0.000     0.26     0.27        .
  check               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                2.638       10    0.260    0.264    0.263    0.267    0.002    99.74   100.53        .
  total               2.645       10    0.261    0.265    0.264    0.268    0.002   100.00   100.80    0.002
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.475        1    2.475    2.475    2.475    2.475        .    99.08   100.00        .
  init                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse               0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  check               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                2.497        1    2.497    2.497    2.497    2.497        .    99.96   100.89        .
  total               2.498        1    2.498    2.498    2.498    2.498        .   100.00   100.93    0.023
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.302     1000    0.000    0.000    0.000    0.001    0.000    28.52   100.00        .
  init                0.081     1000    0.000    0.000    0.000    0.001    0.000     7.65    26.82        .
  parse               0.609     1000    0.000    0.001    0.001    0.002    0.000    57.51   201.66        .
  check               0.002     1000    0.000    0.000    0.000    0.001    0.000     0.19     0.66        .
  eval                0.350     1000    0.000    0.000    0.000    0.001    0.000    33.05   115.89        .
  total               1.059     1000    0.001    0.001    0.001    0.002    0.000   100.00   350.66    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.538     1000    0.002    0.003    0.003    0.004    0.001    77.26   100.00        .
  init                0.083     1000    0.000    0.000    0.000    0.001    0.000     2.53     3.27        .
  parse               0.606     1000    0.000    0.001    0.001    0.001    0.000    18.45    23.88        .
  check               0.004     1000    0.000    0.000    0.000    0.001    0.000     0.12     0.16        .
  eval                2.568     1000    0.002    0.003    0.003    0.004    0.001    78.17   101.18        .
  total               3.285     1000    0.003    0.003    0.003    0.005    0.000   100.00   129.43    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.531      100    0.024    0.025    0.025    0.028    0.001    95.98   100.00        .
  init                0.012      100    0.000    0.000    0.000    0.001    0.000     0.46     0.47        .
  parse               0.070      100    0.000    0.001    0.001    0.001    0.000     2.65     2.77        .
  check               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                2.553      100    0.025    0.026    0.025    0.027    0.001    96.81   100.87        .
  total               2.637      100    0.026    0.026    0.026    0.028    0.001   100.00   104.19    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.562       10    0.254    0.256    0.256    0.259    0.002   100.16   100.00        .
  init                0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  parse               0.008       10    0.000    0.001    0.001    0.001    0.000     0.31     0.31        .
  check               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                2.549       10    0.253    0.255    0.255    0.258    0.002    99.65    99.49        .
  total               2.558       10    0.254    0.256    0.255    0.259    0.002   100.00    99.84   -0.000
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.558        1    2.558    2.558    2.558    2.558        .   100.95   100.00        .
  init                0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  parse               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                2.533        1    2.533    2.533    2.533    2.533        .    99.96    99.02        .
  total               2.534        1    2.534    2.534    2.534    2.534        .   100.00    99.06   -0.024
--------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.262     1000    0.000    0.000    0.000    0.001    0.000    29.67   100.00        .
  init                0.074     1000    0.000    0.000    0.000    0.001    0.000     8.38    28.24        .
  parse               0.493     1000    0.000    0.000    0.000    0.001    0.001    55.83   188.17        .
  check               0.002     1000    0.000    0.000    0.000    0.001    0.000     0.23     0.76        .
  eval                0.287     1000    0.000    0.000    0.000    0.002    0.000    32.50   109.54        .
  total               0.883     1000    0.000    0.001    0.001    0.002    0.000   100.00   337.02    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.154     1000    0.002    0.002    0.002    0.005    0.000    76.98   100.00        .
  init                0.075     1000    0.000    0.000    0.000    0.001    0.000     2.68     3.48        .
  parse               0.482     1000    0.000    0.000    0.000    0.002    0.001    17.23    22.38        .
  check               0.007     1000    0.000    0.000    0.000    0.001    0.000     0.25     0.32        .
  eval                2.206     1000    0.002    0.002    0.002    0.004    0.000    78.84   102.41        .
  total               2.798     1000    0.002    0.003    0.003    0.005    0.000   100.00   129.90    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.140      100    0.020    0.021    0.021    0.023    0.001    95.24   100.00        .
  init                0.007      100    0.000    0.000    0.000    0.001    0.000     0.31     0.33        .
  parse               0.056      100    0.000    0.001    0.001    0.001    0.000     2.49     2.62        .
  check               0.001      100    0.000    0.000    0.000    0.001    0.000     0.04     0.05        .
  eval                2.181      100    0.021    0.022    0.022    0.032    0.001    97.06   101.92        .
  total               2.247      100    0.021    0.022    0.022    0.033    0.001   100.00   105.00    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.146       10    0.212    0.215    0.215    0.217    0.001    98.89   100.00        .
  init                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  parse               0.004       10    0.000    0.000    0.000    0.001    0.001     0.18     0.19        .
  check               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                2.166       10    0.214    0.217    0.216    0.219    0.002    99.82   100.93        .
  total               2.170       10    0.214    0.217    0.217    0.219    0.002   100.00   101.12    0.002
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.147        1    2.147    2.147    2.147    2.147        .    98.17   100.00        .
  init                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse               0.001        1    0.001    0.001    0.001    0.001        .     0.05     0.05        .
  check               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                2.186        1    2.186    2.186    2.186    2.186        .    99.95   101.82        .
  total               2.187        1    2.187    2.187    2.187    2.187        .   100.00   101.86    0.040
--------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  24 Sep 2024, 20:52:05
------------------------------------------------------------------------------------------------------------------------
