---------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  25 Sep 2024, 15:17:30

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.351     1000    0.000    0.000    0.000    0.005    0.001     6.81   100.00        .
  init                     0.637     1000    0.000    0.001    0.001    0.003    0.001    12.35   181.48        .
  parse                    0.820     1000    0.000    0.001    0.001    0.003    0.001    15.90   233.62        .
  check                    3.232     1000    0.002    0.003    0.003    0.015    0.001    62.67   920.80        .
  - usefulness             1.169     1000    0.000    0.001    0.001    0.013    0.001    22.67   333.05        .
  - combine                0.054     1000    0.000    0.000    0.000    0.001    0.000     1.05    15.38        .
  - exhaustiveness         1.917     1000    0.001    0.002    0.002    0.006    0.001    37.17   546.15        .
  - compress               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.12     1.71        .
  - print                  0.028     1000    0.000    0.000    0.000    0.001    0.000     0.54     7.98        .
  eval                     0.433     1000    0.000    0.000    0.000    0.001    0.000     8.40   123.36        .
  total                    5.157     1000    0.004    0.005    0.005    0.016    0.002   100.00  1469.23    0.005
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     3.734     1000    0.002    0.004    0.003    0.010    0.002    43.25   100.00        .
  init                     1.192     1000    0.000    0.001    0.001    0.005    0.001    13.81    31.92        .
  parse                    0.975     1000    0.000    0.001    0.001    0.003    0.000    11.29    26.11        .
  check                    3.481     1000    0.002    0.003    0.003    0.008    0.001    40.32    93.22        .
  - usefulness             1.294     1000    0.000    0.001    0.001    0.004    0.001    14.99    34.65        .
  - combine                0.064     1000    0.000    0.000    0.000    0.001    0.000     0.74     1.71        .
  - exhaustiveness         2.014     1000    0.001    0.002    0.002    0.005    0.001    23.33    53.94        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.06     0.13        .
  - print                  0.023     1000    0.000    0.000    0.000    0.001    0.000     0.27     0.62        .
  eval                     2.948     1000    0.002    0.003    0.003    0.014    0.001    34.14    78.95        .
  total                    8.634     1000    0.006    0.009    0.008    0.021    0.002   100.00   231.23    0.005
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     3.425      100    0.029    0.034    0.031    0.053    0.006    75.88   100.00        .
  init                     0.598      100    0.005    0.006    0.006    0.014    0.002    13.25    17.46        .
  parse                    0.070      100    0.000    0.001    0.001    0.002    0.000     1.55     2.04        .
  check                    0.300      100    0.002    0.003    0.003    0.008    0.001     6.65     8.76        .
  - usefulness             0.106      100    0.000    0.001    0.001    0.003    0.000     2.35     3.09        .
  - combine                0.004      100    0.000    0.000    0.000    0.001    0.000     0.09     0.12        .
  - exhaustiveness         0.175      100    0.001    0.002    0.002    0.004    0.001     3.88     5.11        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.007      100    0.000    0.000    0.000    0.001    0.000     0.16     0.20        .
  eval                     3.542      100    0.029    0.035    0.031    0.055    0.007    78.47   103.42        .
  total                    4.514      100    0.038    0.045    0.041    0.065    0.007   100.00   131.80    0.011
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.780       10    0.257    0.278    0.279    0.309    0.016    79.82   100.00        .
  init                     0.553       10    0.044    0.055    0.056    0.069    0.009    15.88    19.89        .
  parse                    0.007       10    0.000    0.001    0.001    0.001    0.000     0.20     0.25        .
  check                    0.032       10    0.002    0.003    0.003    0.006    0.001     0.92     1.15        .
  - usefulness             0.011       10    0.000    0.001    0.001    0.003    0.001     0.32     0.40        .
  - combine                0.002       10    0.000    0.000    0.000    0.001    0.000     0.06     0.07        .
  - exhaustiveness         0.017       10    0.001    0.002    0.002    0.003    0.001     0.49     0.61        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     2.891       10    0.256    0.289    0.289    0.320    0.021    83.00   103.99        .
  total                    3.483       10    0.305    0.348    0.347    0.385    0.026   100.00   125.29    0.070
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.658        1    2.658    2.658    2.658    2.658        .    88.04   100.00        .
  init                     0.435        1    0.435    0.435    0.435    0.435        .    14.41    16.37        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  check                    0.003        1    0.003    0.003    0.003    0.003        .     0.10     0.11        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.07     0.08        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     2.580        1    2.580    2.580    2.580    2.580        .    85.46    97.07        .
  total                    3.019        1    3.019    3.019    3.019    3.019        .   100.00   113.58    0.361
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.286     1000    0.000    0.000    0.000    0.001    0.000     6.23   100.00        .
  init                     0.787     1000    0.000    0.001    0.001    0.002    0.000    17.15   275.17        .
  parse                    0.679     1000    0.000    0.001    0.001    0.002    0.000    14.79   237.41        .
  check                    2.740     1000    0.002    0.003    0.003    0.004    0.000    59.69   958.04        .
  - usefulness             0.966     1000    0.000    0.001    0.001    0.002    0.000    21.05   337.76        .
  - combine                0.053     1000    0.000    0.000    0.000    0.001    0.000     1.15    18.53        .
  - exhaustiveness         1.633     1000    0.001    0.002    0.002    0.003    0.000    35.58   570.98        .
  - compress               0.009     1000    0.000    0.000    0.000    0.001    0.000     0.20     3.15        .
  - print                  0.019     1000    0.000    0.000    0.000    0.001    0.000     0.41     6.64        .
  eval                     0.362     1000    0.000    0.000    0.000    0.002    0.000     7.89   126.57        .
  total                    4.590     1000    0.004    0.005    0.005    0.006    0.001   100.00  1604.90    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.514     1000    0.002    0.003    0.003    0.004    0.001    27.04   100.00        .
  init                     3.273     1000    0.003    0.003    0.003    0.005    0.000    35.21   130.19        .
  parse                    0.670     1000    0.000    0.001    0.001    0.002    0.000     7.21    26.65        .
  check                    2.759     1000    0.002    0.003    0.003    0.007    0.000    29.68   109.75        .
  - usefulness             0.975     1000    0.000    0.001    0.001    0.003    0.000    10.49    38.78        .
  - combine                0.045     1000    0.000    0.000    0.000    0.001    0.000     0.48     1.79        .
  - exhaustiveness         1.653     1000    0.001    0.002    0.002    0.006    0.001    17.78    65.75        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.05     0.20        .
  - print                  0.025     1000    0.000    0.000    0.000    0.001    0.000     0.27     0.99        .
  eval                     2.564     1000    0.002    0.003    0.003    0.005    0.001    27.58   101.99        .
  total                    9.296     1000    0.009    0.009    0.009    0.016    0.001   100.00   369.77    0.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.487      100    0.024    0.025    0.025    0.028    0.001    38.58   100.00        .
  init                     3.595      100    0.034    0.036    0.036    0.042    0.001    55.76   144.55        .
  parse                    0.078      100    0.000    0.001    0.001    0.002    0.000     1.21     3.14        .
  check                    0.267      100    0.002    0.003    0.003    0.004    0.000     4.14    10.74        .
  - usefulness             0.097      100    0.000    0.001    0.001    0.002    0.000     1.50     3.90        .
  - combine                0.008      100    0.000    0.000    0.000    0.001    0.000     0.12     0.32        .
  - exhaustiveness         0.153      100    0.001    0.002    0.002    0.002    0.001     2.37     6.15        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.003      100    0.000    0.000    0.000    0.001    0.000     0.05     0.12        .
  eval                     2.501      100    0.024    0.025    0.025    0.028    0.001    38.79   100.56        .
  total                    6.447      100    0.063    0.064    0.064    0.070    0.001   100.00   259.23    0.040
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.490       10    0.246    0.249    0.249    0.254    0.002    40.71   100.00        .
  init                     3.585       10    0.348    0.358    0.359    0.365    0.005    58.61   143.98        .
  parse                    0.005       10    0.000    0.001    0.000    0.001    0.001     0.08     0.20        .
  check                    0.028       10    0.002    0.003    0.003    0.003    0.000     0.46     1.12        .
  - usefulness             0.010       10    0.001    0.001    0.001    0.001    0.000     0.16     0.40        .
  - combine                0.002       10    0.000    0.000    0.000    0.001    0.000     0.03     0.08        .
  - exhaustiveness         0.015       10    0.001    0.002    0.001    0.002    0.001     0.25     0.60        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.04        .
  eval                     2.499       10    0.248    0.250    0.249    0.253    0.002    40.85   100.36        .
  total                    6.117       10    0.600    0.612    0.612    0.617    0.005   100.00   245.66    0.363
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.551        1    2.551    2.551    2.551    2.551        .    35.22   100.00        .
  init                     4.251        1    4.251    4.251    4.251    4.251        .    58.68   166.64        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.04        .
  check                    0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.08        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     2.990        1    2.990    2.990    2.990    2.990        .    41.28   117.21        .
  total                    7.244        1    7.244    7.244    7.244    7.244        .   100.00   283.97    4.693
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.348     1000    0.000    0.000    0.000    0.002    0.000     6.70   100.00        .
  init                     0.619     1000    0.000    0.001    0.001    0.002    0.001    11.91   177.87        .
  parse                    0.729     1000    0.000    0.001    0.001    0.003    0.001    14.03   209.48        .
  check                    3.455     1000    0.002    0.003    0.003    0.012    0.001    66.48   992.82        .
  - usefulness             1.139     1000    0.000    0.001    0.001    0.004    0.001    21.92   327.30        .
  - combine                0.046     1000    0.000    0.000    0.000    0.001    0.000     0.89    13.22        .
  - exhaustiveness         2.177     1000    0.001    0.002    0.002    0.008    0.001    41.89   625.57        .
  - compress               0.007     1000    0.000    0.000    0.000    0.001    0.000     0.13     2.01        .
  - print                  0.026     1000    0.000    0.000    0.000    0.001    0.000     0.50     7.47        .
  eval                     0.361     1000    0.000    0.000    0.000    0.001    0.000     6.95   103.74        .
  total                    5.197     1000    0.004    0.005    0.005    0.016    0.002   100.00  1493.39    0.005
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     3.576     1000    0.002    0.004    0.003    0.009    0.002    27.81   100.00        .
  init                     6.346     1000    0.004    0.006    0.006    0.017    0.002    49.35   177.46        .
  parse                    0.677     1000    0.000    0.001    0.001    0.002    0.000     5.27    18.93        .
  check                    3.085     1000    0.002    0.003    0.003    0.014    0.001    23.99    86.27        .
  - usefulness             1.039     1000    0.000    0.001    0.001    0.004    0.000     8.08    29.05        .
  - combine                0.035     1000    0.000    0.000    0.000    0.001    0.000     0.27     0.98        .
  - exhaustiveness         1.941     1000    0.001    0.002    0.002    0.009    0.001    15.10    54.28        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.04     0.14        .
  - print                  0.018     1000    0.000    0.000    0.000    0.001    0.000     0.14     0.50        .
  eval                     2.719     1000    0.002    0.003    0.003    0.010    0.001    21.15    76.03        .
  total                   12.858     1000    0.010    0.013    0.012    0.031    0.003   100.00   359.56    0.009
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     4.612      100    0.023    0.046    0.046    0.074    0.010    31.20   100.00        .
  init                     9.762      100    0.076    0.098    0.096    0.127    0.011    66.04   211.67        .
  parse                    0.063      100    0.000    0.001    0.001    0.002    0.001     0.43     1.37        .
  check                    0.315      100    0.002    0.003    0.003    0.008    0.001     2.13     6.83        .
  - usefulness             0.096      100    0.000    0.001    0.001    0.003    0.001     0.65     2.08        .
  - combine                0.005      100    0.000    0.000    0.000    0.001    0.000     0.03     0.11        .
  - exhaustiveness         0.205      100    0.001    0.002    0.002    0.006    0.001     1.39     4.44        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.004      100    0.000    0.000    0.000    0.001    0.000     0.03     0.09        .
  eval                     4.639      100    0.023    0.046    0.047    0.064    0.010    31.38   100.59        .
  total                   14.782      100    0.105    0.148    0.148    0.180    0.016   100.00   320.51    0.102
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.474       10    0.222    0.247    0.242    0.277    0.016    31.99   100.00        .
  init                     5.349       10    0.502    0.535    0.534    0.566    0.021    69.17   216.21        .
  parse                    0.005       10    0.000    0.001    0.000    0.001    0.001     0.06     0.20        .
  check                    0.032       10    0.003    0.003    0.003    0.005    0.001     0.41     1.29        .
  - usefulness             0.011       10    0.001    0.001    0.001    0.002    0.000     0.14     0.44        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.021       10    0.002    0.002    0.002    0.003    0.000     0.27     0.85        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     2.347       10    0.210    0.235    0.233    0.267    0.018    30.35    94.87        .
  total                    7.733       10    0.738    0.773    0.755    0.824    0.032   100.00   312.57    0.526
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.081        1    2.081    2.081    2.081    2.081        .    30.54   100.00        .
  init                     4.713        1    4.713    4.713    4.713    4.713        .    69.17   226.48        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.05        .
  check                    0.003        1    0.003    0.003    0.003    0.003        .     0.04     0.14        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.05        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.10        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     2.097        1    2.097    2.097    2.097    2.097        .    30.77   100.77        .
  total                    6.814        1    6.814    6.814    6.814    6.814        .   100.00   327.44    4.733
-------------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.121      100    0.001    0.001    0.001    0.003    0.000     0.98   100.00        .
  init                     0.060      100    0.000    0.001    0.001    0.001    0.000     0.49    49.59        .
  parse                    0.337      100    0.003    0.003    0.003    0.007    0.001     2.73   278.51        .
  check                   11.792      100    0.113    0.118    0.116    0.173    0.008    95.50  9745.45        .
  - usefulness             3.546      100    0.034    0.035    0.035    0.059    0.003    28.72  2930.58        .
  - combine                0.084      100    0.000    0.001    0.001    0.002    0.000     0.68    69.42        .
  - exhaustiveness         8.125      100    0.078    0.081    0.080    0.114    0.006    65.80  6714.88        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.83        .
  - print                  0.008      100    0.000    0.000    0.000    0.001    0.000     0.06     6.61        .
  eval                     0.158      100    0.001    0.002    0.002    0.005    0.001     1.28   130.58        .
  total                   12.348      100    0.119    0.123    0.121    0.182    0.009   100.00 10204.96    0.122
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     1.065      100    0.010    0.011    0.011    0.018    0.001     7.82   100.00        .
  init                     0.166      100    0.001    0.002    0.002    0.002    0.000     1.22    15.59        .
  parse                    0.332      100    0.003    0.003    0.003    0.004    0.000     2.44    31.17        .
  check                   11.993      100    0.115    0.120    0.118    0.171    0.007    88.11  1126.10        .
  - usefulness             3.601      100    0.034    0.036    0.036    0.045    0.002    26.46   338.12        .
  - combine                0.088      100    0.000    0.001    0.001    0.002    0.000     0.65     8.26        .
  - exhaustiveness         8.270      100    0.078    0.083    0.081    0.128    0.006    60.76   776.53        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.09        .
  - print                  0.011      100    0.000    0.000    0.000    0.001    0.000     0.08     1.03        .
  eval                     1.116      100    0.010    0.011    0.011    0.017    0.001     8.20   104.79        .
  total                   13.611      100    0.131    0.136    0.134    0.193    0.008   100.00  1278.03    0.125
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     1.038       10    0.102    0.104    0.103    0.108    0.002    43.83   100.00        .
  init                     0.124       10    0.012    0.012    0.012    0.013    0.001     5.24    11.95        .
  parse                    0.034       10    0.003    0.003    0.003    0.004    0.001     1.44     3.28        .
  check                    1.181       10    0.116    0.118    0.118    0.119    0.001    49.87   113.78        .
  - usefulness             0.360       10    0.034    0.036    0.036    0.038    0.001    15.20    34.68        .
  - combine                0.006       10    0.000    0.001    0.001    0.001    0.001     0.25     0.58        .
  - exhaustiveness         0.808       10    0.078    0.081    0.081    0.084    0.002    34.12    77.84        .
  - compress               0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.10        .
  - print                  0.003       10    0.000    0.000    0.000    0.001    0.000     0.13     0.29        .
  eval                     1.029       10    0.102    0.103    0.103    0.104    0.001    43.45    99.13        .
  total                    2.368       10    0.235    0.237    0.237    0.238    0.001   100.00   228.13    0.133
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     1.036        1    1.036    1.036    1.036    1.036        .    80.00   100.00        .
  init                     0.119        1    0.119    0.119    0.119    0.119        .     9.19    11.49        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.23     0.29        .
  check                    0.119        1    0.119    0.119    0.119    0.119        .     9.19    11.49        .
  - usefulness             0.035        1    0.035    0.035    0.035    0.035        .     2.70     3.38        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.08     0.10        .
  - exhaustiveness         0.082        1    0.082    0.082    0.082    0.082        .     6.33     7.92        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.054        1    1.054    1.054    1.054    1.054        .    81.39   101.74        .
  total                    1.295        1    1.295    1.295    1.295    1.295        .   100.00   125.00    0.259
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                    10.385        1   10.385   10.385   10.385   10.385        .    89.03   100.00        .
  init                     1.197        1    1.197    1.197    1.197    1.197        .    10.26    11.53        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.03     0.04        .
  check                    0.116        1    0.116    0.116    0.116    0.116        .     0.99     1.12        .
  - usefulness             0.036        1    0.036    0.036    0.036    0.036        .     0.31     0.35        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.078        1    0.078    0.078    0.078    0.078        .     0.67     0.75        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    10.348        1   10.348   10.348   10.348   10.348        .    88.71    99.64        .
  total                   11.665        1   11.665   11.665   11.665   11.665        .   100.00   112.33    1.280
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.113      100    0.001    0.001    0.001    0.002    0.000     0.92   100.00        .
  init                     0.081      100    0.000    0.001    0.001    0.002    0.000     0.66    71.68        .
  parse                    0.340      100    0.003    0.003    0.003    0.005    0.001     2.76   300.88        .
  check                   11.740      100    0.115    0.117    0.117    0.124    0.002    95.21 10389.38        .
  - usefulness             3.534      100    0.034    0.035    0.035    0.038    0.001    28.66  3127.43        .
  - combine                0.084      100    0.000    0.001    0.001    0.002    0.000     0.68    74.34        .
  - exhaustiveness         8.094      100    0.078    0.081    0.081    0.087    0.002    65.64  7162.83        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.02     1.77        .
  - print                  0.008      100    0.000    0.000    0.000    0.001    0.000     0.06     7.08        .
  eval                     0.168      100    0.001    0.002    0.002    0.003    0.001     1.36   148.67        .
  total                   12.330      100    0.120    0.123    0.123    0.130    0.002   100.00 10911.50    0.122
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     1.088      100    0.010    0.011    0.011    0.012    0.000     8.00   100.00        .
  init                     0.349      100    0.003    0.003    0.003    0.004    0.001     2.57    32.08        .
  parse                    0.326      100    0.003    0.003    0.003    0.004    0.000     2.40    29.96        .
  check                   11.652      100    0.114    0.117    0.116    0.131    0.003    85.68  1070.96        .
  - usefulness             3.528      100    0.034    0.035    0.035    0.044    0.002    25.94   324.26        .
  - combine                0.090      100    0.000    0.001    0.001    0.003    0.000     0.66     8.27        .
  - exhaustiveness         8.004      100    0.078    0.080    0.079    0.088    0.002    58.85   735.66        .
  - compress               0.006      100    0.000    0.000    0.000    0.001    0.000     0.04     0.55        .
  - print                  0.004      100    0.000    0.000    0.000    0.001    0.000     0.03     0.37        .
  eval                     1.268      100    0.012    0.013    0.013    0.016    0.001     9.32   116.54        .
  total                   13.600      100    0.132    0.136    0.135    0.153    0.004   100.00  1250.00    0.125
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.769       10    0.274    0.277    0.277    0.281    0.002    60.09   100.00        .
  init                     0.596       10    0.055    0.060    0.058    0.071    0.005    12.93    21.52        .
  parse                    0.035       10    0.003    0.004    0.003    0.004    0.001     0.76     1.26        .
  check                    1.170       10    0.115    0.117    0.116    0.120    0.002    25.39    42.25        .
  - usefulness             0.354       10    0.035    0.035    0.035    0.036    0.001     7.68    12.78        .
  - combine                0.010       10    0.001    0.001    0.001    0.001    0.000     0.22     0.36        .
  - exhaustiveness         0.804       10    0.078    0.080    0.080    0.084    0.002    17.45    29.04        .
  - compress               0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.04        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                     2.807       10    0.277    0.281    0.281    0.286    0.002    60.92   101.37        .
  total                    4.608       10    0.456    0.461    0.459    0.471    0.005   100.00   166.41    0.184
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     1.074        1    1.074    1.074    1.074    1.074        .    71.84   100.00        .
  init                     0.311        1    0.311    0.311    0.311    0.311        .    20.80    28.96        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.20     0.28        .
  check                    0.117        1    0.117    0.117    0.117    0.117        .     7.83    10.89        .
  - usefulness             0.036        1    0.036    0.036    0.036    0.036        .     2.41     3.35        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.09        .
  - exhaustiveness         0.079        1    0.079    0.079    0.079    0.079        .     5.28     7.36        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.064        1    1.064    1.064    1.064    1.064        .    71.17    99.07        .
  total                    1.495        1    1.495    1.495    1.495    1.495        .   100.00   139.20    0.421
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                    10.507        1   10.507   10.507   10.507   10.507        .    76.50   100.00        .
  init                     3.110        1    3.110    3.110    3.110    3.110        .    22.64    29.60        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.03     0.04        .
  check                    0.114        1    0.114    0.114    0.114    0.114        .     0.83     1.08        .
  - usefulness             0.035        1    0.035    0.035    0.035    0.035        .     0.25     0.33        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.079        1    0.079    0.079    0.079    0.079        .     0.58     0.75        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    10.507        1   10.507   10.507   10.507   10.507        .    76.50   100.00        .
  total                   13.735        1   13.735   13.735   13.735   13.735        .   100.00   130.72    3.228
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.116      100    0.001    0.001    0.001    0.002    0.000     0.87   100.00        .
  init                     0.066      100    0.000    0.001    0.001    0.001    0.000     0.49    56.90        .
  parse                    0.225      100    0.002    0.002    0.002    0.003    0.000     1.68   193.97        .
  check                   12.926      100    0.126    0.129    0.129    0.139    0.002    96.64 11143.10        .
  - usefulness             3.284      100    0.032    0.033    0.033    0.038    0.001    24.55  2831.03        .
  - combine                0.048      100    0.000    0.000    0.000    0.001    0.001     0.36    41.38        .
  - exhaustiveness         9.574      100    0.093    0.096    0.095    0.105    0.002    71.58  8253.45        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.007      100    0.000    0.000    0.000    0.001    0.000     0.05     6.03        .
  eval                     0.155      100    0.001    0.002    0.002    0.003    0.001     1.16   133.62        .
  total                   13.375      100    0.131    0.134    0.133    0.143    0.002   100.00 11530.17    0.133
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     1.075      100    0.010    0.011    0.011    0.015    0.001     7.25   100.00        .
  init                     0.525      100    0.005    0.005    0.005    0.007    0.000     3.54    48.84        .
  parse                    0.225      100    0.002    0.002    0.002    0.003    0.000     1.52    20.93        .
  check                   12.956      100    0.126    0.130    0.129    0.135    0.002    87.38  1205.21        .
  - usefulness             3.310      100    0.032    0.033    0.033    0.037    0.001    22.32   307.91        .
  - combine                0.033      100    0.000    0.000    0.000    0.001    0.000     0.22     3.07        .
  - exhaustiveness         9.591      100    0.093    0.096    0.096    0.102    0.002    64.68   892.19        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.005      100    0.000    0.000    0.000    0.001    0.000     0.03     0.47        .
  eval                     1.118      100    0.010    0.011    0.011    0.015    0.001     7.54   104.00        .
  total                   14.828      100    0.145    0.148    0.148    0.154    0.002   100.00  1379.35    0.138
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     1.069       10    0.106    0.107    0.106    0.110    0.001    35.23   100.00        .
  init                     0.633       10    0.061    0.063    0.063    0.067    0.002    20.86    59.21        .
  parse                    0.024       10    0.002    0.002    0.002    0.003    0.001     0.79     2.25        .
  check                    1.289       10    0.127    0.129    0.129    0.131    0.001    42.49   120.58        .
  - usefulness             0.328       10    0.032    0.033    0.033    0.034    0.001    10.81    30.68        .
  - combine                0.005       10    0.000    0.001    0.000    0.001    0.001     0.16     0.47        .
  - exhaustiveness         0.954       10    0.094    0.095    0.095    0.098    0.002    31.44    89.24        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.09        .
  eval                     1.088       10    0.107    0.109    0.108    0.112    0.002    35.86   101.78        .
  total                    3.034       10    0.298    0.303    0.303    0.307    0.003   100.00   283.82    0.197
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     1.095        1    1.095    1.095    1.095    1.095        .    64.41   100.00        .
  init                     0.486        1    0.486    0.486    0.486    0.486        .    28.59    44.38        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.18     0.27        .
  check                    0.129        1    0.129    0.129    0.129    0.129        .     7.59    11.78        .
  - usefulness             0.032        1    0.032    0.032    0.032    0.032        .     1.88     2.92        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.097        1    0.097    0.097    0.097    0.097        .     5.71     8.86        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                     1.082        1    1.082    1.082    1.082    1.082        .    63.65    98.81        .
  total                    1.700        1    1.700    1.700    1.700    1.700        .   100.00   155.25    0.605
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                    10.721        1   10.721   10.721   10.721   10.721        .    65.06   100.00        .
  init                     4.922        1    4.922    4.922    4.922    4.922        .    29.87    45.91        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check                    0.135        1    0.135    0.135    0.135    0.135        .     0.82     1.26        .
  - usefulness             0.033        1    0.033    0.033    0.033    0.033        .     0.20     0.31        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.101        1    0.101    0.101    0.101    0.101        .     0.61     0.94        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                    11.419        1   11.419   11.419   11.419   11.419        .    69.29   106.51        .
  total                   16.479        1   16.479   16.479   16.479   16.479        .   100.00   153.71    5.758
-------------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.011        1    0.011    0.011    0.011    0.011        .     0.16   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01     9.09        .
  parse                    0.145        1    0.145    0.145    0.145    0.145        .     2.07  1318.18        .
  check                    6.841        1    6.841    6.841    6.841    6.841        .    97.71 62190.91        .
  - usefulness             2.587        1    2.587    2.587    2.587    2.587        .    36.95 23518.18        .
  - combine                0.121        1    0.121    0.121    0.121    0.121        .     1.73  1100.00        .
  - exhaustiveness         4.127        1    4.127    4.127    4.127    4.127        .    58.95 37518.18        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.002        1    0.002    0.002    0.002    0.002        .     0.03    18.18        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.19   118.18        .
  total                    7.001        1    7.001    7.001    7.001    7.001        .   100.00 63645.45    6.990
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.092        1    0.092    0.092    0.092    0.092        .     0.82   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.02     2.17        .
  parse                    0.139        1    0.139    0.139    0.139    0.139        .     1.24   151.09        .
  check                   10.930        1   10.930   10.930   10.930   10.930        .    97.89 11880.43        .
  - usefulness             3.308        1    3.308    3.308    3.308    3.308        .    29.63  3595.65        .
  - combine                0.128        1    0.128    0.128    0.128    0.128        .     1.15   139.13        .
  - exhaustiveness         7.488        1    7.488    7.488    7.488    7.488        .    67.06  8139.13        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.09        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.09        .
  eval                     0.094        1    0.094    0.094    0.094    0.094        .     0.84   102.17        .
  total                   11.166        1   11.166   11.166   11.166   11.166        .   100.00 12136.96   11.074
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.892        1    0.892    0.892    0.892    0.892        .     7.38   100.00        .
  init                     0.013        1    0.013    0.013    0.013    0.013        .     0.11     1.46        .
  parse                    0.150        1    0.150    0.150    0.150    0.150        .     1.24    16.82        .
  check                   11.001        1   11.001   11.001   11.001   11.001        .    91.05  1233.30        .
  - usefulness             3.257        1    3.257    3.257    3.257    3.257        .    26.96   365.13        .
  - combine                0.121        1    0.121    0.121    0.121    0.121        .     1.00    13.57        .
  - exhaustiveness         7.619        1    7.619    7.619    7.619    7.619        .    63.06   854.15        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.11        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.11        .
  eval                     0.918        1    0.918    0.918    0.918    0.918        .     7.60   102.91        .
  total                   12.082        1   12.082   12.082   12.082   12.082        .   100.00  1354.48   11.190
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     9.000        1    9.000    9.000    9.000    9.000        .    44.73   100.00        .
  init                     0.123        1    0.123    0.123    0.123    0.123        .     0.61     1.37        .
  parse                    0.145        1    0.145    0.145    0.145    0.145        .     0.72     1.61        .
  check                   10.784        1   10.784   10.784   10.784   10.784        .    53.60   119.82        .
  - usefulness             3.271        1    3.271    3.271    3.271    3.271        .    16.26    36.34        .
  - combine                0.121        1    0.121    0.121    0.121    0.121        .     0.60     1.34        .
  - exhaustiveness         7.386        1    7.386    7.386    7.386    7.386        .    36.71    82.07        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  eval                     9.068        1    9.068    9.068    9.068    9.068        .    45.07   100.76        .
  total                   20.121        1   20.121   20.121   20.121   20.121        .   100.00   223.57   11.121
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                    89.866        1   89.866   89.866   89.866   89.866        .    88.88   100.00        .
  init                     1.220        1    1.220    1.220    1.220    1.220        .     1.21     1.36        .
  parse                    0.144        1    0.144    0.144    0.144    0.144        .     0.14     0.16        .
  check                   10.761        1   10.761   10.761   10.761   10.761        .    10.64    11.97        .
  - usefulness             3.262        1    3.262    3.262    3.262    3.262        .     3.23     3.63        .
  - combine                0.119        1    0.119    0.119    0.119    0.119        .     0.12     0.13        .
  - exhaustiveness         7.374        1    7.374    7.374    7.374    7.374        .     7.29     8.21        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.00        .
  eval                    88.988        1   88.988   88.988   88.988   88.988        .    88.01    99.02        .
  total                  101.114        1  101.114  101.114  101.114  101.114        .   100.00   112.52   11.248
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.15   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  parse                    0.149        1    0.149    0.149    0.149    0.149        .     2.19  1490.00        .
  check                    6.656        1    6.656    6.656    6.656    6.656        .    97.61 66560.00        .
  - usefulness             2.539        1    2.539    2.539    2.539    2.539        .    37.23 25390.00        .
  - combine                0.121        1    0.121    0.121    0.121    0.121        .     1.77  1210.00        .
  - exhaustiveness         3.991        1    3.991    3.991    3.991    3.991        .    58.53 39910.00        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01    10.00        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.19   130.00        .
  total                    6.819        1    6.819    6.819    6.819    6.819        .   100.00 68190.00    6.809
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.095        1    0.095    0.095    0.095    0.095        .     0.86   100.00        .
  init                     0.004        1    0.004    0.004    0.004    0.004        .     0.04     4.21        .
  parse                    0.142        1    0.142    0.142    0.142    0.142        .     1.28   149.47        .
  check                   10.824        1   10.824   10.824   10.824   10.824        .    97.74 11393.68        .
  - usefulness             3.273        1    3.273    3.273    3.273    3.273        .    29.56  3445.26        .
  - combine                0.120        1    0.120    0.120    0.120    0.120        .     1.08   126.32        .
  - exhaustiveness         7.426        1    7.426    7.426    7.426    7.426        .    67.06  7816.84        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.05        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.05        .
  eval                     0.103        1    0.103    0.103    0.103    0.103        .     0.93   108.42        .
  total                   11.074        1   11.074   11.074   11.074   11.074        .   100.00 11656.84   10.979
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.423        1    2.423    2.423    2.423    2.423        .    17.93   100.00        .
  init                     0.065        1    0.065    0.065    0.065    0.065        .     0.48     2.68        .
  parse                    0.142        1    0.142    0.142    0.142    0.142        .     1.05     5.86        .
  check                   10.851        1   10.851   10.851   10.851   10.851        .    80.29   447.83        .
  - usefulness             3.274        1    3.274    3.274    3.274    3.274        .    24.23   135.12        .
  - combine                0.123        1    0.123    0.123    0.123    0.123        .     0.91     5.08        .
  - exhaustiveness         7.449        1    7.449    7.449    7.449    7.449        .    55.12   307.43        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.04        .
  eval                     2.456        1    2.456    2.456    2.456    2.456        .    18.17   101.36        .
  total                   13.514        1   13.514   13.514   13.514   13.514        .   100.00   557.74   11.091
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     9.339        1    9.339    9.339    9.339    9.339        .    45.47   100.00        .
  init                     0.326        1    0.326    0.326    0.326    0.326        .     1.59     3.49        .
  parse                    0.151        1    0.151    0.151    0.151    0.151        .     0.74     1.62        .
  check                   10.749        1   10.749   10.749   10.749   10.749        .    52.33   115.10        .
  - usefulness             3.258        1    3.258    3.258    3.258    3.258        .    15.86    34.89        .
  - combine                0.122        1    0.122    0.122    0.122    0.122        .     0.59     1.31        .
  - exhaustiveness         7.364        1    7.364    7.364    7.364    7.364        .    35.85    78.85        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  eval                     9.315        1    9.315    9.315    9.315    9.315        .    45.35    99.74        .
  total                   20.541        1   20.541   20.541   20.541   20.541        .   100.00   219.95   11.202
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                    90.741        1   90.741   90.741   90.741   90.741        .    85.99   100.00        .
  init                     3.320        1    3.320    3.320    3.320    3.320        .     3.15     3.66        .
  parse                    0.146        1    0.146    0.146    0.146    0.146        .     0.14     0.16        .
  check                   10.889        1   10.889   10.889   10.889   10.889        .    10.32    12.00        .
  - usefulness             3.273        1    3.273    3.273    3.273    3.273        .     3.10     3.61        .
  - combine                0.120        1    0.120    0.120    0.120    0.120        .     0.11     0.13        .
  - exhaustiveness         7.490        1    7.490    7.490    7.490    7.490        .     7.10     8.25        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.00        .
  eval                    91.174        1   91.174   91.174   91.174   91.174        .    86.40   100.48        .
  total                  105.529        1  105.529  105.529  105.529  105.529        .   100.00   116.30   14.788
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.013        1    0.013    0.013    0.013    0.013        .     0.18   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01     7.69        .
  parse                    0.066        1    0.066    0.066    0.066    0.066        .     0.90   507.69        .
  check                    7.223        1    7.223    7.223    7.223    7.223        .    98.90 55561.54        .
  - usefulness             2.325        1    2.325    2.325    2.325    2.325        .    31.84 17884.62        .
  - combine                0.051        1    0.051    0.051    0.051    0.051        .     0.70   392.31        .
  - exhaustiveness         4.845        1    4.845    4.845    4.845    4.845        .    66.34 37269.23        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     7.69        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.18   100.00        .
  total                    7.303        1    7.303    7.303    7.303    7.303        .   100.00 56176.92    7.290
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.125        1    0.125    0.125    0.125    0.125        .     0.93   100.00        .
  init                     0.006        1    0.006    0.006    0.006    0.006        .     0.04     4.80        .
  parse                    0.065        1    0.065    0.065    0.065    0.065        .     0.48    52.00        .
  check                   13.268        1   13.268   13.268   13.268   13.268        .    98.60 10614.40        .
  - usefulness             3.296        1    3.296    3.296    3.296    3.296        .    24.49  2636.80        .
  - combine                0.062        1    0.062    0.062    0.062    0.062        .     0.46    49.60        .
  - exhaustiveness         9.907        1    9.907    9.907    9.907    9.907        .    73.62  7925.60        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.80        .
  eval                     0.118        1    0.118    0.118    0.118    0.118        .     0.88    94.40        .
  total                   13.457        1   13.457   13.457   13.457   13.457        .   100.00 10765.60   13.332
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.172        1    2.172    2.172    2.172    2.172        .    13.92   100.00        .
  init                     0.109        1    0.109    0.109    0.109    0.109        .     0.70     5.02        .
  parse                    0.068        1    0.068    0.068    0.068    0.068        .     0.44     3.13        .
  check                   13.205        1   13.205   13.205   13.205   13.205        .    84.62   607.97        .
  - usefulness             3.228        1    3.228    3.228    3.228    3.228        .    20.69   148.62        .
  - combine                0.049        1    0.049    0.049    0.049    0.049        .     0.31     2.26        .
  - exhaustiveness         9.920        1    9.920    9.920    9.920    9.920        .    63.57   456.72        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.05        .
  - print                  0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.09        .
  eval                     2.223        1    2.223    2.223    2.223    2.223        .    14.25   102.35        .
  total                   15.605        1   15.605   15.605   15.605   15.605        .   100.00   718.46   13.433
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                    11.089        1   11.089   11.089   11.089   11.089        .    45.19   100.00        .
  init                     0.610        1    0.610    0.610    0.610    0.610        .     2.49     5.50        .
  parse                    0.088        1    0.088    0.088    0.088    0.088        .     0.36     0.79        .
  check                   13.266        1   13.266   13.266   13.266   13.266        .    54.06   119.63        .
  - usefulness             3.306        1    3.306    3.306    3.306    3.306        .    13.47    29.81        .
  - combine                0.050        1    0.050    0.050    0.050    0.050        .     0.20     0.45        .
  - exhaustiveness         9.907        1    9.907    9.907    9.907    9.907        .    40.37    89.34        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  eval                    10.574        1   10.574   10.574   10.574   10.574        .    43.09    95.36        .
  total                   24.539        1   24.539   24.539   24.539   24.539        .   100.00   221.29   13.450
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                   108.446        1  108.446  108.446  108.446  108.446        .    91.25   100.00        .
  init                     5.851        1    5.851    5.851    5.851    5.851        .     4.92     5.40        .
  parse                    0.078        1    0.078    0.078    0.078    0.078        .     0.07     0.07        .
  check                   12.492        1   12.492   12.492   12.492   12.492        .    10.51    11.52        .
  - usefulness             3.346        1    3.346    3.346    3.346    3.346        .     2.82     3.09        .
  - combine                0.054        1    0.054    0.054    0.054    0.054        .     0.05     0.05        .
  - exhaustiveness         9.088        1    9.088    9.088    9.088    9.088        .     7.65     8.38        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.00        .
  eval                   100.430        1  100.430  100.430  100.430  100.430        .    84.50    92.61        .
  total                  118.851        1  118.851  118.851  118.851  118.851        .   100.00   109.59   10.405
-------------------------------------------------------------------------------------------------------------------

. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.493     1000    0.000    0.000    0.000    0.003    0.001    27.00   100.00        .
  init                     0.128     1000    0.000    0.000    0.000    0.002    0.000     7.01    25.96        .
  parse                    1.000     1000    0.000    0.001    0.001    0.003    0.001    54.76   202.84        .
  check                    0.007     1000    0.000    0.000    0.000    0.001    0.000     0.38     1.42        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.654     1000    0.000    0.001    0.001    0.003    0.001    35.82   132.66        .
  total                    1.826     1000    0.001    0.002    0.002    0.005    0.001   100.00   370.39    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     4.066     1000    0.002    0.004    0.003    0.012    0.002    85.73   100.00        .
  init                     0.137     1000    0.000    0.000    0.000    0.001    0.000     2.89     3.37        .
  parse                    0.888     1000    0.000    0.001    0.001    0.004    0.001    18.72    21.84        .
  check                    0.003     1000    0.000    0.000    0.000    0.001    0.000     0.06     0.07        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     3.678     1000    0.002    0.004    0.003    0.013    0.001    77.55    90.46        .
  total                    4.743     1000    0.003    0.005    0.004    0.017    0.001   100.00   116.65    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     6.516      100    0.058    0.065    0.065    0.080    0.006    97.40   100.00        .
  init                     0.014      100    0.000    0.000    0.000    0.001    0.000     0.21     0.21        .
  parse                    0.071      100    0.000    0.001    0.001    0.002    0.001     1.06     1.09        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     6.603      100    0.058    0.066    0.065    0.090    0.006    98.70   101.34        .
  total                    6.690      100    0.059    0.067    0.067    0.090    0.006   100.00   102.67    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.900       10    0.270    0.290    0.283    0.320    0.015    99.11   100.00        .
  init                     0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  parse                    0.006       10    0.000    0.001    0.001    0.001    0.001     0.21     0.21        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.920       10    0.261    0.292    0.284    0.341    0.025    99.79   100.69        .
  total                    2.926       10    0.262    0.293    0.284    0.342    0.025   100.00   100.90    0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.683        1    2.683    2.683    2.683    2.683        .    97.56   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.749        1    2.749    2.749    2.749    2.749        .    99.96   102.46        .
  total                    2.750        1    2.750    2.750    2.750    2.750        .   100.00   102.50    0.067
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.471     1000    0.000    0.000    0.000    0.001    0.000    29.53   100.00        .
  init                     0.095     1000    0.000    0.000    0.000    0.001    0.000     5.96    20.17        .
  parse                    0.908     1000    0.000    0.001    0.001    0.002    0.001    56.93   192.78        .
  check                    0.007     1000    0.000    0.000    0.000    0.001    0.000     0.44     1.49        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.549     1000    0.000    0.001    0.001    0.004    0.001    34.42   116.56        .
  total                    1.595     1000    0.001    0.002    0.001    0.006    0.001   100.00   338.64    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     4.008     1000    0.002    0.004    0.003    0.010    0.002    84.18   100.00        .
  init                     0.112     1000    0.000    0.000    0.000    0.001    0.000     2.35     2.79        .
  parse                    0.964     1000    0.000    0.001    0.001    0.004    0.001    20.25    24.05        .
  check                    0.012     1000    0.000    0.000    0.000    0.001    0.000     0.25     0.30        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     3.633     1000    0.002    0.004    0.003    0.009    0.001    76.31    90.64        .
  total                    4.761     1000    0.003    0.005    0.005    0.012    0.002   100.00   118.79    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.779      100    0.024    0.028    0.025    0.040    0.005    94.81   100.00        .
  init                     0.012      100    0.000    0.000    0.000    0.001    0.000     0.41     0.43        .
  parse                    0.068      100    0.000    0.001    0.001    0.002    0.001     2.32     2.45        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.845      100    0.024    0.028    0.025    0.049    0.006    97.07   102.37        .
  total                    2.931      100    0.025    0.029    0.026    0.050    0.006   100.00   105.47    0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.769       10    0.249    0.277    0.281    0.296    0.015   103.51   100.00        .
  init                     0.002       10    0.000    0.000    0.000    0.001    0.000     0.07     0.07        .
  parse                    0.006       10    0.000    0.001    0.000    0.002    0.001     0.22     0.22        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.666       10    0.258    0.267    0.265    0.277    0.007    99.66    96.28        .
  total                    2.675       10    0.258    0.268    0.266    0.278    0.007   100.00    96.61   -0.009
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.791        1    2.791    2.791    2.791    2.791        .   100.83   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.768        1    2.768    2.768    2.768    2.768        .   100.00    99.18        .
  total                    2.768        1    2.768    2.768    2.768    2.768        .   100.00    99.18   -0.023
-------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     0.405     1000    0.000    0.000    0.000    0.001    0.000    31.15   100.00        .
  init                     0.090     1000    0.000    0.000    0.000    0.001    0.000     6.92    22.22        .
  parse                    0.727     1000    0.000    0.001    0.001    0.002    0.001    55.92   179.51        .
  check                    0.007     1000    0.000    0.000    0.000    0.001    0.000     0.54     1.73        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     0.446     1000    0.000    0.000    0.000    0.003    0.001    34.31   110.12        .
  total                    1.300     1000    0.000    0.001    0.001    0.004    0.001   100.00   320.99    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     4.099     1000    0.002    0.004    0.004    0.010    0.001    93.22   100.00        .
  init                     0.146     1000    0.000    0.000    0.000    0.001    0.000     3.32     3.56        .
  parse                    0.849     1000    0.000    0.001    0.001    0.003    0.001    19.31    20.71        .
  check                    0.009     1000    0.000    0.000    0.000    0.001    0.000     0.20     0.22        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     3.352     1000    0.002    0.003    0.003    0.009    0.001    76.23    81.78        .
  total                    4.397     1000    0.002    0.004    0.004    0.011    0.002   100.00   107.27    0.000
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.340      100    0.020    0.023    0.021    0.037    0.004    95.59   100.00        .
  init                     0.011      100    0.000    0.000    0.000    0.001    0.000     0.45     0.47        .
  parse                    0.052      100    0.000    0.001    0.001    0.002    0.001     2.12     2.22        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.379      100    0.020    0.024    0.021    0.044    0.005    97.18   101.67        .
  total                    2.448      100    0.021    0.024    0.022    0.045    0.006   100.00   104.62    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.372       10    0.215    0.237    0.237    0.271    0.017   100.89   100.00        .
  init                     0.002       10    0.000    0.000    0.000    0.001    0.000     0.09     0.08        .
  parse                    0.005       10    0.000    0.001    0.000    0.001    0.001     0.21     0.21        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.344       10    0.211    0.234    0.233    0.258    0.013    99.70    98.82        .
  total                    2.351       10    0.212    0.235    0.233    0.259    0.013   100.00    99.11   -0.002
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  base                     2.338        1    2.338    2.338    2.338    2.338        .   101.43   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  eval                     2.304        1    2.304    2.304    2.304    2.304        .    99.96    98.55        .
  total                    2.305        1    2.305    2.305    2.305    2.305        .   100.00    98.59   -0.033
-------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  25 Sep 2024, 15:41:05
---------------------------------------------------------------------------------------------------------------------------
