------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  24 Sep 2024, 21:19:12

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.325     1000    0.000    0.000    0.000    0.001    0.000     7.48   100.00        .
  init                0.518     1000    0.000    0.001    0.001    0.003    0.001    11.92   159.38        .
  parse               0.724     1000    0.000    0.001    0.001    0.004    0.000    16.66   222.77        .
  check               2.682     1000    0.002    0.003    0.003    0.005    0.001    61.71   825.23        .
  eval                0.397     1000    0.000    0.000    0.000    0.002    0.000     9.13   122.15        .
  total               4.346     1000    0.004    0.004    0.004    0.008    0.001   100.00  1337.23    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.799     1000    0.002    0.003    0.003    0.006    0.001    38.40   100.00        .
  init                0.861     1000    0.000    0.001    0.001    0.002    0.000    11.81    30.76        .
  parse               0.763     1000    0.000    0.001    0.001    0.003    0.000    10.47    27.26        .
  check               2.668     1000    0.002    0.003    0.003    0.006    0.001    36.60    95.32        .
  eval                2.969     1000    0.002    0.003    0.003    0.007    0.001    40.73   106.07        .
  total               7.289     1000    0.006    0.007    0.007    0.013    0.001   100.00   260.41    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                3.119      100    0.029    0.031    0.031    0.046    0.002    75.03   100.00        .
  init                0.572      100    0.005    0.006    0.006    0.010    0.001    13.76    18.34        .
  parse               0.082      100    0.000    0.001    0.001    0.002    0.000     1.97     2.63        .
  check               0.274      100    0.002    0.003    0.003    0.006    0.001     6.59     8.78        .
  eval                3.225      100    0.030    0.032    0.032    0.043    0.002    77.58   103.40        .
  total               4.157      100    0.038    0.042    0.041    0.052    0.002   100.00   133.28    0.010
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.619       10    0.254    0.262    0.261    0.271    0.005    83.17   100.00        .
  init                0.453       10    0.043    0.045    0.044    0.052    0.003    14.39    17.30        .
  parse               0.010       10    0.001    0.001    0.001    0.001    0.000     0.32     0.38        .
  check               0.030       10    0.002    0.003    0.003    0.006    0.001     0.95     1.15        .
  eval                2.655       10    0.255    0.266    0.264    0.280    0.008    84.31   101.37        .
  total               3.149       10    0.302    0.315    0.313    0.327    0.008   100.00   120.24    0.053
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.583        1    2.583    2.583    2.583    2.583        .    83.46   100.00        .
  init                0.448        1    0.448    0.448    0.448    0.448        .    14.47    17.34        .
  parse               0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  check               0.003        1    0.003    0.003    0.003    0.003        .     0.10     0.12        .
  eval                2.642        1    2.642    2.642    2.642    2.642        .    85.36   102.28        .
  total               3.095        1    3.095    3.095    3.095    3.095        .   100.00   119.82    0.512
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.300     1000    0.000    0.000    0.000    0.002    0.000     6.37   100.00        .
  init                0.832     1000    0.000    0.001    0.001    0.003    0.000    17.67   277.33        .
  parse               0.734     1000    0.000    0.001    0.001    0.002    0.000    15.59   244.67        .
  check               2.716     1000    0.002    0.003    0.003    0.006    0.001    57.69   905.33        .
  eval                0.397     1000    0.000    0.000    0.000    0.002    0.000     8.43   132.33        .
  total               4.708     1000    0.004    0.005    0.005    0.010    0.001   100.00  1569.33    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.779     1000    0.002    0.003    0.003    0.009    0.001    27.00   100.00        .
  init                3.686     1000    0.003    0.004    0.004    0.009    0.001    35.82   132.64        .
  parse               0.810     1000    0.000    0.001    0.001    0.002    0.000     7.87    29.15        .
  check               2.906     1000    0.002    0.003    0.003    0.009    0.001    28.24   104.57        .
  eval                2.855     1000    0.002    0.003    0.003    0.008    0.001    27.74   102.73        .
  total              10.291     1000    0.009    0.010    0.010    0.023    0.002   100.00   370.31    0.008
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.619      100    0.024    0.026    0.026    0.036    0.002    37.29   100.00        .
  init                3.851      100    0.035    0.039    0.038    0.055    0.003    54.83   147.04        .
  parse               0.088      100    0.000    0.001    0.001    0.002    0.000     1.25     3.36        .
  check               0.308      100    0.002    0.003    0.003    0.005    0.001     4.38    11.76        .
  eval                2.773      100    0.024    0.028    0.027    0.042    0.003    39.48   105.88        .
  total               7.024      100    0.065    0.070    0.069    0.086    0.005   100.00   268.19    0.044
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.671       10    0.256    0.267    0.264    0.280    0.008    42.03   100.00        .
  init                3.693       10    0.359    0.369    0.368    0.389    0.009    58.11   138.26        .
  parse               0.010       10    0.001    0.001    0.001    0.001    0.000     0.16     0.37        .
  check               0.026       10    0.002    0.003    0.003    0.003    0.001     0.41     0.97        .
  eval                2.626       10    0.252    0.263    0.261    0.277    0.008    41.32    98.32        .
  total               6.355       10    0.619    0.636    0.630    0.663    0.015   100.00   237.93    0.368
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.724        1    2.724    2.724    2.724    2.724        .    43.26   100.00        .
  init                3.655        1    3.655    3.655    3.655    3.655        .    58.04   134.18        .
  parse               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check               0.003        1    0.003    0.003    0.003    0.003        .     0.05     0.11        .
  eval                2.638        1    2.638    2.638    2.638    2.638        .    41.89    96.84        .
  total               6.297        1    6.297    6.297    6.297    6.297        .   100.00   231.17    3.573
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.278     1000    0.000    0.000    0.000    0.001    0.000     6.46   100.00        .
  init                0.509     1000    0.000    0.001    0.001    0.002    0.001    11.83   183.09        .
  parse               0.627     1000    0.000    0.001    0.001    0.002    0.000    14.58   225.54        .
  check               2.840     1000    0.002    0.003    0.003    0.007    0.001    66.03  1021.58        .
  eval                0.298     1000    0.000    0.000    0.000    0.001    0.000     6.93   107.19        .
  total               4.301     1000    0.004    0.004    0.004    0.010    0.001   100.00  1547.12    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.156     1000    0.002    0.002    0.002    0.005    0.000    20.81   100.00        .
  init                4.663     1000    0.004    0.005    0.005    0.008    0.001    45.01   216.28        .
  parse               0.617     1000    0.000    0.001    0.001    0.002    0.000     5.96    28.62        .
  check               2.853     1000    0.002    0.003    0.003    0.007    0.001    27.54   132.33        .
  eval                2.208     1000    0.002    0.002    0.002    0.004    0.000    21.31   102.41        .
  total              10.361     1000    0.009    0.010    0.010    0.018    0.001   100.00   480.57    0.008
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.127      100    0.020    0.021    0.021    0.024    0.001    24.98   100.00        .
  init                5.964      100    0.055    0.060    0.059    0.070    0.002    70.04   280.39        .
  parse               0.071      100    0.000    0.001    0.001    0.001    0.000     0.83     3.34        .
  check               0.279      100    0.002    0.003    0.003    0.004    0.001     3.28    13.12        .
  eval                2.195      100    0.020    0.022    0.022    0.026    0.001    25.78   103.20        .
  total               8.515      100    0.080    0.085    0.085    0.095    0.002   100.00   400.33    0.064
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.131       10    0.209    0.213    0.212    0.217    0.002    30.50   100.00        .
  init                4.810       10    0.474    0.481    0.481    0.487    0.004    68.84   225.72        .
  parse               0.005       10    0.000    0.001    0.000    0.001    0.001     0.07     0.23        .
  check               0.031       10    0.002    0.003    0.003    0.004    0.001     0.44     1.45        .
  eval                2.141       10    0.209    0.214    0.211    0.231    0.007    30.64   100.47        .
  total               6.987       10    0.689    0.699    0.696    0.715    0.009   100.00   327.87    0.486
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.125        1    2.125    2.125    2.125    2.125        .    30.44   100.00        .
  init                4.763        1    4.763    4.763    4.763    4.763        .    68.22   224.14        .
  parse               0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.05        .
  check               0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.09        .
  eval                2.216        1    2.216    2.216    2.216    2.216        .    31.74   104.28        .
  total               6.982        1    6.982    6.982    6.982    6.982        .   100.00   328.56    4.857
--------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.124      100    0.001    0.001    0.001    0.003    0.000     0.99   100.00        .
  init                0.078      100    0.000    0.001    0.001    0.001    0.000     0.62    62.90        .
  parse               0.347      100    0.003    0.003    0.003    0.007    0.001     2.77   279.84        .
  check              11.940      100    0.115    0.119    0.118    0.186    0.007    95.27  9629.03        .
  eval                0.165      100    0.001    0.002    0.002    0.003    0.001     1.32   133.06        .
  total              12.533      100    0.120    0.125    0.124    0.192    0.007   100.00 10107.26    0.124
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.067      100    0.010    0.011    0.011    0.015    0.001     7.88   100.00        .
  init                0.167      100    0.001    0.002    0.002    0.003    0.001     1.23    15.65        .
  parse               0.335      100    0.003    0.003    0.003    0.006    0.001     2.47    31.40        .
  check              11.903      100    0.115    0.119    0.118    0.142    0.003    87.90  1115.56        .
  eval                1.133      100    0.010    0.011    0.011    0.017    0.001     8.37   106.19        .
  total              13.542      100    0.131    0.135    0.135    0.160    0.004   100.00  1269.17    0.125
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.081       10    0.104    0.108    0.108    0.113    0.002    44.69   100.00        .
  init                0.128       10    0.012    0.013    0.013    0.014    0.001     5.29    11.84        .
  parse               0.033       10    0.003    0.003    0.003    0.004    0.000     1.36     3.05        .
  check               1.181       10    0.116    0.118    0.117    0.123    0.002    48.82   109.25        .
  eval                1.077       10    0.105    0.108    0.107    0.114    0.003    44.52    99.63        .
  total               2.419       10    0.239    0.242    0.241    0.246    0.003   100.00   223.77    0.134
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.068        1    1.068    1.068    1.068    1.068        .    78.94   100.00        .
  init                0.123        1    0.123    0.123    0.123    0.123        .     9.09    11.52        .
  parse               0.003        1    0.003    0.003    0.003    0.003        .     0.22     0.28        .
  check               0.116        1    0.116    0.116    0.116    0.116        .     8.57    10.86        .
  eval                1.111        1    1.111    1.111    1.111    1.111        .    82.11   104.03        .
  total               1.353        1    1.353    1.353    1.353    1.353        .   100.00   126.69    0.285
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               10.875        1   10.875   10.875   10.875   10.875        .    88.55   100.00        .
  init                1.252        1    1.252    1.252    1.252    1.252        .    10.19    11.51        .
  parse               0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check               0.123        1    0.123    0.123    0.123    0.123        .     1.00     1.13        .
  eval               10.903        1   10.903   10.903   10.903   10.903        .    88.78   100.26        .
  total              12.281        1   12.281   12.281   12.281   12.281        .   100.00   112.93    1.406
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.137      100    0.001    0.001    0.001    0.002    0.000     1.09   100.00        .
  init                0.088      100    0.000    0.001    0.001    0.002    0.000     0.70    64.23        .
  parse               0.360      100    0.003    0.004    0.004    0.005    0.001     2.87   262.77        .
  check              11.904      100    0.115    0.119    0.119    0.130    0.003    95.06  8689.05        .
  eval                0.167      100    0.001    0.002    0.002    0.003    0.001     1.33   121.90        .
  total              12.522      100    0.120    0.125    0.125    0.136    0.003   100.00  9140.15    0.124
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.118      100    0.010    0.011    0.011    0.013    0.001     8.03   100.00        .
  init                0.374      100    0.003    0.004    0.004    0.006    0.001     2.69    33.45        .
  parse               0.328      100    0.003    0.003    0.003    0.005    0.000     2.36    29.34        .
  check              11.890      100    0.114    0.119    0.118    0.160    0.005    85.40  1063.51        .
  eval                1.326      100    0.012    0.013    0.013    0.016    0.001     9.52   118.60        .
  total              13.923      100    0.135    0.139    0.138    0.181    0.005   100.00  1245.35    0.128
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.899       10    0.281    0.290    0.287    0.314    0.010    60.97   100.00        .
  init                0.628       10    0.058    0.063    0.061    0.069    0.003    13.21    21.66        .
  parse               0.035       10    0.003    0.004    0.003    0.005    0.001     0.74     1.21        .
  check               1.207       10    0.115    0.121    0.119    0.137    0.006    25.38    41.64        .
  eval                2.884       10    0.285    0.288    0.287    0.295    0.003    60.65    99.48        .
  total               4.755       10    0.466    0.475    0.472    0.501    0.010   100.00   164.02    0.186
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.099        1    1.099    1.099    1.099    1.099        .    70.99   100.00        .
  init                0.324        1    0.324    0.324    0.324    0.324        .    20.93    29.48        .
  parse               0.003        1    0.003    0.003    0.003    0.003        .     0.19     0.27        .
  check               0.120        1    0.120    0.120    0.120    0.120        .     7.75    10.92        .
  eval                1.101        1    1.101    1.101    1.101    1.101        .    71.12   100.18        .
  total               1.548        1    1.548    1.548    1.548    1.548        .   100.00   140.86    0.449
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               10.909        1   10.909   10.909   10.909   10.909        .    75.21   100.00        .
  init                3.281        1    3.281    3.281    3.281    3.281        .    22.62    30.08        .
  parse               0.004        1    0.004    0.004    0.004    0.004        .     0.03     0.04        .
  check               0.121        1    0.121    0.121    0.121    0.121        .     0.83     1.11        .
  eval               11.099        1   11.099   11.099   11.099   11.099        .    76.52   101.74        .
  total              14.505        1   14.505   14.505   14.505   14.505        .   100.00   132.96    3.596
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.129      100    0.001    0.001    0.001    0.003    0.000     0.95   100.00        .
  init                0.069      100    0.000    0.001    0.001    0.002    0.000     0.51    53.49        .
  parse               0.254      100    0.002    0.003    0.002    0.005    0.001     1.86   196.90        .
  check              13.147      100    0.127    0.131    0.130    0.158    0.004    96.52 10191.47        .
  eval                0.147      100    0.001    0.001    0.001    0.002    0.001     1.08   113.95        .
  total              13.621      100    0.131    0.136    0.136    0.162    0.005   100.00 10558.91    0.135
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.088      100    0.010    0.011    0.011    0.013    0.001     7.22   100.00        .
  init                0.532      100    0.005    0.005    0.005    0.007    0.001     3.53    48.90        .
  parse               0.235      100    0.002    0.002    0.002    0.004    0.001     1.56    21.60        .
  check              13.157      100    0.127    0.132    0.131    0.142    0.003    87.34  1209.28        .
  eval                1.137      100    0.010    0.011    0.011    0.018    0.001     7.55   104.50        .
  total              15.064      100    0.145    0.151    0.150    0.161    0.003   100.00  1384.56    0.140
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.098       10    0.107    0.110    0.109    0.112    0.002    35.39   100.00        .
  init                0.647       10    0.063    0.065    0.064    0.068    0.002    20.85    58.93        .
  parse               0.024       10    0.002    0.002    0.002    0.003    0.001     0.77     2.19        .
  check               1.310       10    0.128    0.131    0.131    0.136    0.002    42.22   119.31        .
  eval                1.122       10    0.108    0.112    0.110    0.121    0.004    36.16   102.19        .
  total               3.103       10    0.302    0.310    0.310    0.319    0.005   100.00   282.60    0.200
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                1.087        1    1.087    1.087    1.087    1.087        .    62.04   100.00        .
  init                0.511        1    0.511    0.511    0.511    0.511        .    29.17    47.01        .
  parse               0.002        1    0.002    0.002    0.002    0.002        .     0.11     0.18        .
  check               0.129        1    0.129    0.129    0.129    0.129        .     7.36    11.87        .
  eval                1.110        1    1.110    1.110    1.110    1.110        .    63.36   102.12        .
  total               1.752        1    1.752    1.752    1.752    1.752        .   100.00   161.18    0.665
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               10.954        1   10.954   10.954   10.954   10.954        .    66.26   100.00        .
  init                5.116        1    5.116    5.116    5.116    5.116        .    30.95    46.70        .
  parse               0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check               0.131        1    0.131    0.131    0.131    0.131        .     0.79     1.20        .
  eval               11.281        1   11.281   11.281   11.281   11.281        .    68.24   102.99        .
  total              16.531        1   16.531   16.531   16.531   16.531        .   100.00   150.91    5.577
--------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.013        1    0.013    0.013    0.013    0.013        .     0.18   100.00        .
  init                0.001        1    0.001    0.001    0.001    0.001        .     0.01     7.69        .
  parse               0.144        1    0.144    0.144    0.144    0.144        .     2.00  1107.69        .
  check               7.027        1    7.027    7.027    7.027    7.027        .    97.79 54053.85        .
  eval                0.014        1    0.014    0.014    0.014    0.014        .     0.19   107.69        .
  total               7.186        1    7.186    7.186    7.186    7.186        .   100.00 55276.92    7.173
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.095        1    0.095    0.095    0.095    0.095        .     0.84   100.00        .
  init                0.001        1    0.001    0.001    0.001    0.001        .     0.01     1.05        .
  parse               0.144        1    0.144    0.144    0.144    0.144        .     1.27   151.58        .
  check              11.095        1   11.095   11.095   11.095   11.095        .    97.83 11678.95        .
  eval                0.101        1    0.101    0.101    0.101    0.101        .     0.89   106.32        .
  total              11.341        1   11.341   11.341   11.341   11.341        .   100.00 11937.89   11.246
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.919        1    0.919    0.919    0.919    0.919        .     7.60   100.00        .
  init                0.013        1    0.013    0.013    0.013    0.013        .     0.11     1.41        .
  parse               0.146        1    0.146    0.146    0.146    0.146        .     1.21    15.89        .
  check              11.010        1   11.010   11.010   11.010   11.010        .    91.01  1198.04        .
  eval                0.929        1    0.929    0.929    0.929    0.929        .     7.68   101.09        .
  total              12.098        1   12.098   12.098   12.098   12.098        .   100.00  1316.43   11.179
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                9.390        1    9.390    9.390    9.390    9.390        .    44.93   100.00        .
  init                0.124        1    0.124    0.124    0.124    0.124        .     0.59     1.32        .
  parse               0.145        1    0.145    0.145    0.145    0.145        .     0.69     1.54        .
  check              11.154        1   11.154   11.154   11.154   11.154        .    53.37   118.79        .
  eval                9.474        1    9.474    9.474    9.474    9.474        .    45.33   100.89        .
  total              20.898        1   20.898   20.898   20.898   20.898        .   100.00   222.56   11.508
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               94.716        1   94.716   94.716   94.716   94.716        .    89.13   100.00        .
  init                1.240        1    1.240    1.240    1.240    1.240        .     1.17     1.31        .
  parse               0.154        1    0.154    0.154    0.154    0.154        .     0.14     0.16        .
  check              11.157        1   11.157   11.157   11.157   11.157        .    10.50    11.78        .
  eval               93.714        1   93.714   93.714   93.714   93.714        .    88.19    98.94        .
  total             106.266        1  106.266  106.266  106.266  106.266        .   100.00   112.19   11.550
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.019        1    0.019    0.019    0.019    0.019        .     0.27   100.00        .
  init                0.002        1    0.002    0.002    0.002    0.002        .     0.03    10.53        .
  parse               0.157        1    0.157    0.157    0.157    0.157        .     2.20   826.32        .
  check               6.964        1    6.964    6.964    6.964    6.964        .    97.59 36652.63        .
  eval                0.013        1    0.013    0.013    0.013    0.013        .     0.18    68.42        .
  total               7.136        1    7.136    7.136    7.136    7.136        .   100.00 37557.89    7.117
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.100        1    0.100    0.100    0.100    0.100        .     0.89   100.00        .
  init                0.004        1    0.004    0.004    0.004    0.004        .     0.04     4.00        .
  parse               0.142        1    0.142    0.142    0.142    0.142        .     1.26   142.00        .
  check              11.027        1   11.027   11.027   11.027   11.027        .    97.77 11027.00        .
  eval                0.105        1    0.105    0.105    0.105    0.105        .     0.93   105.00        .
  total              11.278        1   11.278   11.278   11.278   11.278        .   100.00 11278.00   11.178
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.556        1    2.556    2.556    2.556    2.556        .    18.54   100.00        .
  init                0.064        1    0.064    0.064    0.064    0.064        .     0.46     2.50        .
  parse               0.143        1    0.143    0.143    0.143    0.143        .     1.04     5.59        .
  check              11.033        1   11.033   11.033   11.033   11.033        .    80.04   431.65        .
  eval                2.545        1    2.545    2.545    2.545    2.545        .    18.46    99.57        .
  total              13.785        1   13.785   13.785   13.785   13.785        .   100.00   539.32   11.229
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                9.909        1    9.909    9.909    9.909    9.909        .    46.17   100.00        .
  init                0.329        1    0.329    0.329    0.329    0.329        .     1.53     3.32        .
  parse               0.143        1    0.143    0.143    0.143    0.143        .     0.67     1.44        .
  check              11.133        1   11.133   11.133   11.133   11.133        .    51.88   112.35        .
  eval                9.854        1    9.854    9.854    9.854    9.854        .    45.92    99.44        .
  total              21.460        1   21.460   21.460   21.460   21.460        .   100.00   216.57   11.551
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               96.243        1   96.243   96.243   96.243   96.243        .    87.93   100.00        .
  init                3.340        1    3.340    3.340    3.340    3.340        .     3.05     3.47        .
  parse               0.144        1    0.144    0.144    0.144    0.144        .     0.13     0.15        .
  check              11.068        1   11.068   11.068   11.068   11.068        .    10.11    11.50        .
  eval               94.903        1   94.903   94.903   94.903   94.903        .    86.70    98.61        .
  total             109.457        1  109.457  109.457  109.457  109.457        .   100.00   113.73   13.214
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.014        1    0.014    0.014    0.014    0.014        .     0.20   100.00        .
  init                0.002        1    0.002    0.002    0.002    0.002        .     0.03    14.29        .
  parse               0.079        1    0.079    0.079    0.079    0.079        .     1.13   564.29        .
  check               6.874        1    6.874    6.874    6.874    6.874        .    98.64 49100.00        .
  eval                0.014        1    0.014    0.014    0.014    0.014        .     0.20   100.00        .
  total               6.969        1    6.969    6.969    6.969    6.969        .   100.00 49778.57    6.955
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.105        1    0.105    0.105    0.105    0.105        .     0.85   100.00        .
  init                0.007        1    0.007    0.007    0.007    0.007        .     0.06     6.67        .
  parse               0.067        1    0.067    0.067    0.067    0.067        .     0.54    63.81        .
  check              12.237        1   12.237   12.237   12.237   12.237        .    98.50 11654.29        .
  eval                0.111        1    0.111    0.111    0.111    0.111        .     0.89   105.71        .
  total              12.423        1   12.423   12.423   12.423   12.423        .   100.00 11831.43   12.318
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.026        1    2.026    2.026    2.026    2.026        .    13.98   100.00        .
  init                0.110        1    0.110    0.110    0.110    0.110        .     0.76     5.43        .
  parse               0.067        1    0.067    0.067    0.067    0.067        .     0.46     3.31        .
  check              12.223        1   12.223   12.223   12.223   12.223        .    84.35   603.31        .
  eval                2.090        1    2.090    2.090    2.090    2.090        .    14.42   103.16        .
  total              14.491        1   14.491   14.491   14.491   14.491        .   100.00   715.25   12.465
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base               10.654        1   10.654   10.654   10.654   10.654        .    46.54   100.00        .
  init                0.571        1    0.571    0.571    0.571    0.571        .     2.49     5.36        .
  parse               0.070        1    0.070    0.070    0.070    0.070        .     0.31     0.66        .
  check              12.244        1   12.244   12.244   12.244   12.244        .    53.49   114.92        .
  eval               10.006        1   10.006   10.006   10.006   10.006        .    43.71    93.92        .
  total              22.892        1   22.892   22.892   22.892   22.892        .   100.00   214.87   12.238
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base              100.943        1  100.943  100.943  100.943  100.943        .    85.26   100.00        .
  init                5.544        1    5.544    5.544    5.544    5.544        .     4.68     5.49        .
  parse               0.065        1    0.065    0.065    0.065    0.065        .     0.05     0.06        .
  check              12.212        1   12.212   12.212   12.212   12.212        .    10.32    12.10        .
  eval              100.567        1  100.567  100.567  100.567  100.567        .    84.95    99.63        .
  total             118.388        1  118.388  118.388  118.388  118.388        .   100.00   117.28   17.445
--------------------------------------------------------------------------------------------------------------

. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.308     1000    0.000    0.000    0.000    0.001    0.000    27.21   100.00        .
  init                0.074     1000    0.000    0.000    0.000    0.001    0.000     6.54    24.03        .
  parse               0.663     1000    0.000    0.001    0.001    0.002    0.000    58.57   215.26        .
  check               0.004     1000    0.000    0.000    0.000    0.001    0.000     0.35     1.30        .
  eval                0.364     1000    0.000    0.000    0.000    0.003    0.000    32.16   118.18        .
  total               1.132     1000    0.001    0.001    0.001    0.003    0.000   100.00   367.53    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.839     1000    0.002    0.003    0.003    0.006    0.001    75.89   100.00        .
  init                0.089     1000    0.000    0.000    0.000    0.001    0.000     2.38     3.13        .
  parse               0.713     1000    0.000    0.001    0.001    0.002    0.000    19.06    25.11        .
  check               0.001     1000    0.000    0.000    0.000    0.001    0.000     0.03     0.04        .
  eval                2.918     1000    0.002    0.003    0.003    0.006    0.000    78.00   102.78        .
  total               3.741     1000    0.003    0.004    0.004    0.007    0.001   100.00   131.77    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                6.310      100    0.060    0.063    0.063    0.068    0.001    99.06   100.00        .
  init                0.015      100    0.000    0.000    0.000    0.002    0.000     0.24     0.24        .
  parse               0.067      100    0.000    0.001    0.001    0.002    0.000     1.05     1.06        .
  check               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                6.286      100    0.060    0.063    0.063    0.069    0.002    98.68    99.62        .
  total               6.370      100    0.061    0.064    0.063    0.069    0.002   100.00   100.95    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.809       10    0.272    0.281    0.278    0.295    0.008    99.61   100.00        .
  init                0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  parse               0.008       10    0.000    0.001    0.001    0.001    0.000     0.28     0.28        .
  check               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                2.811       10    0.274    0.281    0.278    0.295    0.008    99.68   100.07        .
  total               2.820       10    0.274    0.282    0.279    0.296    0.008   100.00   100.39    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.553        1    2.553    2.553    2.553    2.553        .    98.72   100.00        .
  init                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse               0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  check               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                2.585        1    2.585    2.585    2.585    2.585        .    99.96   101.25        .
  total               2.586        1    2.586    2.586    2.586    2.586        .   100.00   101.29    0.033
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.350     1000    0.000    0.000    0.000    0.004    0.000    29.59   100.00        .
  init                0.083     1000    0.000    0.000    0.000    0.001    0.000     7.02    23.71        .
  parse               0.680     1000    0.000    0.001    0.001    0.003    0.000    57.48   194.29        .
  check               0.004     1000    0.000    0.000    0.000    0.001    0.000     0.34     1.14        .
  eval                0.384     1000    0.000    0.000    0.000    0.001    0.000    32.46   109.71        .
  total               1.183     1000    0.001    0.001    0.001    0.003    0.000   100.00   338.00    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.630     1000    0.002    0.003    0.003    0.005    0.001    77.54   100.00        .
  init                0.079     1000    0.000    0.000    0.000    0.001    0.000     2.33     3.00        .
  parse               0.656     1000    0.000    0.001    0.001    0.002    0.000    19.34    24.94        .
  check               0.002     1000    0.000    0.000    0.000    0.001    0.000     0.06     0.08        .
  eval                2.632     1000    0.002    0.003    0.003    0.005    0.001    77.59   100.08        .
  total               3.392     1000    0.003    0.003    0.003    0.006    0.001   100.00   128.97    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.605      100    0.024    0.026    0.026    0.034    0.002    95.35   100.00        .
  init                0.008      100    0.000    0.000    0.000    0.001    0.000     0.29     0.31        .
  parse               0.075      100    0.000    0.001    0.001    0.002    0.000     2.75     2.88        .
  check               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                2.647      100    0.024    0.026    0.026    0.033    0.002    96.89   101.61        .
  total               2.732      100    0.025    0.027    0.026    0.034    0.002   100.00   104.88    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.646       10    0.256    0.265    0.264    0.273    0.006    98.25   100.00        .
  init                0.003       10    0.000    0.000    0.000    0.001    0.000     0.11     0.11        .
  parse               0.007       10    0.000    0.001    0.001    0.001    0.000     0.26     0.26        .
  check               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                2.682       10    0.255    0.268    0.267    0.278    0.008    99.59   101.36        .
  total               2.693       10    0.256    0.269    0.268    0.280    0.008   100.00   101.78    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.564        1    2.564    2.564    2.564    2.564        .    98.62   100.00        .
  init                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                2.599        1    2.599    2.599    2.599    2.599        .    99.96   101.37        .
  total               2.600        1    2.600    2.600    2.600    2.600        .   100.00   101.40    0.036
--------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                0.305     1000    0.000    0.000    0.000    0.003    0.000    31.15   100.00        .
  init                0.077     1000    0.000    0.000    0.000    0.001    0.000     7.87    25.25        .
  parse               0.563     1000    0.000    0.001    0.001    0.002    0.001    57.51   184.59        .
  check               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.51     1.64        .
  eval                0.309     1000    0.000    0.000    0.000    0.001    0.000    31.56   101.31        .
  total               0.979     1000    0.000    0.001    0.001    0.003    0.000   100.00   320.98    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.250     1000    0.002    0.002    0.002    0.008    0.001    78.26   100.00        .
  init                0.085     1000    0.000    0.000    0.000    0.001    0.000     2.96     3.78        .
  parse               0.540     1000    0.000    0.001    0.001    0.003    0.001    18.78    24.00        .
  check               0.004     1000    0.000    0.000    0.000    0.001    0.000     0.14     0.18        .
  eval                2.218     1000    0.002    0.002    0.002    0.007    0.000    77.15    98.58        .
  total               2.875     1000    0.002    0.003    0.003    0.008    0.001   100.00   127.78    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.200      100    0.020    0.022    0.021    0.032    0.002    98.17   100.00        .
  init                0.008      100    0.000    0.000    0.000    0.001    0.000     0.36     0.36        .
  parse               0.056      100    0.000    0.001    0.001    0.001    0.000     2.50     2.55        .
  check               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                2.176      100    0.020    0.022    0.021    0.030    0.002    97.10    98.91        .
  total               2.241      100    0.021    0.022    0.022    0.031    0.002   100.00   101.86    0.000
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.192       10    0.215    0.219    0.217    0.226    0.004   100.09   100.00        .
  init                0.001       10    0.000    0.000    0.000    0.001    0.000     0.05     0.05        .
  parse               0.004       10    0.000    0.000    0.000    0.001    0.001     0.18     0.18        .
  check               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  eval                2.185       10    0.210    0.218    0.218    0.226    0.005    99.77    99.68        .
  total               2.190       10    0.210    0.219    0.218    0.227    0.005   100.00    99.91   -0.000
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
Name                  Total        N      min     mean   median      max       sd   %total    %base     diff
  base                2.169        1    2.169    2.169    2.169    2.169        .   101.40   100.00        .
  init                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse               0.001        1    0.001    0.001    0.001    0.001        .     0.05     0.05        .
  check               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  eval                2.138        1    2.138    2.138    2.138    2.138        .    99.95    98.57        .
  total               2.139        1    2.139    2.139    2.139    2.139        .   100.00    98.62   -0.030
--------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  24 Sep 2024, 21:42:29
------------------------------------------------------------------------------------------------------------------------
