---------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  21 Aug 2024, 11:24:40

. 
. dis "`c(current_date)'"
21 Aug 2024

. dis "`c(current_time)'"
11:24:40

. 
. profile_obs_integer, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.192     1000    0.000    0.000    0.000    0.001    0.000     4.53   100.00        .
        init          0.170     1000    0.000    0.000    0.000    0.003    0.000     4.01    88.54        .
       parse          0.543     1000    0.000    0.001    0.001    0.001    0.000    12.81   282.81        .
       check          3.134     1000    0.002    0.003    0.003    0.007    0.001    73.93  1632.29        .
        eval          0.242     1000    0.000    0.000    0.000    0.004    0.000     5.71   126.04        .
       total          4.239     1000    0.003    0.004    0.004    0.009    0.001   100.00  2207.81    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.567     1000    0.001    0.002    0.002    0.004    0.001    22.95   100.00        .
        init          1.372     1000    0.001    0.001    0.001    0.003    0.000    20.09    87.56        .
       parse          0.535     1000    0.000    0.001    0.001    0.002    0.001     7.84    34.14        .
       check          3.003     1000    0.002    0.003    0.003    0.006    0.000    43.98   191.64        .
        eval          1.773     1000    0.001    0.002    0.002    0.006    0.001    25.97   113.15        .
       total          6.828     1000    0.006    0.007    0.007    0.013    0.001   100.00   435.74    0.005
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.634      100    0.015    0.016    0.016    0.023    0.001    46.75   100.00        .
        init          1.426      100    0.013    0.014    0.014    0.023    0.002    40.80    87.27        .
       parse          0.057      100    0.000    0.001    0.001    0.001    0.000     1.63     3.49        .
       check          0.321      100    0.002    0.003    0.003    0.008    0.001     9.18    19.65        .
        eval          1.675      100    0.015    0.017    0.016    0.022    0.001    47.93   102.51        .
       total          3.495      100    0.032    0.035    0.034    0.043    0.002   100.00   213.89    0.019
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.458       10    0.138    0.146    0.142    0.159    0.006    53.33   100.00        .
        init          1.258       10    0.118    0.126    0.122    0.159    0.012    46.01    86.28        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.26     0.48        .
       check          0.030       10    0.003    0.003    0.003    0.003    0.000     1.10     2.06        .
        eval          1.439       10    0.140    0.144    0.143    0.151    0.003    52.63    98.70        .
       total          2.734       10    0.262    0.273    0.271    0.314    0.015   100.00   187.52    0.128
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.244       10    1.379    1.424    1.433    1.462    0.025    52.88   100.00        .
        init         12.516       10    1.209    1.252    1.250    1.306    0.028    46.46    87.87        .
       parse          0.005       10    0.000    0.001    0.000    0.002    0.001     0.02     0.04        .
       check          0.033       10    0.003    0.003    0.003    0.005    0.001     0.12     0.23        .
        eval         14.383       10    1.421    1.438    1.432    1.488    0.019    53.39   100.98        .
       total         26.939       10    2.634    2.694    2.687    2.743    0.034   100.00   189.13    1.270
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.212     1000    0.000    0.000    0.000    0.001    0.000     5.24   100.00        .
        init          0.050     1000    0.000    0.000    0.000    0.001    0.000     1.23    23.58        .
       parse          0.504     1000    0.000    0.001    0.001    0.002    0.001    12.45   237.74        .
       check          3.088     1000    0.002    0.003    0.003    0.008    0.001    76.27  1456.60        .
        eval          0.253     1000    0.000    0.000    0.000    0.003    0.000     6.25   119.34        .
       total          4.049     1000    0.003    0.004    0.004    0.011    0.001   100.00  1909.91    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.582     1000    0.001    0.002    0.002    0.004    0.001    27.11   100.00        .
        init          0.293     1000    0.000    0.000    0.000    0.001    0.000     5.02    18.52        .
       parse          0.459     1000    0.000    0.000    0.000    0.002    0.001     7.87    29.01        .
       check          3.026     1000    0.002    0.003    0.003    0.054    0.002    51.86   191.28        .
        eval          1.886     1000    0.001    0.002    0.002    0.007    0.001    32.32   119.22        .
       total          5.835     1000    0.005    0.006    0.006    0.060    0.002   100.00   368.84    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.445      100    0.015    0.024    0.019    0.087    0.011    70.56   100.00        .
        init          0.625      100    0.003    0.006    0.004    0.168    0.016    18.04    25.56        .
       parse          0.055      100    0.000    0.001    0.001    0.003    0.001     1.59     2.25        .
       check          0.303      100    0.002    0.003    0.003    0.005    0.001     8.74    12.39        .
        eval          2.467      100    0.015    0.025    0.021    0.044    0.009    71.20   100.90        .
       total          3.465      100    0.022    0.035    0.028    0.209    0.020   100.00   141.72    0.010
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.505       10    0.142    0.150    0.150    0.167    0.006    88.27   100.00        .
        init          0.145       10    0.013    0.014    0.014    0.018    0.002     8.50     9.63        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.35     0.40        .
       check          0.027       10    0.002    0.003    0.003    0.003    0.000     1.58     1.79        .
        eval          1.527       10    0.145    0.153    0.152    0.166    0.006    89.56   101.46        .
       total          1.705       10    0.163    0.171    0.168    0.184    0.007   100.00   113.29    0.020
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.749       10    1.437    1.475    1.456    1.552    0.038    89.94   100.00        .
        init          1.397       10    0.135    0.140    0.138    0.145    0.003     8.52     9.47        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.02     0.03        .
       check          0.034       10    0.002    0.003    0.003    0.005    0.001     0.21     0.23        .
        eval         14.960       10    1.453    1.496    1.491    1.526    0.022    91.23   101.43        .
       total         16.398       10    1.597    1.640    1.637    1.673    0.024   100.00   111.18    0.165
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.190     1000    0.000    0.000    0.000    0.005    0.000     5.80   100.00        .
        init          0.543     1000    0.000    0.001    0.001    0.002    0.001    16.59   285.79        .
       parse          0.443     1000    0.000    0.000    0.000    0.002    0.001    13.53   233.16        .
       check          1.933     1000    0.001    0.002    0.002    0.004    0.001    59.04  1017.37        .
        eval          0.211     1000    0.000    0.000    0.000    0.001    0.000     6.44   111.05        .
       total          3.274     1000    0.002    0.003    0.003    0.007    0.001   100.00  1723.16    0.003
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.467     1000    0.001    0.001    0.001    0.005    0.001    17.53   100.00        .
        init          4.654     1000    0.004    0.005    0.005    0.007    0.001    55.62   317.25        .
       parse          0.444     1000    0.000    0.000    0.000    0.002    0.000     5.31    30.27        .
       check          1.751     1000    0.001    0.002    0.002    0.004    0.000    20.93   119.36        .
        eval          1.403     1000    0.001    0.001    0.001    0.003    0.000    16.77    95.64        .
       total          8.367     1000    0.007    0.008    0.008    0.012    0.001   100.00   570.35    0.007
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.385      100    0.013    0.014    0.013    0.020    0.001    18.99   100.00        .
        init          5.630      100    0.053    0.056    0.055    0.082    0.003    77.18   406.50        .
       parse          0.051      100    0.000    0.001    0.001    0.001    0.001     0.70     3.68        .
       check          0.183      100    0.001    0.002    0.002    0.004    0.001     2.51    13.21        .
        eval          1.408      100    0.013    0.014    0.014    0.025    0.002    19.30   101.66        .
       total          7.295      100    0.069    0.073    0.072    0.099    0.004   100.00   526.71    0.059
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.363       10    0.132    0.136    0.135    0.144    0.003    12.21   100.00        .
        init          9.740       10    0.948    0.974    0.967    1.016    0.024    87.28   714.60        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.04     0.37        .
       check          0.021       10    0.001    0.002    0.002    0.005    0.001     0.19     1.54        .
        eval          1.390       10    0.131    0.139    0.136    0.166    0.010    12.46   101.98        .
       total         11.160       10    1.083    1.116    1.112    1.156    0.024   100.00   818.78    0.980
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         13.786       10    1.350    1.379    1.362    1.490    0.042     6.08   100.00        .
        init        212.613       10   20.709   21.261   21.238   22.072    0.481    93.78  1542.24        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.00     0.04        .
       check          0.017       10    0.001    0.002    0.002    0.002    0.000     0.01     0.12        .
        eval         14.078       10    1.346    1.408    1.401    1.479    0.042     6.21   102.12        .
       total        226.714       10   22.103   22.671   22.649   23.428    0.489   100.00  1644.52   21.293
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  21 Aug 2024, 11:32:02
---------------------------------------------------------------------------------------------------------------------------------------------------
