----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  22 Sep 2024, 21:22:04

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.364     1000    0.000    0.000    0.000    0.002    0.000     8.63   100.00        .
        init          0.247     1000    0.000    0.000    0.000    0.002    0.000     5.86    67.86        .
       parse          0.734     1000    0.000    0.001    0.001    0.005    0.000    17.40   201.65        .
       check          2.779     1000    0.002    0.003    0.003    0.006    0.001    65.88   763.46        .
        eval          0.430     1000    0.000    0.000    0.000    0.002    0.000    10.19   118.13        .
       total          4.218     1000    0.003    0.004    0.004    0.010    0.001   100.00  1158.79    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.879     1000    0.002    0.003    0.003    0.008    0.001    35.05   100.00        .
        init          1.487     1000    0.001    0.001    0.001    0.004    0.001    18.10    51.65        .
       parse          0.754     1000    0.000    0.001    0.001    0.002    0.000     9.18    26.19        .
       check          2.738     1000    0.002    0.003    0.003    0.006    0.001    33.33    95.10        .
        eval          3.210     1000    0.002    0.003    0.003    0.016    0.001    39.08   111.50        .
       total          8.214     1000    0.007    0.008    0.008    0.026    0.001   100.00   285.31    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.146      100    0.030    0.031    0.031    0.037    0.002    58.87   100.00        .
        init          1.533      100    0.014    0.015    0.015    0.020    0.001    28.69    48.73        .
       parse          0.075      100    0.000    0.001    0.001    0.001    0.000     1.40     2.38        .
       check          0.285      100    0.002    0.003    0.003    0.004    0.000     5.33     9.06        .
        eval          3.449      100    0.030    0.034    0.034    0.045    0.004    64.54   109.63        .
       total          5.344      100    0.048    0.053    0.053    0.066    0.004   100.00   169.87    0.022
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.696       10    0.257    0.270    0.269    0.281    0.008    68.65   100.00        .
        init          1.262       10    0.123    0.126    0.124    0.140    0.005    32.14    46.81        .
       parse          0.010       10    0.001    0.001    0.001    0.001    0.000     0.25     0.37        .
       check          0.025       10    0.002    0.003    0.002    0.003    0.001     0.64     0.93        .
        eval          2.630       10    0.251    0.263    0.255    0.284    0.012    66.97    97.55        .
       total          3.927       10    0.378    0.393    0.382    0.415    0.015   100.00   145.66    0.123
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.603        1    2.603    2.603    2.603    2.603        .    65.88   100.00        .
        init          1.241        1    1.241    1.241    1.241    1.241        .    31.41    47.68        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
       check          0.002        1    0.002    0.002    0.002    0.002        .     0.05     0.08        .
        eval          2.706        1    2.706    2.706    2.706    2.706        .    68.49   103.96        .
       total          3.951        1    3.951    3.951    3.951    3.951        .   100.00   151.79    1.348
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.351     1000    0.000    0.000    0.000    0.004    0.001    12.51   100.00        .
        init          0.314     1000    0.000    0.000    0.000    0.001    0.000    11.19    89.46        .
       parse          0.663     1000    0.000    0.001    0.001    0.002    0.000    23.63   188.89        .
       check          1.365     1000    0.001    0.001    0.001    0.005    0.001    48.65   388.89        .
        eval          0.429     1000    0.000    0.000    0.000    0.002    0.000    15.29   122.22        .
       total          2.806     1000    0.002    0.003    0.003    0.009    0.001   100.00   799.43    0.002
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.704     1000    0.002    0.003    0.003    0.009    0.001    34.16   100.00        .
        init          2.936     1000    0.002    0.003    0.003    0.006    0.000    37.09   108.58        .
       parse          0.759     1000    0.000    0.001    0.001    0.013    0.001     9.59    28.07        .
       check          1.388     1000    0.001    0.001    0.001    0.003    0.001    17.53    51.33        .
        eval          2.803     1000    0.002    0.003    0.003    0.010    0.001    35.41   103.66        .
       total          7.916     1000    0.007    0.008    0.008    0.029    0.001   100.00   292.75    0.005
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.645      100    0.025    0.026    0.026    0.036    0.002    41.34   100.00        .
        init          3.297      100    0.031    0.033    0.033    0.040    0.002    51.53   124.65        .
       parse          0.089      100    0.000    0.001    0.001    0.001    0.000     1.39     3.36        .
       check          0.145      100    0.001    0.001    0.001    0.002    0.000     2.27     5.48        .
        eval          2.862      100    0.025    0.029    0.028    0.041    0.003    44.73   108.20        .
       total          6.398      100    0.059    0.064    0.064    0.078    0.003   100.00   241.89    0.038
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.690       10    0.259    0.269    0.265    0.296    0.011    23.12   100.00        .
        init          8.944       10    0.825    0.894    0.867    1.010    0.062    76.87   332.49        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.06     0.26        .
       check          0.014       10    0.001    0.001    0.001    0.002    0.001     0.12     0.52        .
        eval          2.668       10    0.257    0.267    0.267    0.280    0.007    22.93    99.18        .
       total         11.635       10    1.085    1.163    1.137    1.289    0.068   100.00   432.53    0.894
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.922        1    2.922    2.922    2.922    2.922        .    12.24   100.00        .
        init         21.013        1   21.013   21.013   21.013   21.013        .    88.05   719.13        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.03        .
       check          0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.03        .
        eval          2.849        1    2.849    2.849    2.849    2.849        .    11.94    97.50        .
       total         23.864        1   23.864   23.864   23.864   23.864        .   100.00   816.70   20.942
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.304     1000    0.000    0.000    0.000    0.004    0.000     6.75   100.00        .
        init          0.555     1000    0.000    0.001    0.001    0.003    0.001    12.33   182.57        .
       parse          0.594     1000    0.000    0.001    0.001    0.002    0.000    13.19   195.39        .
       check          2.970     1000    0.002    0.003    0.003    0.008    0.001    65.97   976.97        .
        eval          0.364     1000    0.000    0.000    0.000    0.001    0.000     8.09   119.74        .
       total          4.502     1000    0.004    0.005    0.004    0.012    0.001   100.00  1480.92    0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.395     1000    0.002    0.002    0.002    0.011    0.001    22.03   100.00        .
        init          4.947     1000    0.004    0.005    0.005    0.013    0.001    45.51   206.56        .
       parse          0.573     1000    0.000    0.001    0.001    0.002    0.000     5.27    23.92        .
       check          2.923     1000    0.002    0.003    0.003    0.006    0.001    26.89   122.05        .
        eval          2.396     1000    0.002    0.002    0.002    0.006    0.001    22.04   100.04        .
       total         10.870     1000    0.009    0.011    0.010    0.022    0.001   100.00   453.86    0.008
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.210      100    0.021    0.022    0.022    0.032    0.002    25.40   100.00        .
        init          6.088      100    0.057    0.061    0.060    0.074    0.003    69.96   275.48        .
       parse          0.057      100    0.000    0.001    0.001    0.001    0.000     0.66     2.58        .
       check          0.287      100    0.002    0.003    0.003    0.004    0.001     3.30    12.99        .
        eval          2.268      100    0.020    0.023    0.022    0.039    0.002    26.06   102.62        .
       total          8.702      100    0.082    0.087    0.086    0.105    0.004   100.00   393.76    0.065
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.193       10    0.211    0.219    0.219    0.230    0.006    15.66   100.00        .
        init         11.789       10    1.147    1.179    1.167    1.249    0.030    84.20   537.57        .
       parse          0.009       10    0.000    0.001    0.001    0.001    0.000     0.06     0.41        .
       check          0.028       10    0.002    0.003    0.003    0.004    0.001     0.20     1.28        .
        eval          2.175       10    0.212    0.217    0.218    0.222    0.004    15.53    99.18        .
       total         14.001       10    1.364    1.400    1.391    1.473    0.032   100.00   638.44    1.181
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.182        1    2.182    2.182    2.182    2.182        .    10.35   100.00        .
        init         18.876        1   18.876   18.876   18.876   18.876        .    89.58   865.08        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.003        1    0.003    0.003    0.003    0.003        .     0.01     0.14        .
        eval          2.192        1    2.192    2.192    2.192    2.192        .    10.40   100.46        .
       total         21.072        1   21.072   21.072   21.072   21.072        .   100.00   965.72   18.890
--------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.140      100    0.001    0.001    0.001    0.006    0.001     1.10   100.00        .
        init          0.030      100    0.000    0.000    0.000    0.002    0.000     0.24    21.43        .
       parse          0.346      100    0.003    0.003    0.003    0.006    0.001     2.73   247.14        .
       check         12.096      100    0.115    0.121    0.119    0.181    0.007    95.30  8640.00        .
        eval          0.218      100    0.002    0.002    0.002    0.006    0.001     1.72   155.71        .
       total         12.693      100    0.121    0.127    0.125    0.191    0.007   100.00  9066.43    0.126
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.119      100    0.010    0.011    0.011    0.019    0.001     8.12   100.00        .
        init          0.131      100    0.001    0.001    0.001    0.002    0.000     0.95    11.71        .
       parse          0.330      100    0.003    0.003    0.003    0.006    0.001     2.40    29.49        .
       check         12.079      100    0.116    0.121    0.120    0.137    0.004    87.68  1079.45        .
        eval          1.229      100    0.011    0.012    0.012    0.023    0.002     8.92   109.83        .
       total         13.777      100    0.132    0.138    0.137    0.153    0.004   100.00  1231.19    0.127
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.101       10    0.106    0.110    0.109    0.117    0.003    44.20   100.00        .
        init          0.124       10    0.012    0.012    0.012    0.013    0.001     4.98    11.26        .
       parse          0.034       10    0.003    0.003    0.003    0.005    0.001     1.36     3.09        .
       check          1.213       10    0.115    0.121    0.119    0.137    0.006    48.70   110.17        .
        eval          1.120       10    0.109    0.112    0.110    0.118    0.003    44.96   101.73        .
       total          2.491       10    0.239    0.249    0.247    0.262    0.007   100.00   226.25    0.139
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.161        1    1.161    1.161    1.161    1.161        .    83.83   100.00        .
        init          0.125        1    0.125    0.125    0.125    0.125        .     9.03    10.77        .
       parse          0.005        1    0.005    0.005    0.005    0.005        .     0.36     0.43        .
       check          0.122        1    0.122    0.122    0.122    0.122        .     8.81    10.51        .
        eval          1.133        1    1.133    1.133    1.133    1.133        .    81.81    97.59        .
       total          1.385        1    1.385    1.385    1.385    1.385        .   100.00   119.29    0.224
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         11.368        1   11.368   11.368   11.368   11.368        .    89.80   100.00        .
        init          1.267        1    1.267    1.267    1.267    1.267        .    10.01    11.15        .
       parse          0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
       check          0.126        1    0.126    0.126    0.126    0.126        .     1.00     1.11        .
        eval         11.263        1   11.263   11.263   11.263   11.263        .    88.97    99.08        .
       total         12.659        1   12.659   12.659   12.659   12.659        .   100.00   111.36    1.291
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.138      100    0.001    0.001    0.001    0.004    0.001     5.46   100.00        .
        init          0.049      100    0.000    0.000    0.000    0.001    0.001     1.94    35.51        .
       parse          0.307      100    0.002    0.003    0.003    0.005    0.001    12.14   222.46        .
       check          1.963      100    0.018    0.020    0.019    0.030    0.002    77.65  1422.46        .
        eval          0.207      100    0.001    0.002    0.002    0.006    0.001     8.19   150.00        .
       total          2.528      100    0.023    0.025    0.024    0.038    0.003   100.00  1831.88    0.024
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.135      100    0.010    0.011    0.011    0.021    0.002    30.14   100.00        .
        init          0.335      100    0.003    0.003    0.003    0.005    0.001     8.90    29.52        .
       parse          0.308      100    0.002    0.003    0.003    0.006    0.001     8.18    27.14        .
       check          1.906      100    0.017    0.019    0.019    0.028    0.002    50.61   167.93        .
        eval          1.216      100    0.011    0.012    0.012    0.019    0.001    32.29   107.14        .
       total          3.766      100    0.035    0.038    0.037    0.049    0.003   100.00   331.81    0.026
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.108       10    0.109    0.111    0.110    0.114    0.002    63.75   100.00        .
        init          0.372       10    0.035    0.037    0.037    0.040    0.002    21.40    33.57        .
       parse          0.036       10    0.003    0.004    0.003    0.005    0.001     2.07     3.25        .
       check          0.195       10    0.018    0.019    0.019    0.023    0.002    11.22    17.60        .
        eval          1.135       10    0.109    0.114    0.112    0.120    0.004    65.30   102.44        .
       total          1.738       10    0.167    0.174    0.173    0.184    0.005   100.00   156.86    0.063
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.159        1    1.159    1.159    1.159    1.159        .    55.03   100.00        .
        init          0.937        1    0.937    0.937    0.937    0.937        .    44.49    80.85        .
       parse          0.003        1    0.003    0.003    0.003    0.003        .     0.14     0.26        .
       check          0.018        1    0.018    0.018    0.018    0.018        .     0.85     1.55        .
        eval          1.148        1    1.148    1.148    1.148    1.148        .    54.51    99.05        .
       total          2.106        1    2.106    2.106    2.106    2.106        .   100.00   181.71    0.947
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         11.548        1   11.548   11.548   11.548   11.548        .    35.59   100.00        .
        init         21.278        1   21.278   21.278   21.278   21.278        .    65.57   184.26        .
       parse          0.003        1    0.003    0.003    0.003    0.003        .     0.01     0.03        .
       check          0.018        1    0.018    0.018    0.018    0.018        .     0.06     0.16        .
        eval         11.151        1   11.151   11.151   11.151   11.151        .    34.36    96.56        .
       total         32.450        1   32.450   32.450   32.450   32.450        .   100.00   281.00   20.902
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.139      100    0.001    0.001    0.001    0.002    0.000     0.99   100.00        .
        init          0.075      100    0.000    0.001    0.001    0.001    0.000     0.54    53.96        .
       parse          0.252      100    0.002    0.003    0.002    0.005    0.001     1.80   181.29        .
       check         13.436      100    0.128    0.134    0.134    0.147    0.004    96.15  9666.19        .
        eval          0.206      100    0.001    0.002    0.002    0.004    0.000     1.47   148.20        .
       total         13.974      100    0.133    0.140    0.139    0.153    0.004   100.00 10053.24    0.138
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.247      100    0.011    0.012    0.012    0.020    0.001     7.94   100.00        .
        init          0.575      100    0.005    0.006    0.006    0.009    0.001     3.66    46.11        .
       parse          0.239      100    0.002    0.002    0.002    0.005    0.001     1.52    19.17        .
       check         13.431      100    0.128    0.134    0.133    0.150    0.004    85.52  1077.06        .
        eval          1.457      100    0.013    0.015    0.014    0.026    0.002     9.28   116.84        .
       total         15.705      100    0.150    0.157    0.155    0.175    0.005   100.00  1259.42    0.145
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.355       10    0.228    0.235    0.233    0.256    0.008    49.65   100.00        .
        init          1.084       10    0.098    0.108    0.106    0.126    0.008    22.85    46.03        .
       parse          0.024       10    0.002    0.002    0.002    0.003    0.001     0.51     1.02        .
       check          1.323       10    0.128    0.132    0.132    0.136    0.002    27.89    56.18        .
        eval          2.312       10    0.224    0.231    0.230    0.238    0.005    48.75    98.17        .
       total          4.743       10    0.460    0.474    0.474    0.489    0.009   100.00   201.40    0.239
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.166        1    1.166    1.166    1.166    1.166        .    41.25   100.00        .
        init          1.540        1    1.540    1.540    1.540    1.540        .    54.47   132.08        .
       parse          0.002        1    0.002    0.002    0.002    0.002        .     0.07     0.17        .
       check          0.129        1    0.129    0.129    0.129    0.129        .     4.56    11.06        .
        eval          1.156        1    1.156    1.156    1.156    1.156        .    40.89    99.14        .
       total          2.827        1    2.827    2.827    2.827    2.827        .   100.00   242.45    1.661
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         11.254        1   11.254   11.254   11.254   11.254        .    29.11   100.00        .
        init         27.032        1   27.032   27.032   27.032   27.032        .    69.93   240.20        .
       parse          0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.02        .
       check          0.130        1    0.130    0.130    0.130    0.130        .     0.34     1.16        .
        eval         11.491        1   11.491   11.491   11.491   11.491        .    29.73   102.11        .
       total         38.655        1   38.655   38.655   38.655   38.655        .   100.00   343.48   27.401
--------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.107       10    0.009    0.011    0.011    0.012    0.001     0.15   100.00        .
        init          0.004       10    0.000    0.000    0.000    0.001    0.001     0.01     3.74        .
       parse          1.457       10    0.143    0.146    0.144    0.149    0.002     2.05  1361.68        .
       check         69.503       10    6.754    6.950    6.919    7.152    0.123    97.66 64956.07        .
        eval          0.202       10    0.017    0.020    0.018    0.035    0.006     0.28   188.79        .
       total         71.171       10    6.915    7.117    7.084    7.319    0.127   100.00 66514.95    7.106
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.936       10    0.091    0.094    0.092    0.105    0.004     0.82   100.00        .
        init          0.014       10    0.001    0.001    0.001    0.002    0.001     0.01     1.50        .
       parse          1.507       10    0.144    0.151    0.147    0.174    0.009     1.32   161.00        .
       check        112.000       10   11.032   11.200   11.221   11.304    0.085    97.77 11965.81        .
        eval          1.028       10    0.100    0.103    0.102    0.110    0.003     0.90   109.83        .
       total        114.553       10   11.281   11.455   11.477   11.554    0.088   100.00 12238.57   11.362
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.950        1    0.950    0.950    0.950    0.950        .     7.67   100.00        .
        init          0.012        1    0.012    0.012    0.012    0.012        .     0.10     1.26        .
       parse          0.145        1    0.145    0.145    0.145    0.145        .     1.17    15.26        .
       check         11.232        1   11.232   11.232   11.232   11.232        .    90.65  1182.32        .
        eval          1.000        1    1.000    1.000    1.000    1.000        .     8.07   105.26        .
       total         12.390        1   12.390   12.390   12.390   12.390        .   100.00  1304.21   11.440
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          9.766        1    9.766    9.766    9.766    9.766        .    42.45   100.00        .
        init          0.138        1    0.138    0.138    0.138    0.138        .     0.60     1.41        .
       parse          0.153        1    0.153    0.153    0.153    0.153        .     0.67     1.57        .
       check         13.001        1   13.001   13.001   13.001   13.001        .    56.51   133.13        .
        eval          9.713        1    9.713    9.713    9.713    9.713        .    42.22    99.46        .
       total         23.005        1   23.005   23.005   23.005   23.005        .   100.00   235.56   13.239
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         97.034        1   97.034   97.034   97.034   97.034        .    89.82   100.00        .
        init          1.255        1    1.255    1.255    1.255    1.255        .     1.16     1.29        .
       parse          0.164        1    0.164    0.164    0.164    0.164        .     0.15     0.17        .
       check         11.218        1   11.218   11.218   11.218   11.218        .    10.38    11.56        .
        eval         95.400        1   95.400   95.400   95.400   95.400        .    88.30    98.32        .
       total        108.037        1  108.037  108.037  108.037  108.037        .   100.00   111.34   11.003
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.116       10    0.010    0.012    0.011    0.016    0.002     0.68   100.00        .
        init          0.003       10    0.000    0.000    0.000    0.001    0.000     0.02     2.59        .
       parse          1.475       10    0.142    0.147    0.145    0.164    0.007     8.61  1271.55        .
       check         15.477       10    1.530    1.548    1.544    1.588    0.017    90.30 13342.24        .
        eval          0.183       10    0.017    0.018    0.018    0.022    0.002     1.07   157.76        .
       total         17.140       10    1.690    1.714    1.712    1.751    0.019   100.00 14775.86    1.702
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.991       10    0.096    0.099    0.098    0.110    0.004     5.44   100.00        .
        init          0.041       10    0.004    0.004    0.004    0.005    0.000     0.23     4.14        .
       parse          1.448       10    0.141    0.145    0.143    0.151    0.003     7.95   146.12        .
       check         15.464       10    1.526    1.546    1.540    1.577    0.016    84.92  1560.44        .
        eval          1.253       10    0.120    0.125    0.123    0.141    0.006     6.88   126.44        .
       total         18.211       10    1.794    1.821    1.817    1.856    0.018   100.00  1837.64    1.722
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.623        1    2.623    2.623    2.623    2.623        .    60.68   100.00        .
        init          0.064        1    0.064    0.064    0.064    0.064        .     1.48     2.44        .
       parse          0.144        1    0.144    0.144    0.144    0.144        .     3.33     5.49        .
       check          1.569        1    1.569    1.569    1.569    1.569        .    36.29    59.82        .
        eval          2.545        1    2.545    2.545    2.545    2.545        .    58.87    97.03        .
       total          4.323        1    4.323    4.323    4.323    4.323        .   100.00   164.81    1.700
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         10.070        1   10.070   10.070   10.070   10.070        .    79.59   100.00        .
        init          1.011        1    1.011    1.011    1.011    1.011        .     7.99    10.04        .
       parse          0.149        1    0.149    0.149    0.149    0.149        .     1.18     1.48        .
       check          1.570        1    1.570    1.570    1.570    1.570        .    12.41    15.59        .
        eval          9.922        1    9.922    9.922    9.922    9.922        .    78.42    98.53        .
       total         12.652        1   12.652   12.652   12.652   12.652        .   100.00   125.64    2.582
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         98.996        1   98.996   98.996   98.996   98.996        .    83.46   100.00        .
        init         21.350        1   21.350   21.350   21.350   21.350        .    18.00    21.57        .
       parse          0.145        1    0.145    0.145    0.145    0.145        .     0.12     0.15        .
       check          1.523        1    1.523    1.523    1.523    1.523        .     1.28     1.54        .
        eval         95.601        1   95.601   95.601   95.601   95.601        .    80.59    96.57        .
       total        118.620        1  118.620  118.620  118.620  118.620        .   100.00   119.82   19.624
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.120       10    0.010    0.012    0.011    0.017    0.002     0.18   100.00        .
        init          0.011       10    0.001    0.001    0.001    0.002    0.000     0.02     9.17        .
       parse          0.680       10    0.065    0.068    0.066    0.082    0.005     1.00   566.67        .
       check         67.094       10    6.376    6.709    6.730    6.857    0.130    98.72 55911.67        .
        eval          0.175       10    0.015    0.017    0.016    0.032    0.005     0.26   145.83        .
       total         67.966       10    6.462    6.797    6.814    6.958    0.133   100.00 56638.33    6.785
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(10)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.041       10    0.099    0.104    0.102    0.117    0.006     0.83   100.00        .
        init          0.070       10    0.006    0.007    0.007    0.008    0.001     0.06     6.72        .
       parse          0.678       10    0.066    0.068    0.068    0.070    0.001     0.54    65.13        .
       check        123.888       10   12.225   12.389   12.347   12.778    0.158    98.42 11900.86        .
        eval          1.237       10    0.118    0.124    0.119    0.154    0.011     0.98   118.83        .
       total        125.879       10   12.419   12.588   12.541   13.008    0.168   100.00 12092.12   12.484
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.155        1    1.155    1.155    1.155    1.155        .     8.39   100.00        .
        init          0.129        1    0.129    0.129    0.129    0.129        .     0.94    11.17        .
       parse          0.079        1    0.079    0.079    0.079    0.079        .     0.57     6.84        .
       check         12.421        1   12.421   12.421   12.421   12.421        .    90.25  1075.41        .
        eval          1.133        1    1.133    1.133    1.133    1.133        .     8.23    98.10        .
       total         13.763        1   13.763   13.763   13.763   13.763        .   100.00  1191.60   12.608
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         10.102        1   10.102   10.102   10.102   10.102        .    41.46   100.00        .
        init          1.341        1    1.341    1.341    1.341    1.341        .     5.50    13.27        .
       parse          0.066        1    0.066    0.066    0.066    0.066        .     0.27     0.65        .
       check         12.409        1   12.409   12.409   12.409   12.409        .    50.93   122.84        .
        eval         10.547        1   10.547   10.547   10.547   10.547        .    43.29   104.41        .
       total         24.363        1   24.363   24.363   24.363   24.363        .   100.00   241.17   14.261
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(1000) rep(1)
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base        101.705        1  101.705  101.705  101.705  101.705        .    72.75   100.00        .
        init         26.288        1   26.288   26.288   26.288   26.288        .    18.80    25.85        .
       parse          0.071        1    0.071    0.071    0.071    0.071        .     0.05     0.07        .
       check         12.449        1   12.449   12.449   12.449   12.449        .     8.90    12.24        .
        eval        100.992        1  100.992  100.992  100.992  100.992        .    72.24    99.30        .
       total        139.800        1  139.800  139.800  139.800  139.800        .   100.00   137.46   38.095
--------------------------------------------------------------------------------------------------------------

. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.362     1000    0.000    0.000    0.000    0.003    0.000    29.29   100.00        .
        init          0.076     1000    0.000    0.000    0.000    0.002    0.000     6.15    20.99        .
       parse          0.659     1000    0.000    0.001    0.001    0.003    0.000    53.32   182.04        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.32     1.10        .
        eval          0.477     1000    0.000    0.000    0.000    0.004    0.001    38.59   131.77        .
       total          1.236     1000    0.001    0.001    0.001    0.005    0.000   100.00   341.44    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.918     1000    0.002    0.003    0.003    0.008    0.001    73.72   100.00        .
        init          0.120     1000    0.000    0.000    0.000    0.001    0.000     3.03     4.11        .
       parse          0.651     1000    0.000    0.001    0.001    0.003    0.000    16.45    22.31        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.10     0.14        .
        eval          3.165     1000    0.002    0.003    0.003    0.007    0.000    79.96   108.46        .
       total          3.958     1000    0.003    0.004    0.004    0.009    0.001   100.00   135.64    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          6.473      100    0.062    0.065    0.064    0.074    0.003   100.48   100.00        .
        init          0.010      100    0.000    0.000    0.000    0.001    0.000     0.16     0.15        .
       parse          0.070      100    0.000    0.001    0.001    0.001    0.000     1.09     1.08        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          6.361      100    0.060    0.064    0.062    0.085    0.004    98.74    98.27        .
       total          6.442      100    0.061    0.064    0.063    0.086    0.004   100.00    99.52   -0.000
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.792       10    0.275    0.279    0.277    0.288    0.004   100.32   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.008       10    0.000    0.001    0.001    0.001    0.000     0.29     0.29        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.775       10    0.273    0.278    0.276    0.286    0.004    99.71    99.39        .
       total          2.783       10    0.274    0.278    0.277    0.287    0.004   100.00    99.68   -0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.604        1    2.604    2.604    2.604    2.604        .   100.23   100.00        .
        init          0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          2.597        1    2.597    2.597    2.597    2.597        .    99.96    99.73        .
       total          2.598        1    2.598    2.598    2.598    2.598        .   100.00    99.77   -0.006
--------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.369     1000    0.000    0.000    0.000    0.003    0.001    29.50   100.00        .
        init          0.081     1000    0.000    0.000    0.000    0.001    0.000     6.47    21.95        .
       parse          0.653     1000    0.000    0.001    0.001    0.003    0.000    52.20   176.96        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.48     1.63        .
        eval          0.486     1000    0.000    0.000    0.000    0.002    0.001    38.85   131.71        .
       total          1.251     1000    0.001    0.001    0.001    0.005    0.000   100.00   339.02    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.680     1000    0.002    0.003    0.003    0.006    0.001    76.55   100.00        .
        init          0.072     1000    0.000    0.000    0.000    0.001    0.000     2.06     2.69        .
       parse          0.650     1000    0.000    0.001    0.001    0.002    0.000    18.57    24.25        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.11     0.15        .
        eval          2.751     1000    0.002    0.003    0.003    0.010    0.001    78.58   102.65        .
       total          3.501     1000    0.003    0.004    0.003    0.011    0.001   100.00   130.63    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.684      100    0.025    0.027    0.026    0.043    0.002    96.62   100.00        .
        init          0.012      100    0.000    0.000    0.000    0.001    0.000     0.43     0.45        .
       parse          0.071      100    0.000    0.001    0.001    0.001    0.000     2.56     2.65        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.695      100    0.025    0.027    0.026    0.034    0.002    97.01   100.41        .
       total          2.778      100    0.025    0.028    0.027    0.035    0.002   100.00   103.50    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.674       10    0.260    0.267    0.264    0.287    0.009   101.60   100.00        .
        init          0.002       10    0.000    0.000    0.000    0.001    0.000     0.08     0.07        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.15     0.15        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.626       10    0.255    0.263    0.260    0.275    0.006    99.77    98.20        .
       total          2.632       10    0.256    0.263    0.261    0.276    0.006   100.00    98.43   -0.004
--------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.657        1    2.657    2.657    2.657    2.657        .   100.23   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          2.651        1    2.651    2.651    2.651    2.651        .   100.00    99.77        .
       total          2.651        1    2.651    2.651    2.651    2.651        .   100.00    99.77   -0.006
--------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.304     1000    0.000    0.000    0.000    0.002    0.000    31.02   100.00        .
        init          0.075     1000    0.000    0.000    0.000    0.001    0.000     7.65    24.67        .
       parse          0.516     1000    0.000    0.001    0.001    0.002    0.001    52.65   169.74        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.61     1.97        .
        eval          0.348     1000    0.000    0.000    0.000    0.002    0.000    35.51   114.47        .
       total          0.980     1000    0.000    0.001    0.001    0.003    0.000   100.00   322.37    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.273     1000    0.002    0.002    0.002    0.005    0.000    76.35   100.00        .
        init          0.079     1000    0.000    0.000    0.000    0.001    0.000     2.65     3.48        .
       parse          0.512     1000    0.000    0.001    0.001    0.001    0.001    17.20    22.53        .
       check          0.004     1000    0.000    0.000    0.000    0.001    0.000     0.13     0.18        .
        eval          2.347     1000    0.002    0.002    0.002    0.006    0.001    78.84   103.26        .
       total          2.977     1000    0.002    0.003    0.003    0.007    0.000   100.00   130.97    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.223      100    0.020    0.022    0.022    0.031    0.001    94.00   100.00        .
        init          0.012      100    0.000    0.000    0.000    0.001    0.000     0.51     0.54        .
       parse          0.059      100    0.000    0.001    0.001    0.003    0.001     2.49     2.65        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.290      100    0.021    0.023    0.022    0.034    0.002    96.83   103.01        .
       total          2.365      100    0.022    0.024    0.023    0.034    0.002   100.00   106.39    0.001
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.257       10    0.218    0.226    0.224    0.233    0.005    98.73   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.26     0.27        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.279       10    0.222    0.228    0.224    0.241    0.007    99.69   100.97        .
       total          2.286       10    0.222    0.229    0.225    0.242    0.007   100.00   101.28    0.003
--------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)   nocheck
--------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.240        1    2.240    2.240    2.240    2.240        .    96.68   100.00        .
        init          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
       parse          0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
       check          0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
        eval          2.316        1    2.316    2.316    2.316    2.316        .    99.96   103.39        .
       total          2.317        1    2.317    2.317    2.317    2.317        .   100.00   103.44    0.077
--------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  22 Sep 2024, 21:53:00
----------------------------------------------------------------------------------------------------------------------------------------
