---------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:  21 Aug 2024, 16:45:01

. 
. dis "`c(current_date)'"
21 Aug 2024

. dis "`c(current_time)'"
16:45:01

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. profile_obs_integer, obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.273     1000    0.000    0.000    0.000    0.002    0.000     5.43   100.00        .
        init          0.190     1000    0.000    0.000    0.000    0.002    0.000     3.78    69.60        .
       parse          0.639     1000    0.000    0.001    0.001    0.008    0.001    12.72   234.07        .
       check          3.527     1000    0.002    0.004    0.003    0.013    0.001    70.19  1291.94        .
        eval          0.494     1000    0.000    0.000    0.000    0.011    0.001     9.83   180.95        .
       total          5.025     1000    0.003    0.005    0.005    0.017    0.002   100.00  1840.66    0.005
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.593     1000    0.001    0.005    0.005    0.014    0.002    23.53   100.00        .
        init          3.835     1000    0.001    0.004    0.004    0.015    0.001    19.64    83.50        .
       parse          1.429     1000    0.000    0.001    0.001    0.004    0.001     7.32    31.11        .
       check          8.047     1000    0.002    0.008    0.009    0.019    0.002    41.22   175.20        .
        eval          5.838     1000    0.001    0.006    0.006    0.013    0.002    29.90   127.11        .
       total         19.523     1000    0.006    0.020    0.021    0.038    0.006   100.00   425.06    0.015
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.880      100    0.043    0.049    0.047    0.071    0.005    46.72   100.00        .
        init          4.408      100    0.039    0.044    0.043    0.064    0.004    42.20    90.33        .
       parse          0.169      100    0.001    0.002    0.002    0.003    0.000     1.62     3.46        .
       check          0.917      100    0.008    0.009    0.009    0.016    0.001     8.78    18.79        .
        eval          4.907      100    0.043    0.049    0.049    0.066    0.003    46.98   100.55        .
       total         10.445      100    0.094    0.104    0.103    0.127    0.006   100.00   214.04    0.056
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.267       10    0.414    0.427    0.424    0.443    0.008    51.55   100.00        .
        init          3.712       10    0.354    0.371    0.372    0.387    0.009    44.85    86.99        .
       parse          0.016       10    0.001    0.002    0.002    0.002    0.001     0.19     0.37        .
       check          0.089       10    0.008    0.009    0.009    0.010    0.001     1.08     2.09        .
        eval          4.455       10    0.428    0.446    0.441    0.473    0.014    53.82   104.41        .
       total          8.277       10    0.804    0.828    0.826    0.860    0.015   100.00   193.98    0.401
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         27.715       10    1.419    2.772    1.522    5.230    1.575    55.02   100.00        .
        init         24.259       10    1.223    2.426    1.289    5.433    1.580    48.16    87.53        .
       parse          0.009       10    0.000    0.001    0.001    0.002    0.001     0.02     0.03        .
       check          0.056       10    0.003    0.006    0.003    0.010    0.003     0.11     0.20        .
        eval         26.043       10    1.460    2.604    1.509    4.681    1.455    51.70    93.97        .
       total         50.370       10    2.687    5.037    2.802   10.126    3.016   100.00   181.74    2.265
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.209     1000    0.000    0.000    0.000    0.001    0.000     5.03   100.00        .
        init          0.070     1000    0.000    0.000    0.000    0.001    0.000     1.68    33.49        .
       parse          0.520     1000    0.000    0.001    0.001    0.003    0.001    12.51   248.80        .
       check          3.074     1000    0.002    0.003    0.003    0.009    0.001    73.93  1470.81        .
        eval          0.366     1000    0.000    0.000    0.000    0.003    0.001     8.80   175.12        .
       total          4.158     1000    0.003    0.004    0.004    0.011    0.001   100.00  1989.47    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.813     1000    0.001    0.002    0.002    0.007    0.001    30.60   100.00        .
        init          0.138     1000    0.000    0.000    0.000    0.002    0.000     2.33     7.61        .
       parse          0.538     1000    0.000    0.001    0.001    0.002    0.001     9.08    29.67        .
       check          3.012     1000    0.002    0.003    0.003    0.006    0.001    50.84   166.13        .
        eval          2.083     1000    0.001    0.002    0.002    0.006    0.001    35.16   114.89        .
       total          5.924     1000    0.005    0.006    0.006    0.012    0.001   100.00   326.75    0.004
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.188      100    0.030    0.032    0.032    0.037    0.001    83.35   100.00        .
        init          0.237      100    0.002    0.002    0.002    0.003    0.000     6.20     7.43        .
       parse          0.049      100    0.000    0.000    0.000    0.001    0.001     1.28     1.54        .
       check          0.284      100    0.002    0.003    0.003    0.004    0.000     7.42     8.91        .
        eval          3.242      100    0.030    0.032    0.032    0.039    0.001    84.76   101.69        .
       total          3.825      100    0.036    0.038    0.038    0.045    0.001   100.00   119.98    0.006
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.512       10    0.146    0.151    0.150    0.164    0.005    94.50   100.00        .
        init          0.056       10    0.005    0.006    0.005    0.007    0.001     3.50     3.70        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.25     0.26        .
       check          0.028       10    0.002    0.003    0.003    0.003    0.000     1.75     1.85        .
        eval          1.510       10    0.147    0.151    0.152    0.156    0.003    94.38    99.87        .
       total          1.600       10    0.157    0.160    0.161    0.164    0.002   100.00   105.82    0.009
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         15.163       10    1.475    1.516    1.495    1.639    0.050    95.51   100.00        .
        init          0.451       10    0.042    0.045    0.044    0.051    0.003     2.84     2.97        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.04     0.04        .
       check          0.031       10    0.003    0.003    0.003    0.004    0.000     0.20     0.20        .
        eval         15.385       10    1.500    1.538    1.527    1.652    0.044    96.91   101.46        .
       total         15.875       10    1.545    1.587    1.573    1.700    0.044   100.00   104.70    0.071
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.225     1000    0.000    0.000    0.000    0.003    0.000     6.95   100.00        .
        init          0.464     1000    0.000    0.000    0.000    0.005    0.001    14.33   206.22        .
       parse          0.477     1000    0.000    0.000    0.000    0.003    0.001    14.74   212.00        .
       check          1.826     1000    0.001    0.002    0.002    0.005    0.001    56.41   811.56        .
        eval          0.321     1000    0.000    0.000    0.000    0.004    0.000     9.92   142.67        .
       total          3.237     1000    0.002    0.003    0.003    0.009    0.001   100.00  1438.67    0.003
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.432     1000    0.001    0.001    0.001    0.004    0.001    16.85   100.00        .
        init          4.621     1000    0.004    0.005    0.005    0.010    0.001    54.36   322.70        .
       parse          0.459     1000    0.000    0.000    0.000    0.003    0.001     5.40    32.05        .
       check          1.776     1000    0.001    0.002    0.002    0.006    0.000    20.89   124.02        .
        eval          1.499     1000    0.001    0.001    0.001    0.005    0.001    17.63   104.68        .
       total          8.501     1000    0.008    0.009    0.008    0.014    0.001   100.00   593.65    0.007
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.384      100    0.013    0.014    0.014    0.018    0.001    18.54   100.00        .
        init          5.799      100    0.054    0.058    0.057    0.069    0.003    77.68   419.00        .
       parse          0.051      100    0.000    0.001    0.001    0.001    0.001     0.68     3.68        .
       check          0.175      100    0.001    0.002    0.002    0.003    0.000     2.34    12.64        .
        eval          1.422      100    0.013    0.014    0.014    0.019    0.001    19.05   102.75        .
       total          7.465      100    0.071    0.075    0.074    0.084    0.003   100.00   539.38    0.061
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.380       10    0.135    0.138    0.138    0.144    0.002    11.98   100.00        .
        init         10.123       10    0.988    1.012    1.001    1.047    0.022    87.86   733.55        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.06     0.51        .
       check          0.020       10    0.001    0.002    0.002    0.003    0.001     0.17     1.45        .
        eval          1.370       10    0.133    0.137    0.135    0.149    0.004    11.89    99.28        .
       total         11.522       10    1.128    1.152    1.140    1.199    0.025   100.00   834.93    1.014
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(10)
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         13.823       10    1.360    1.382    1.376    1.433    0.022     5.98   100.00        .
        init        217.079       10   21.097   21.708   21.673   22.403    0.378    93.93  1570.42        .
       parse          0.008       10    0.000    0.001    0.001    0.001    0.000     0.00     0.06        .
       check          0.022       10    0.001    0.002    0.002    0.003    0.001     0.01     0.16        .
        eval         13.983       10    1.361    1.398    1.396    1.451    0.030     6.05   101.16        .
       total        231.101       10   22.496   23.110   23.105   23.776    0.369   100.00  1671.86   21.728
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.214     1000    0.000    0.000    0.000    0.004    0.000    22.99   100.00        .
        init          0.014     1000    0.000    0.000    0.000    0.001    0.000     1.50     6.54        .
       parse          0.459     1000    0.000    0.000    0.000    0.005    0.001    49.30   214.49        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.64     2.80        .
        eval          0.312     1000    0.000    0.000    0.000    0.002    0.000    33.51   145.79        .
       total          0.931     1000    0.000    0.001    0.001    0.006    0.000   100.00   435.05    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.485     1000    0.001    0.001    0.001    0.004    0.001    66.89   100.00        .
        init          0.010     1000    0.000    0.000    0.000    0.001    0.000     0.45     0.67        .
       parse          0.480     1000    0.000    0.000    0.000    0.005    0.001    21.62    32.32        .
       check          0.001     1000    0.000    0.000    0.000    0.001    0.000     0.05     0.07        .
        eval          1.589     1000    0.001    0.002    0.002    0.007    0.001    71.58   107.00        .
       total          2.220     1000    0.002    0.002    0.002    0.007    0.000   100.00   149.49    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.474      100    0.013    0.015    0.014    0.022    0.002    95.71   100.00        .
        init          0.001      100    0.000    0.000    0.000    0.001    0.000     0.06     0.07        .
       parse          0.059      100    0.000    0.001    0.001    0.001    0.000     3.83     4.00        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.468      100    0.013    0.015    0.014    0.019    0.001    95.32    99.59        .
       total          1.540      100    0.014    0.015    0.015    0.019    0.001   100.00   104.48    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.491       10    0.142    0.149    0.148    0.158    0.005    98.22   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.26     0.27        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.512       10    0.142    0.151    0.148    0.166    0.008    99.60   101.41        .
       total          1.518       10    0.143    0.152    0.148    0.167    0.008   100.00   101.81    0.003
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.633       10    1.437    1.463    1.460    1.506    0.018    97.04   100.00        .
        init          0.001       10    0.000    0.000    0.000    0.001    0.000     0.01     0.01        .
       parse          0.001       10    0.000    0.000    0.000    0.001    0.000     0.01     0.01        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval         15.074       10    1.480    1.507    1.498    1.561    0.025    99.96   103.01        .
       total         15.080       10    1.480    1.508    1.498    1.562    0.026   100.00   103.05    0.045
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.218     1000    0.000    0.000    0.000    0.003    0.000    22.11   100.00        .
        init          0.017     1000    0.000    0.000    0.000    0.001    0.000     1.72     7.80        .
       parse          0.507     1000    0.000    0.001    0.001    0.005    0.001    51.42   232.57        .
       check          0.001     1000    0.000    0.000    0.000    0.001    0.000     0.10     0.46        .
        eval          0.336     1000    0.000    0.000    0.000    0.002    0.000    34.08   154.13        .
       total          0.986     1000    0.000    0.001    0.001    0.006    0.000   100.00   452.29    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.788     1000    0.001    0.002    0.002    0.008    0.001    65.81   100.00        .
        init          0.011     1000    0.000    0.000    0.000    0.001    0.000     0.40     0.62        .
       parse          0.507     1000    0.000    0.001    0.001    0.002    0.001    18.66    28.36        .
       check          0.007     1000    0.000    0.000    0.000    0.001    0.000     0.26     0.39        .
        eval          2.034     1000    0.001    0.002    0.002    0.016    0.001    74.86   113.76        .
       total          2.717     1000    0.002    0.003    0.003    0.017    0.001   100.00   151.96    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.125      100    0.015    0.021    0.017    0.037    0.007    93.65   100.00        .
        init          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.051      100    0.000    0.001    0.001    0.001    0.001     2.25     2.40        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          2.204      100    0.016    0.022    0.017    0.038    0.007    97.14   103.72        .
       total          2.269      100    0.017    0.023    0.018    0.038    0.007   100.00   106.78    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.549       10    0.146    0.155    0.152    0.168    0.007   100.85   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.39     0.39        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.529       10    0.148    0.153    0.152    0.160    0.004    99.54    98.71        .
       total          1.536       10    0.149    0.154    0.152    0.161    0.004   100.00    99.16   -0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         15.052       10    1.485    1.505    1.499    1.548    0.021    97.70   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.04     0.04        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval         15.396       10    1.492    1.540    1.526    1.583    0.030    99.94   102.29        .
       total         15.406       10    1.493    1.541    1.527    1.584    0.030   100.00   102.35    0.035
---------------------------------------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.217     1000    0.000    0.000    0.000    0.005    0.000    23.95   100.00        .
        init          0.008     1000    0.000    0.000    0.000    0.001    0.000     0.88     3.69        .
       parse          0.459     1000    0.000    0.000    0.000    0.004    0.001    50.66   211.52        .
       check          0.006     1000    0.000    0.000    0.000    0.001    0.000     0.66     2.76        .
        eval          0.290     1000    0.000    0.000    0.000    0.003    0.000    32.01   133.64        .
       total          0.906     1000    0.000    0.001    0.001    0.005    0.001   100.00   417.51    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    rep(1000) nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.422     1000    0.001    0.001    0.001    0.005    0.001    69.37   100.00        .
        init          0.007     1000    0.000    0.000    0.000    0.001    0.000     0.34     0.49        .
       parse          0.425     1000    0.000    0.000    0.000    0.001    0.000    20.73    29.89        .
       check          0.002     1000    0.000    0.000    0.000    0.001    0.000     0.10     0.14        .
        eval          1.470     1000    0.001    0.001    0.001    0.006    0.001    71.71   103.38        .
       total          2.050     1000    0.001    0.002    0.002    0.007    0.000   100.00   144.16    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   rep(100)  nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.419      100    0.013    0.014    0.014    0.021    0.001    93.54   100.00        .
        init          0.001      100    0.000    0.000    0.000    0.001    0.000     0.07     0.07        .
       parse          0.050      100    0.000    0.001    0.000    0.001    0.001     3.30     3.52        .
       check          0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.447      100    0.013    0.014    0.014    0.024    0.002    95.39   101.97        .
       total          1.517      100    0.013    0.015    0.015    0.025    0.002   100.00   106.91    0.001
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.432       10    0.138    0.143    0.142    0.156    0.005    98.90   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.004       10    0.000    0.000    0.000    0.001    0.001     0.28     0.28        .
       check          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
        eval          1.442       10    0.139    0.144    0.142    0.152    0.004    99.59   100.70        .
       total          1.448       10    0.140    0.145    0.143    0.153    0.004   100.00   101.12    0.002
---------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) rep(10)   nocheck
---------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.355       10    1.409    1.435    1.422    1.479    0.024   100.34   100.00        .
        init          0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.04     0.04        .
       check          0.001       10    0.000    0.000    0.000    0.001    0.000     0.01     0.01        .
        eval         14.299       10    1.389    1.430    1.430    1.455    0.019    99.95    99.61        .
       total         14.306       10    1.390    1.431    1.430    1.456    0.019   100.00    99.66   -0.005
---------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:  21 Aug 2024, 16:56:46
---------------------------------------------------------------------------------------------------------------------------------------------------
