-----------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 opened on:   6 Oct 2024, 14:08:54

. 
. ///////////////////////////////////////////////////////// Benchmarks with checks
> 
. // 10 levels
. 
. profile_obs_integer, obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.709     1000    0.000    0.001    0.001    0.003    0.000    16.73   246.18        .
  base                     0.288     1000    0.000    0.000    0.000    0.001    0.000     6.80   100.00        .
  init                     0.536     1000    0.000    0.001    0.001    0.004    0.001    12.65   186.11        .
  parse                    0.683     1000    0.000    0.001    0.001    0.001    0.000    16.12   237.15        .
  check                    2.632     1000    0.002    0.003    0.003    0.005    0.001    62.12   913.89        .
  - usefulness             1.106     1000    0.001    0.001    0.001    0.002    0.000    26.10   384.03        .
    - is_useful() 1        1.006     1000    0.000    0.001    0.001    0.002    0.000    23.74   349.31        .
  - combine                0.049     1000    0.000    0.000    0.000    0.001    0.000     1.16    17.01        .
  - exhaustiveness         1.402     1000    0.001    0.001    0.001    0.003    0.001    33.09   486.81        .
    - is_useful() 2        1.349     1000    0.001    0.001    0.001    0.003    0.000    31.84   468.40        .
  - compress               0.004     1000    0.000    0.000    0.000    0.001    0.000     0.09     1.39        .
  - print                  0.026     1000    0.000    0.000    0.000    0.001    0.000     0.61     9.03        .
  + Overlap()              1.247     1000    0.000    0.001    0.001    0.003    0.001    29.43   432.99        .
  + Difference()           0.768     1000    0.000    0.001    0.001    0.003    0.001    18.13   266.67        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.363     1000    0.000    0.000    0.000    0.001    0.000     8.57   126.04        .
  total                    4.237     1000    0.004    0.004    0.004    0.009    0.000   100.00  1471.18    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.203     1000    0.001    0.002    0.002    0.003    0.000    31.32    81.20        .
  base                     2.713     1000    0.002    0.003    0.003    0.007    0.001    38.57   100.00        .
  init                     0.843     1000    0.000    0.001    0.001    0.004    0.000    11.98    31.07        .
  parse                    0.736     1000    0.000    0.001    0.001    0.002    0.000    10.46    27.13        .
  check                    2.637     1000    0.002    0.003    0.003    0.005    0.001    37.49    97.20        .
  - usefulness             1.088     1000    0.001    0.001    0.001    0.003    0.000    15.47    40.10        .
    - is_useful() 1        0.987     1000    0.000    0.001    0.001    0.003    0.000    14.03    36.38        .
  - combine                0.051     1000    0.000    0.000    0.000    0.001    0.000     0.73     1.88        .
  - exhaustiveness         1.428     1000    0.001    0.001    0.001    0.003    0.001    20.30    52.64        .
    - is_useful() 2        1.365     1000    0.001    0.001    0.001    0.003    0.000    19.41    50.31        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.07     0.18        .
  - print                  0.025     1000    0.000    0.000    0.000    0.001    0.000     0.36     0.92        .
  + Overlap()              1.278     1000    0.000    0.001    0.001    0.004    0.001    18.17    47.11        .
  + Difference()           0.765     1000    0.000    0.001    0.001    0.003    0.001    10.88    28.20        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.791     1000    0.002    0.003    0.003    0.006    0.000    39.68   102.88        .
  total                    7.034     1000    0.006    0.007    0.007    0.012    0.001   100.00   259.27    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.417      100    0.013    0.014    0.014    0.019    0.001    36.89    48.48        .
  base                     2.923      100    0.028    0.029    0.029    0.033    0.001    76.10   100.00        .
  init                     0.520      100    0.005    0.005    0.005    0.006    0.000    13.54    17.79        .
  parse                    0.082      100    0.000    0.001    0.001    0.002    0.000     2.13     2.81        .
  check                    0.265      100    0.002    0.003    0.003    0.006    0.001     6.90     9.07        .
  - usefulness             0.103      100    0.001    0.001    0.001    0.002    0.000     2.68     3.52        .
    - is_useful() 1        0.093      100    0.000    0.001    0.001    0.002    0.000     2.42     3.18        .
  - combine                0.005      100    0.000    0.000    0.000    0.001    0.000     0.13     0.17        .
  - exhaustiveness         0.146      100    0.001    0.001    0.001    0.003    0.001     3.80     4.99        .
    - is_useful() 2        0.139      100    0.001    0.001    0.001    0.003    0.001     3.62     4.76        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.002      100    0.000    0.000    0.000    0.001    0.000     0.05     0.07        .
  + Overlap()              0.127      100    0.000    0.001    0.001    0.004    0.001     3.31     4.34        .
  + Difference()           0.079      100    0.000    0.001    0.001    0.002    0.001     2.06     2.70        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.970      100    0.028    0.030    0.029    0.042    0.002    77.32   101.61        .
  total                    3.841      100    0.037    0.038    0.038    0.052    0.002   100.00   131.41    0.009
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.872       10    0.176    0.187    0.183    0.214    0.011    63.91    76.66        .
  base                     2.442       10    0.241    0.244    0.243    0.249    0.003    83.37   100.00        .
  init                     0.448       10    0.043    0.045    0.044    0.049    0.002    15.30    18.35        .
  parse                    0.006       10    0.000    0.001    0.001    0.001    0.001     0.20     0.25        .
  check                    0.026       10    0.002    0.003    0.003    0.003    0.001     0.89     1.06        .
  - usefulness             0.010       10    0.001    0.001    0.001    0.001    0.000     0.34     0.41        .
    - is_useful() 1        0.010       10    0.001    0.001    0.001    0.001    0.000     0.34     0.41        .
  - combine                0.001       10    0.000    0.000    0.000    0.001    0.000     0.03     0.04        .
  - exhaustiveness         0.015       10    0.001    0.002    0.001    0.002    0.001     0.51     0.61        .
    - is_useful() 2        0.014       10    0.001    0.001    0.001    0.002    0.001     0.48     0.57        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.015       10    0.000    0.002    0.001    0.003    0.001     0.51     0.61        .
  + Difference()           0.005       10    0.000    0.001    0.000    0.002    0.001     0.17     0.20        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.448       10    0.242    0.245    0.244    0.248    0.002    83.58   100.25        .
  total                    2.929       10    0.289    0.293    0.292    0.298    0.003   100.00   119.94    0.049
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.017        1    3.017    3.017    3.017    3.017        .   104.14   124.31        .
  base                     2.427        1    2.427    2.427    2.427    2.427        .    83.78   100.00        .
  init                     0.432        1    0.432    0.432    0.432    0.432        .    14.91    17.80        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  check                    0.002        1    0.002    0.002    0.002    0.002        .     0.07     0.08        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
    - is_useful() 1        0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
    - is_useful() 2        0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  + Difference()           0.001        1    0.001    0.001    0.001    0.001        .     0.03     0.04        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.462        1    2.462    2.462    2.462    2.462        .    84.98   101.44        .
  total                    2.897        1    2.897    2.897    2.897    2.897        .   100.00   119.37    0.470
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.712     1000    0.000    0.001    0.001    0.003    0.000    15.96   238.13        .
  base                     0.299     1000    0.000    0.000    0.000    0.002    0.000     6.70   100.00        .
  init                     0.748     1000    0.000    0.001    0.001    0.002    0.000    16.77   250.17        .
  parse                    0.712     1000    0.000    0.001    0.001    0.002    0.000    15.96   238.13        .
  check                    2.649     1000    0.002    0.003    0.003    0.005    0.001    59.38   885.95        .
  - usefulness             1.090     1000    0.001    0.001    0.001    0.003    0.000    24.43   364.55        .
    - is_useful() 1        0.983     1000    0.000    0.001    0.001    0.003    0.000    22.04   328.76        .
  - combine                0.052     1000    0.000    0.000    0.000    0.001    0.000     1.17    17.39        .
  - exhaustiveness         1.438     1000    0.001    0.001    0.001    0.003    0.001    32.23   480.94        .
    - is_useful() 2        1.393     1000    0.001    0.001    0.001    0.003    0.000    31.23   465.89        .
  - compress               0.006     1000    0.000    0.000    0.000    0.001    0.000     0.13     2.01        .
  - print                  0.027     1000    0.000    0.000    0.000    0.001    0.000     0.61     9.03        .
  + Overlap()              1.305     1000    0.000    0.001    0.001    0.003    0.001    29.25   436.45        .
  + Difference()           0.734     1000    0.000    0.001    0.001    0.002    0.001    16.45   245.48        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.330     1000    0.000    0.000    0.000    0.001    0.000     7.40   110.37        .
  total                    4.461     1000    0.004    0.004    0.004    0.008    0.001   100.00  1491.97    0.004
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.313     1000    0.001    0.002    0.002    0.004    0.000    23.36    84.26        .
  base                     2.745     1000    0.002    0.003    0.003    0.006    0.001    27.73   100.00        .
  init                     3.527     1000    0.003    0.004    0.004    0.008    0.001    35.63   128.49        .
  parse                    0.738     1000    0.000    0.001    0.001    0.002    0.000     7.45    26.89        .
  check                    2.669     1000    0.002    0.003    0.003    0.006    0.001    26.96    97.23        .
  - usefulness             1.116     1000    0.001    0.001    0.001    0.003    0.000    11.27    40.66        .
    - is_useful() 1        1.024     1000    0.000    0.001    0.001    0.002    0.000    10.34    37.30        .
  - combine                0.047     1000    0.000    0.000    0.000    0.001    0.000     0.47     1.71        .
  - exhaustiveness         1.440     1000    0.001    0.001    0.001    0.003    0.001    14.55    52.46        .
    - is_useful() 2        1.367     1000    0.001    0.001    0.001    0.003    0.000    13.81    49.80        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.05     0.18        .
  - print                  0.019     1000    0.000    0.000    0.000    0.001    0.000     0.19     0.69        .
  + Overlap()              1.266     1000    0.000    0.001    0.001    0.004    0.001    12.79    46.12        .
  + Difference()           0.795     1000    0.000    0.001    0.001    0.003    0.001     8.03    28.96        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.932     1000    0.002    0.003    0.003    0.007    0.001    29.62   106.81        .
  total                    9.900     1000    0.009    0.010    0.010    0.018    0.001   100.00   360.66    0.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.617      100    0.015    0.016    0.016    0.019    0.001    12.99    27.87        .
  base                     5.801      100    0.056    0.058    0.058    0.068    0.002    46.61   100.00        .
  init                     6.166      100    0.058    0.062    0.061    0.068    0.002    49.54   106.29        .
  parse                    0.074      100    0.000    0.001    0.001    0.002    0.000     0.59     1.28        .
  check                    0.268      100    0.002    0.003    0.003    0.004    0.001     2.15     4.62        .
  - usefulness             0.111      100    0.001    0.001    0.001    0.002    0.000     0.89     1.91        .
    - is_useful() 1        0.101      100    0.000    0.001    0.001    0.002    0.000     0.81     1.74        .
  - combine                0.007      100    0.000    0.000    0.000    0.001    0.000     0.06     0.12        .
  - exhaustiveness         0.140      100    0.001    0.001    0.001    0.003    0.001     1.12     2.41        .
    - is_useful() 2        0.131      100    0.001    0.001    0.001    0.002    0.000     1.05     2.26        .
  - compress               0.002      100    0.000    0.000    0.000    0.001    0.000     0.02     0.03        .
  - print                  0.003      100    0.000    0.000    0.000    0.001    0.000     0.02     0.05        .
  + Overlap()              0.135      100    0.000    0.001    0.001    0.003    0.001     1.08     2.33        .
  + Difference()           0.062      100    0.000    0.001    0.000    0.002    0.001     0.50     1.07        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     5.934      100    0.057    0.059    0.059    0.065    0.002    47.68   102.29        .
  total                   12.446      100    0.120    0.124    0.124    0.134    0.003   100.00   214.55    0.066
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.885       10    0.176    0.189    0.184    0.225    0.014    30.46    73.40        .
  base                     2.568       10    0.249    0.257    0.251    0.289    0.013    41.50   100.00        .
  init                     3.610       10    0.350    0.361    0.357    0.383    0.010    58.34   140.58        .
  parse                    0.009       10    0.000    0.001    0.001    0.002    0.001     0.15     0.35        .
  check                    0.027       10    0.002    0.003    0.003    0.003    0.000     0.44     1.05        .
  - usefulness             0.010       10    0.001    0.001    0.001    0.001    0.000     0.16     0.39        .
    - is_useful() 1        0.007       10    0.000    0.001    0.001    0.001    0.000     0.11     0.27        .
  - combine                0.002       10    0.000    0.000    0.000    0.001    0.000     0.03     0.08        .
  - exhaustiveness         0.015       10    0.001    0.002    0.001    0.002    0.001     0.24     0.58        .
    - is_useful() 2        0.015       10    0.001    0.002    0.001    0.002    0.001     0.24     0.58        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.015       10    0.000    0.002    0.001    0.003    0.001     0.24     0.58        .
  + Difference()           0.006       10    0.000    0.001    0.000    0.002    0.001     0.10     0.23        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.542       10    0.250    0.254    0.253    0.265    0.005    41.08    98.99        .
  total                    6.188       10    0.605    0.619    0.614    0.652    0.014   100.00   240.97    0.362
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.002        1    3.002    3.002    3.002    3.002        .    48.54   121.69        .
  base                     2.467        1    2.467    2.467    2.467    2.467        .    39.89   100.00        .
  init                     3.636        1    3.636    3.636    3.636    3.636        .    58.79   147.39        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  check                    0.003        1    0.003    0.003    0.003    0.003        .     0.05     0.12        .
  - usefulness             0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
    - is_useful() 1        0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.08        .
    - is_useful() 2        0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.08        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.08        .
  + Difference()           0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.04        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.545        1    2.545    2.545    2.545    2.545        .    41.15   103.16        .
  total                    6.185        1    6.185    6.185    6.185    6.185        .   100.00   250.71    3.718
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.279     1000    0.001    0.001    0.001    0.002    0.000    45.83   775.15        .
  base                     0.165     1000    0.000    0.000    0.000    0.001    0.000     5.91   100.00        .
  init                     0.514     1000    0.000    0.001    0.001    0.003    0.001    18.42   311.52        .
  parse                    0.443     1000    0.000    0.000    0.000    0.002    0.000    15.87   268.48        .
  check                    1.597     1000    0.001    0.002    0.002    0.004    0.001    57.22   967.88        .
  - usefulness             0.422     1000    0.000    0.000    0.000    0.002    0.000    15.12   255.76        .
    - is_useful() 1        0.374     1000    0.000    0.000    0.000    0.001    0.000    13.40   226.67        .
  - combine                0.020     1000    0.000    0.000    0.000    0.001    0.000     0.72    12.12        .
  - exhaustiveness         1.107     1000    0.001    0.001    0.001    0.003    0.000    39.66   670.91        .
    - is_useful() 2        1.045     1000    0.001    0.001    0.001    0.003    0.000    37.44   633.33        .
  - compress               0.005     1000    0.000    0.000    0.000    0.001    0.000     0.18     3.03        .
  - print                  0.011     1000    0.000    0.000    0.000    0.001    0.000     0.39     6.67        .
  + Overlap()              0.663     1000    0.000    0.001    0.001    0.002    0.001    23.75   401.82        .
  + Difference()           0.613     1000    0.000    0.001    0.001    0.004    0.001    21.96   371.52        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.214     1000    0.000    0.000    0.000    0.001    0.000     7.67   129.70        .
  total                    2.791     1000    0.002    0.003    0.003    0.008    0.000   100.00  1691.52    0.003
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.084     1000    0.006    0.007    0.007    0.012    0.001    86.29   451.50        .
  base                     1.569     1000    0.001    0.002    0.002    0.004    0.001    19.11   100.00        .
  init                     4.563     1000    0.004    0.005    0.005    0.008    0.001    55.58   290.82        .
  parse                    0.454     1000    0.000    0.000    0.000    0.001    0.000     5.53    28.94        .
  check                    1.595     1000    0.001    0.002    0.002    0.003    0.001    19.43   101.66        .
  - usefulness             0.427     1000    0.000    0.000    0.000    0.001    0.000     5.20    27.21        .
    - is_useful() 1        0.397     1000    0.000    0.000    0.000    0.001    0.000     4.84    25.30        .
  - combine                0.017     1000    0.000    0.000    0.000    0.001    0.000     0.21     1.08        .
  - exhaustiveness         1.094     1000    0.001    0.001    0.001    0.003    0.000    13.33    69.73        .
    - is_useful() 2        1.037     1000    0.001    0.001    0.001    0.003    0.000    12.63    66.09        .
  - compress               0.008     1000    0.000    0.000    0.000    0.001    0.000     0.10     0.51        .
  - print                  0.011     1000    0.000    0.000    0.000    0.001    0.000     0.13     0.70        .
  + Overlap()              0.676     1000    0.000    0.001    0.001    0.003    0.001     8.23    43.08        .
  + Difference()           0.632     1000    0.000    0.001    0.001    0.003    0.001     7.70    40.28        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.573     1000    0.001    0.002    0.002    0.003    0.001    19.16   100.25        .
  total                    8.210     1000    0.007    0.008    0.008    0.013    0.001   100.00   523.26    0.007
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.418      100    0.062    0.064    0.064    0.102    0.004    88.37   420.03        .
  base                     1.528      100    0.014    0.015    0.015    0.019    0.001    21.04   100.00        .
  init                     5.517      100    0.053    0.055    0.055    0.064    0.002    75.96   361.06        .
  parse                    0.048      100    0.000    0.000    0.000    0.001    0.001     0.66     3.14        .
  check                    0.163      100    0.001    0.002    0.002    0.003    0.001     2.24    10.67        .
  - usefulness             0.048      100    0.000    0.000    0.000    0.002    0.001     0.66     3.14        .
    - is_useful() 1        0.043      100    0.000    0.000    0.000    0.002    0.001     0.59     2.81        .
  - combine                0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.112      100    0.001    0.001    0.001    0.002    0.000     1.54     7.33        .
    - is_useful() 2        0.107      100    0.001    0.001    0.001    0.002    0.000     1.47     7.00        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.078      100    0.000    0.001    0.001    0.003    0.001     1.07     5.10        .
  + Difference()           0.062      100    0.000    0.001    0.001    0.002    0.001     0.85     4.06        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.533      100    0.014    0.015    0.015    0.019    0.001    21.11   100.33        .
  total                    7.263      100    0.070    0.073    0.072    0.083    0.002   100.00   475.33    0.057
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.094       10    0.696    0.709    0.710    0.723    0.009   114.60   456.50        .
  base                     1.554       10    0.153    0.155    0.154    0.160    0.003    25.11   100.00        .
  init                     4.618       10    0.455    0.462    0.458    0.471    0.006    74.60   297.17        .
  parse                    0.008       10    0.000    0.001    0.001    0.001    0.000     0.13     0.51        .
  check                    0.013       10    0.001    0.001    0.001    0.002    0.000     0.21     0.84        .
  - usefulness             0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.06        .
    - is_useful() 1        0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.06        .
  - combine                0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - exhaustiveness         0.011       10    0.001    0.001    0.001    0.002    0.000     0.18     0.71        .
    - is_useful() 2        0.010       10    0.001    0.001    0.001    0.001    0.000     0.16     0.64        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.02     0.06        .
  + Overlap()              0.005       10    0.000    0.001    0.000    0.001    0.001     0.08     0.32        .
  + Difference()           0.006       10    0.000    0.001    0.001    0.001    0.001     0.10     0.39        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.551       10    0.150    0.155    0.152    0.163    0.005    25.06    99.81        .
  total                    6.190       10    0.608    0.619    0.617    0.635    0.008   100.00   398.33    0.464
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.347        1    8.347    8.347    8.347    8.347        .   134.96   530.98        .
  base                     1.572        1    1.572    1.572    1.572    1.572        .    25.42   100.00        .
  init                     4.616        1    4.616    4.616    4.616    4.616        .    74.63   293.64        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.13        .
  check                    0.002        1    0.002    0.002    0.002    0.002        .     0.03     0.13        .
  - usefulness             0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
    - is_useful() 1        0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
    - is_useful() 2        0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.001        1    0.001    0.001    0.001    0.001        .     0.02     0.06        .
  + Difference()           0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.565        1    1.565    1.565    1.565    1.565        .    25.30    99.55        .
  total                    6.185        1    6.185    6.185    6.185    6.185        .   100.00   393.45    4.613
-------------------------------------------------------------------------------------------------------------------

. 
. // 100 levels
. 
. profile_obs_integer, obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.085      100    0.000    0.001    0.001    0.002    0.000     0.68    77.27        .
  base                     0.110      100    0.001    0.001    0.001    0.002    0.000     0.88   100.00        .
  init                     0.069      100    0.000    0.001    0.001    0.001    0.000     0.55    62.73        .
  parse                    0.327      100    0.003    0.003    0.003    0.007    0.001     2.63   297.27        .
  check                   11.884      100    0.116    0.119    0.118    0.134    0.003    95.51 10803.64        .
  - usefulness             4.574      100    0.044    0.046    0.045    0.061    0.002    36.76  4158.18        .
    - is_useful() 1        4.445      100    0.040    0.044    0.044    0.057    0.002    35.72  4040.91        .
  - combine                0.084      100    0.000    0.001    0.001    0.002    0.000     0.68    76.36        .
  - exhaustiveness         7.206      100    0.069    0.072    0.071    0.085    0.002    57.91  6550.91        .
    - is_useful() 2        7.156      100    0.069    0.072    0.071    0.083    0.002    57.51  6505.45        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.006      100    0.000    0.000    0.000    0.001    0.000     0.05     5.45        .
  + Overlap()              5.547      100    0.046    0.055    0.056    0.064    0.004    44.58  5042.73        .
  + Difference()           5.011      100    0.043    0.050    0.050    0.059    0.003    40.27  4555.45        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.156      100    0.001    0.002    0.002    0.003    0.001     1.25   141.82        .
  total                   12.443      100    0.121    0.124    0.124    0.140    0.003   100.00 11311.82    0.123
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.203      100    0.001    0.002    0.002    0.003    0.000     1.51    19.37        .
  base                     1.048      100    0.010    0.010    0.010    0.013    0.001     7.82   100.00        .
  init                     0.161      100    0.001    0.002    0.002    0.002    0.000     1.20    15.36        .
  parse                    0.322      100    0.003    0.003    0.003    0.004    0.000     2.40    30.73        .
  check                   11.833      100    0.115    0.118    0.117    0.128    0.003    88.25  1129.10        .
  - usefulness             4.561      100    0.044    0.046    0.045    0.053    0.002    34.02   435.21        .
    - is_useful() 1        4.421      100    0.041    0.044    0.044    0.052    0.002    32.97   421.85        .
  - combine                0.088      100    0.000    0.001    0.001    0.003    0.000     0.66     8.40        .
  - exhaustiveness         7.154      100    0.069    0.072    0.071    0.079    0.002    53.36   682.63        .
    - is_useful() 2        7.098      100    0.068    0.071    0.070    0.079    0.002    52.94   677.29        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.10        .
  - print                  0.005      100    0.000    0.000    0.000    0.001    0.000     0.04     0.48        .
  + Overlap()              5.558      100    0.043    0.056    0.056    0.065    0.004    41.45   530.34        .
  + Difference()           4.986      100    0.043    0.050    0.050    0.061    0.003    37.19   475.76        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.089      100    0.010    0.011    0.011    0.014    0.001     8.12   103.91        .
  total                   13.408      100    0.131    0.134    0.133    0.144    0.003   100.00  1279.39    0.124
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.112       10    0.010    0.011    0.011    0.013    0.001     4.67    10.83        .
  base                     1.034       10    0.102    0.103    0.103    0.108    0.002    43.14   100.00        .
  init                     0.129       10    0.012    0.013    0.013    0.013    0.000     5.38    12.48        .
  parse                    0.031       10    0.003    0.003    0.003    0.004    0.000     1.29     3.00        .
  check                    1.186       10    0.116    0.119    0.118    0.125    0.003    49.48   114.70        .
  - usefulness             0.455       10    0.045    0.045    0.045    0.047    0.001    18.98    44.00        .
    - is_useful() 1        0.438       10    0.041    0.044    0.043    0.047    0.002    18.27    42.36        .
  - combine                0.006       10    0.000    0.001    0.001    0.001    0.001     0.25     0.58        .
  - exhaustiveness         0.722       10    0.070    0.072    0.071    0.077    0.002    30.12    69.83        .
    - is_useful() 2        0.712       10    0.069    0.071    0.070    0.077    0.002    29.70    68.86        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.581       10    0.051    0.058    0.057    0.064    0.004    24.24    56.19        .
  + Difference()           0.480       10    0.042    0.048    0.047    0.052    0.003    20.03    46.42        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.051       10    0.102    0.105    0.104    0.116    0.004    43.85   101.64        .
  total                    2.397       10    0.235    0.240    0.238    0.250    0.005   100.00   231.82    0.136
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.180        1    0.180    0.180    0.180    0.180        .    14.16    17.22        .
  base                     1.045        1    1.045    1.045    1.045    1.045        .    82.22   100.00        .
  init                     0.123        1    0.123    0.123    0.123    0.123        .     9.68    11.77        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.24     0.29        .
  check                    0.116        1    0.116    0.116    0.116    0.116        .     9.13    11.10        .
  - usefulness             0.045        1    0.045    0.045    0.045    0.045        .     3.54     4.31        .
    - is_useful() 1        0.045        1    0.045    0.045    0.045    0.045        .     3.54     4.31        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.08     0.10        .
  - exhaustiveness         0.070        1    0.070    0.070    0.070    0.070        .     5.51     6.70        .
    - is_useful() 2        0.070        1    0.070    0.070    0.070    0.070        .     5.51     6.70        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.057        1    0.057    0.057    0.057    0.057        .     4.48     5.45        .
  + Difference()           0.049        1    0.049    0.049    0.049    0.049        .     3.86     4.69        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.029        1    1.029    1.029    1.029    1.029        .    80.96    98.47        .
  total                    1.271        1    1.271    1.271    1.271    1.271        .   100.00   121.63    0.226
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.998        1    2.998    2.998    2.998    2.998        .    25.64    29.05        .
  base                    10.319        1   10.319   10.319   10.319   10.319        .    88.26   100.00        .
  init                     1.264        1    1.264    1.264    1.264    1.264        .    10.81    12.25        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.03     0.04        .
  check                    0.119        1    0.119    0.119    0.119    0.119        .     1.02     1.15        .
  - usefulness             0.045        1    0.045    0.045    0.045    0.045        .     0.38     0.44        .
    - is_useful() 1        0.045        1    0.045    0.045    0.045    0.045        .     0.38     0.44        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.072        1    0.072    0.072    0.072    0.072        .     0.62     0.70        .
    - is_useful() 2        0.071        1    0.071    0.071    0.071    0.071        .     0.61     0.69        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.054        1    0.054    0.054    0.054    0.054        .     0.46     0.52        .
  + Difference()           0.051        1    0.051    0.051    0.051    0.051        .     0.44     0.49        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.305        1   10.305   10.305   10.305   10.305        .    88.14    99.86        .
  total                   11.692        1   11.692   11.692   11.692   11.692        .   100.00   113.31    1.373
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.080      100    0.000    0.001    0.001    0.002    0.000     0.65    65.57        .
  base                     0.122      100    0.001    0.001    0.001    0.003    0.000     0.99   100.00        .
  init                     0.077      100    0.000    0.001    0.001    0.002    0.000     0.62    63.11        .
  parse                    0.331      100    0.003    0.003    0.003    0.005    0.000     2.68   271.31        .
  check                   11.803      100    0.115    0.118    0.117    0.126    0.002    95.39  9674.59        .
  - usefulness             4.552      100    0.044    0.046    0.045    0.052    0.002    36.79  3731.15        .
    - is_useful() 1        4.421      100    0.040    0.044    0.044    0.051    0.002    35.73  3623.77        .
  - combine                0.085      100    0.000    0.001    0.001    0.003    0.000     0.69    69.67        .
  - exhaustiveness         7.141      100    0.069    0.071    0.071    0.080    0.002    57.71  5853.28        .
    - is_useful() 2        7.087      100    0.069    0.071    0.070    0.079    0.002    57.28  5809.02        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.82        .
  - print                  0.010      100    0.000    0.000    0.000    0.001    0.000     0.08     8.20        .
  + Overlap()              5.624      100    0.047    0.056    0.056    0.068    0.004    45.45  4609.84        .
  + Difference()           4.944      100    0.040    0.049    0.049    0.058    0.003    39.96  4052.46        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.161      100    0.001    0.002    0.002    0.002    0.000     1.30   131.97        .
  total                   12.373      100    0.121    0.124    0.123    0.132    0.002   100.00 10141.80    0.123
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.214      100    0.001    0.002    0.002    0.003    0.001     1.55    19.02        .
  base                     1.125      100    0.010    0.011    0.011    0.019    0.001     8.14   100.00        .
  init                     0.346      100    0.003    0.003    0.003    0.005    0.001     2.50    30.76        .
  parse                    0.332      100    0.003    0.003    0.003    0.006    0.001     2.40    29.51        .
  check                   11.877      100    0.115    0.119    0.118    0.142    0.003    85.89  1055.73        .
  - usefulness             4.571      100    0.044    0.046    0.045    0.056    0.001    33.06   406.31        .
    - is_useful() 1        4.432      100    0.039    0.044    0.044    0.055    0.002    32.05   393.96        .
  - combine                0.087      100    0.000    0.001    0.001    0.002    0.000     0.63     7.73        .
  - exhaustiveness         7.195      100    0.070    0.072    0.071    0.085    0.002    52.03   639.56        .
    - is_useful() 2        7.145      100    0.069    0.071    0.071    0.085    0.003    51.67   635.11        .
  - compress               0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.010      100    0.000    0.000    0.000    0.002    0.000     0.07     0.89        .
  + Overlap()              5.595      100    0.048    0.056    0.056    0.062    0.003    40.46   497.33        .
  + Difference()           5.020      100    0.044    0.050    0.050    0.068    0.004    36.30   446.22        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.270      100    0.012    0.013    0.013    0.019    0.001     9.18   112.89        .
  total                   13.828      100    0.134    0.138    0.137    0.161    0.004   100.00  1229.16    0.127
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.167       10    0.015    0.017    0.016    0.019    0.001     3.70     6.19        .
  base                     2.696       10    0.262    0.270    0.268    0.278    0.005    59.77   100.00        .
  init                     0.570       10    0.055    0.057    0.056    0.060    0.002    12.64    21.14        .
  parse                    0.032       10    0.003    0.003    0.003    0.004    0.000     0.71     1.19        .
  check                    1.180       10    0.117    0.118    0.118    0.121    0.001    26.16    43.77        .
  - usefulness             0.459       10    0.044    0.046    0.046    0.048    0.001    10.18    17.03        .
    - is_useful() 1        0.445       10    0.042    0.045    0.045    0.046    0.001     9.86    16.51        .
  - combine                0.008       10    0.000    0.001    0.001    0.001    0.000     0.18     0.30        .
  - exhaustiveness         0.713       10    0.070    0.071    0.071    0.073    0.001    15.81    26.45        .
    - is_useful() 2        0.703       10    0.069    0.070    0.070    0.072    0.001    15.58    26.08        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  + Overlap()              0.575       10    0.054    0.058    0.058    0.061    0.003    12.75    21.33        .
  + Difference()           0.481       10    0.044    0.048    0.048    0.053    0.003    10.66    17.84        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.729       10    0.270    0.273    0.272    0.277    0.002    60.50   101.22        .
  total                    4.511       10    0.447    0.451    0.451    0.456    0.003   100.00   167.32    0.181
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.193        1    0.193    0.193    0.193    0.193        .    12.90    18.19        .
  base                     1.061        1    1.061    1.061    1.061    1.061        .    70.92   100.00        .
  init                     0.319        1    0.319    0.319    0.319    0.319        .    21.32    30.07        .
  parse                    0.004        1    0.004    0.004    0.004    0.004        .     0.27     0.38        .
  check                    0.120        1    0.120    0.120    0.120    0.120        .     8.02    11.31        .
  - usefulness             0.044        1    0.044    0.044    0.044    0.044        .     2.94     4.15        .
    - is_useful() 1        0.043        1    0.043    0.043    0.043    0.043        .     2.87     4.05        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.09        .
  - exhaustiveness         0.075        1    0.075    0.075    0.075    0.075        .     5.01     7.07        .
    - is_useful() 2        0.074        1    0.074    0.074    0.074    0.074        .     4.95     6.97        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.059        1    0.059    0.059    0.059    0.059        .     3.94     5.56        .
  + Difference()           0.047        1    0.047    0.047    0.047    0.047        .     3.14     4.43        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.053        1    1.053    1.053    1.053    1.053        .    70.39    99.25        .
  total                    1.496        1    1.496    1.496    1.496    1.496        .   100.00   141.00    0.435
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.021        1    3.021    3.021    3.021    3.021        .    22.05    28.89        .
  base                    10.457        1   10.457   10.457   10.457   10.457        .    76.31   100.00        .
  init                     3.160        1    3.160    3.160    3.160    3.160        .    23.06    30.22        .
  parse                    0.003        1    0.003    0.003    0.003    0.003        .     0.02     0.03        .
  check                    0.117        1    0.117    0.117    0.117    0.117        .     0.85     1.12        .
  - usefulness             0.045        1    0.045    0.045    0.045    0.045        .     0.33     0.43        .
    - is_useful() 1        0.043        1    0.043    0.043    0.043    0.043        .     0.31     0.41        .
  - combine                0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.01        .
  - exhaustiveness         0.070        1    0.070    0.070    0.070    0.070        .     0.51     0.67        .
    - is_useful() 2        0.070        1    0.070    0.070    0.070    0.070        .     0.51     0.67        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.052        1    0.052    0.052    0.052    0.052        .     0.38     0.50        .
  + Difference()           0.049        1    0.049    0.049    0.049    0.049        .     0.36     0.47        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.423        1   10.423   10.423   10.423   10.423        .    76.06    99.67        .
  total                   13.703        1   13.703   13.703   13.703   13.703        .   100.00   131.04    3.246
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string,  obs(1000)     levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.146      100    0.001    0.001    0.001    0.003    0.001     1.30   131.53        .
  base                     0.111      100    0.001    0.001    0.001    0.002    0.000     0.99   100.00        .
  init                     0.063      100    0.000    0.001    0.001    0.002    0.001     0.56    56.76        .
  parse                    0.224      100    0.002    0.002    0.002    0.005    0.000     1.99   201.80        .
  check                   10.822      100    0.106    0.108    0.108    0.116    0.002    96.19  9749.55        .
  - usefulness             3.071      100    0.030    0.031    0.031    0.037    0.001    27.30  2766.67        .
    - is_useful() 1        3.023      100    0.028    0.030    0.030    0.037    0.001    26.87  2723.42        .
  - combine                0.027      100    0.000    0.000    0.000    0.001    0.000     0.24    24.32        .
  - exhaustiveness         7.703      100    0.075    0.077    0.077    0.083    0.002    68.47  6939.64        .
    - is_useful() 2        7.650      100    0.074    0.076    0.076    0.082    0.002    67.99  6891.89        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.90        .
  - print                  0.006      100    0.000    0.000    0.000    0.001    0.000     0.05     5.41        .
  + Overlap()              5.401      100    0.046    0.054    0.054    0.062    0.003    48.00  4865.77        .
  + Difference()           4.889      100    0.044    0.049    0.049    0.055    0.002    43.45  4404.50        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.136      100    0.001    0.001    0.001    0.003    0.001     1.21   122.52        .
  total                   11.251      100    0.110    0.113    0.112    0.120    0.002   100.00 10136.04    0.111
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(100) rep(100)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.740      100    0.006    0.007    0.007    0.010    0.001     5.82    71.09        .
  base                     1.041      100    0.010    0.010    0.010    0.014    0.001     8.19   100.00        .
  init                     0.521      100    0.005    0.005    0.005    0.008    0.000     4.10    50.05        .
  parse                    0.212      100    0.002    0.002    0.002    0.003    0.000     1.67    20.37        .
  check                   10.915      100    0.106    0.109    0.108    0.125    0.003    85.89  1048.51        .
  - usefulness             3.102      100    0.030    0.031    0.031    0.036    0.001    24.41   297.98        .
    - is_useful() 1        3.048      100    0.028    0.030    0.030    0.036    0.001    23.98   292.80        .
  - combine                0.035      100    0.000    0.000    0.000    0.001    0.000     0.28     3.36        .
  - exhaustiveness         7.764      100    0.075    0.078    0.077    0.088    0.003    61.10   745.82        .
    - is_useful() 2        7.716      100    0.075    0.077    0.076    0.088    0.003    60.72   741.21        .
  - compress               0.001      100    0.000    0.000    0.000    0.001    0.000     0.01     0.10        .
  - print                  0.007      100    0.000    0.000    0.000    0.001    0.000     0.06     0.67        .
  + Overlap()              5.438      100    0.049    0.054    0.054    0.066    0.003    42.79   522.38        .
  + Difference()           4.966      100    0.045    0.050    0.049    0.058    0.002    39.08   477.04        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.057      100    0.010    0.011    0.010    0.014    0.001     8.32   101.54        .
  total                   12.708      100    0.124    0.127    0.126    0.146    0.004   100.00  1220.75    0.117
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(100) rep(10)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.663       10    0.065    0.066    0.066    0.070    0.001    24.52    65.26        .
  base                     1.016       10    0.100    0.102    0.101    0.105    0.002    37.57   100.00        .
  init                     0.597       10    0.058    0.060    0.059    0.062    0.001    22.08    58.76        .
  parse                    0.022       10    0.002    0.002    0.002    0.003    0.000     0.81     2.17        .
  check                    1.075       10    0.106    0.107    0.107    0.112    0.002    39.76   105.81        .
  - usefulness             0.307       10    0.030    0.031    0.030    0.032    0.001    11.35    30.22        .
    - is_useful() 1        0.301       10    0.029    0.030    0.030    0.032    0.001    11.13    29.63        .
  - combine                0.004       10    0.000    0.000    0.000    0.001    0.001     0.15     0.39        .
  - exhaustiveness         0.763       10    0.075    0.076    0.076    0.081    0.002    28.22    75.10        .
    - is_useful() 2        0.760       10    0.075    0.076    0.075    0.081    0.002    28.11    74.80        .
  - compress               0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - print                  0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.10        .
  + Overlap()              0.544       10    0.052    0.054    0.053    0.061    0.003    20.12    53.54        .
  + Difference()           0.486       10    0.047    0.049    0.049    0.050    0.001    17.97    47.83        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.010       10    0.098    0.101    0.100    0.107    0.003    37.35    99.41        .
  total                    2.704       10    0.266    0.270    0.269    0.278    0.003   100.00   266.14    0.169
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.727        1    0.727    0.727    0.727    0.727        .    44.99    70.04        .
  base                     1.038        1    1.038    1.038    1.038    1.038        .    64.23   100.00        .
  init                     0.481        1    0.481    0.481    0.481    0.481        .    29.76    46.34        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.12     0.19        .
  check                    0.110        1    0.110    0.110    0.110    0.110        .     6.81    10.60        .
  - usefulness             0.031        1    0.031    0.031    0.031    0.031        .     1.92     2.99        .
    - is_useful() 1        0.031        1    0.031    0.031    0.031    0.031        .     1.92     2.99        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.079        1    0.079    0.079    0.079    0.079        .     4.89     7.61        .
    - is_useful() 2        0.077        1    0.077    0.077    0.077    0.077        .     4.76     7.42        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.052        1    0.052    0.052    0.052    0.052        .     3.22     5.01        .
  + Difference()           0.049        1    0.049    0.049    0.049    0.049        .     3.03     4.72        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.023        1    1.023    1.023    1.023    1.023        .    63.30    98.55        .
  total                    1.616        1    1.616    1.616    1.616    1.616        .   100.00   155.68    0.578
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(100) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.439        1    8.439    8.439    8.439    8.439        .    56.40    83.09        .
  base                    10.157        1   10.157   10.157   10.157   10.157        .    67.88   100.00        .
  init                     4.840        1    4.840    4.840    4.840    4.840        .    32.35    47.65        .
  parse                    0.002        1    0.002    0.002    0.002    0.002        .     0.01     0.02        .
  check                    0.107        1    0.107    0.107    0.107    0.107        .     0.72     1.05        .
  - usefulness             0.031        1    0.031    0.031    0.031    0.031        .     0.21     0.31        .
    - is_useful() 1        0.031        1    0.031    0.031    0.031    0.031        .     0.21     0.31        .
  - combine                0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - exhaustiveness         0.076        1    0.076    0.076    0.076    0.076        .     0.51     0.75        .
    - is_useful() 2        0.075        1    0.075    0.075    0.075    0.075        .     0.50     0.74        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              0.054        1    0.054    0.054    0.054    0.054        .     0.36     0.53        .
  + Difference()           0.048        1    0.048    0.048    0.048    0.048        .     0.32     0.47        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.014        1   10.014   10.014   10.014   10.014        .    66.93    98.59        .
  total                   14.963        1   14.963   14.963   14.963   14.963        .   100.00   147.32    4.806
-------------------------------------------------------------------------------------------------------------------

. 
. // 1000 levels
. 
. profile_obs_integer, obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.01    18.18        .
  base                     0.011        1    0.011    0.011    0.011    0.011        .     0.04   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.00     9.09        .
  parse                    0.141        1    0.141    0.141    0.141    0.141        .     0.54  1281.82        .
  check                   26.181        1   26.181   26.181   26.181   26.181        .    99.42  2.4e+05        .
  - usefulness            18.562        1   18.562   18.562   18.562   18.562        .    70.48  1.7e+05        .
    - is_useful() 1       18.349        1   18.349   18.349   18.349   18.349        .    69.68  1.7e+05        .
  - combine                0.119        1    0.119    0.119    0.119    0.119        .     0.45  1081.82        .
  - exhaustiveness         7.497        1    7.497    7.497    7.497    7.497        .    28.47 68154.55        .
    - is_useful() 2        7.490        1    7.490    7.490    7.490    7.490        .    28.44 68090.91        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     9.09        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     9.09        .
  + Overlap()             12.484        1   12.484   12.484   12.484   12.484        .    47.40  1.1e+05        .
  + Difference()           5.215        1    5.215    5.215    5.215    5.215        .    19.80 47409.09        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.012        1    0.012    0.012    0.012    0.012        .     0.05   109.09        .
  total                   26.335        1   26.335   26.335   26.335   26.335        .   100.00  2.4e+05   26.324
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.002        1    0.002    0.002    0.002    0.002        .     0.01     2.08        .
  base                     0.096        1    0.096    0.096    0.096    0.096        .     0.36   100.00        .
  init                     0.002        1    0.002    0.002    0.002    0.002        .     0.01     2.08        .
  parse                    0.137        1    0.137    0.137    0.137    0.137        .     0.51   142.71        .
  check                   26.670        1   26.670   26.670   26.670   26.670        .    99.13 27781.25        .
  - usefulness            19.141        1   19.141   19.141   19.141   19.141        .    71.15 19938.54        .
    - is_useful() 1       18.937        1   18.937   18.937   18.937   18.937        .    70.39 19726.04        .
  - combine                0.117        1    0.117    0.117    0.117    0.117        .     0.43   121.88        .
  - exhaustiveness         7.408        1    7.408    7.408    7.408    7.408        .    27.54  7716.67        .
    - is_useful() 2        7.402        1    7.402    7.402    7.402    7.402        .    27.51  7710.42        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     1.04        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     1.04        .
  + Overlap()             12.701        1   12.701   12.701   12.701   12.701        .    47.21 13230.21        .
  + Difference()           5.175        1    5.175    5.175    5.175    5.175        .    19.24  5390.62        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.094        1    0.094    0.094    0.094    0.094        .     0.35    97.92        .
  total                   26.903        1   26.903   26.903   26.903   26.903        .   100.00 28023.96   26.807
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.012        1    0.012    0.012    0.012    0.012        .     0.04     1.35        .
  base                     0.892        1    0.892    0.892    0.892    0.892        .     3.27   100.00        .
  init                     0.013        1    0.013    0.013    0.013    0.013        .     0.05     1.46        .
  parse                    0.135        1    0.135    0.135    0.135    0.135        .     0.50    15.13        .
  check                   26.215        1   26.215   26.215   26.215   26.215        .    96.13  2938.90        .
  - usefulness            18.689        1   18.689   18.689   18.689   18.689        .    68.53  2095.18        .
    - is_useful() 1       18.478        1   18.478   18.478   18.478   18.478        .    67.76  2071.52        .
  - combine                0.116        1    0.116    0.116    0.116    0.116        .     0.43    13.00        .
  - exhaustiveness         7.407        1    7.407    7.407    7.407    7.407        .    27.16   830.38        .
    - is_useful() 2        7.401        1    7.401    7.401    7.401    7.401        .    27.14   829.71        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.11        .
  + Overlap()             12.358        1   12.358   12.358   12.358   12.358        .    45.32  1385.43        .
  + Difference()           5.148        1    5.148    5.148    5.148    5.148        .    18.88   577.13        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.907        1    0.907    0.907    0.907    0.907        .     3.33   101.68        .
  total                   27.271        1   27.271   27.271   27.271   27.271        .   100.00  3057.29   26.379
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.180        1    0.180    0.180    0.180    0.180        .     0.51     2.01        .
  base                     8.971        1    8.971    8.971    8.971    8.971        .    25.17   100.00        .
  init                     0.121        1    0.121    0.121    0.121    0.121        .     0.34     1.35        .
  parse                    0.138        1    0.138    0.138    0.138    0.138        .     0.39     1.54        .
  check                   26.424        1   26.424   26.424   26.424   26.424        .    74.15   294.55        .
  - usefulness            18.929        1   18.929   18.929   18.929   18.929        .    53.12   211.00        .
    - is_useful() 1       18.709        1   18.709   18.709   18.709   18.709        .    52.50   208.55        .
  - combine                0.119        1    0.119    0.119    0.119    0.119        .     0.33     1.33        .
  - exhaustiveness         7.374        1    7.374    7.374    7.374    7.374        .    20.69    82.20        .
    - is_useful() 2        7.367        1    7.367    7.367    7.367    7.367        .    20.67    82.12        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()             12.544        1   12.544   12.544   12.544   12.544        .    35.20   139.83        .
  + Difference()           5.134        1    5.134    5.134    5.134    5.134        .    14.41    57.23        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     8.952        1    8.952    8.952    8.952    8.952        .    25.12    99.79        .
  total                   35.635        1   35.635   35.635   35.635   35.635        .   100.00   397.22   26.664
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_integer, obs(10000000) levels(1000) rep(1)
. 
. profile_obs_float,   obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.00    10.00        .
  base                     0.010        1    0.010    0.010    0.010    0.010        .     0.04   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.00    10.00        .
  parse                    0.141        1    0.141    0.141    0.141    0.141        .     0.53  1410.00        .
  check                   26.653        1   26.653   26.653   26.653   26.653        .    99.42  2.7e+05        .
  - usefulness            19.100        1   19.100   19.100   19.100   19.100        .    71.25  1.9e+05        .
    - is_useful() 1       18.883        1   18.883   18.883   18.883   18.883        .    70.44  1.9e+05        .
  - combine                0.116        1    0.116    0.116    0.116    0.116        .     0.43  1160.00        .
  - exhaustiveness         7.432        1    7.432    7.432    7.432    7.432        .    27.72 74320.00        .
    - is_useful() 2        7.427        1    7.427    7.427    7.427    7.427        .    27.70 74270.00        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00    10.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00    10.00        .
  + Overlap()             12.706        1   12.706   12.706   12.706   12.706        .    47.40  1.3e+05        .
  + Difference()           5.216        1    5.216    5.216    5.216    5.216        .    19.46 52160.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.05   130.00        .
  total                   26.808        1   26.808   26.808   26.808   26.808        .   100.00  2.7e+05   26.798
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.003        1    0.003    0.003    0.003    0.003        .     0.01     3.00        .
  base                     0.100        1    0.100    0.100    0.100    0.100        .     0.37   100.00        .
  init                     0.003        1    0.003    0.003    0.003    0.003        .     0.01     3.00        .
  parse                    0.138        1    0.138    0.138    0.138    0.138        .     0.51   138.00        .
  check                   26.991        1   26.991   26.991   26.991   26.991        .    99.10 26991.00        .
  - usefulness            19.366        1   19.366   19.366   19.366   19.366        .    71.10 19366.00        .
    - is_useful() 1       19.141        1   19.141   19.141   19.141   19.141        .    70.28 19141.00        .
  - combine                0.118        1    0.118    0.118    0.118    0.118        .     0.43   118.00        .
  - exhaustiveness         7.503        1    7.503    7.503    7.503    7.503        .    27.55  7503.00        .
    - is_useful() 2        7.497        1    7.497    7.497    7.497    7.497        .    27.53  7497.00        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     1.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     1.00        .
  + Overlap()             12.888        1   12.888   12.888   12.888   12.888        .    47.32 12888.00        .
  + Difference()           5.197        1    5.197    5.197    5.197    5.197        .    19.08  5197.00        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.105        1    0.105    0.105    0.105    0.105        .     0.39   105.00        .
  total                   27.237        1   27.237   27.237   27.237   27.237        .   100.00 27237.00   27.137
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.015        1    0.015    0.015    0.015    0.015        .     0.05     1.42        .
  base                     1.055        1    1.055    1.055    1.055    1.055        .     3.80   100.00        .
  init                     0.057        1    0.057    0.057    0.057    0.057        .     0.21     5.40        .
  parse                    0.138        1    0.138    0.138    0.138    0.138        .     0.50    13.08        .
  check                   26.515        1   26.515   26.515   26.515   26.515        .    95.47  2513.27        .
  - usefulness            18.943        1   18.943   18.943   18.943   18.943        .    68.21  1795.55        .
    - is_useful() 1       18.733        1   18.733   18.733   18.733   18.733        .    67.45  1775.64        .
  - combine                0.116        1    0.116    0.116    0.116    0.116        .     0.42    11.00        .
  - exhaustiveness         7.454        1    7.454    7.454    7.454    7.454        .    26.84   706.54        .
    - is_useful() 2        7.447        1    7.447    7.447    7.447    7.447        .    26.81   705.88        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.09        .
  + Overlap()             12.563        1   12.563   12.563   12.563   12.563        .    45.23  1190.81        .
  + Difference()           5.212        1    5.212    5.212    5.212    5.212        .    18.77   494.03        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.061        1    1.061    1.061    1.061    1.061        .     3.82   100.57        .
  total                   27.773        1   27.773   27.773   27.773   27.773        .   100.00  2632.51   26.718
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.183        1    0.183    0.183    0.183    0.183        .     0.48     2.01        .
  base                     9.086        1    9.086    9.086    9.086    9.086        .    23.81   100.00        .
  init                     0.320        1    0.320    0.320    0.320    0.320        .     0.84     3.52        .
  parse                    0.136        1    0.136    0.136    0.136    0.136        .     0.36     1.50        .
  check                   27.585        1   27.585   27.585   27.585   27.585        .    72.30   303.60        .
  - usefulness            19.191        1   19.191   19.191   19.191   19.191        .    50.30   211.22        .
    - is_useful() 1       18.971        1   18.971   18.971   18.971   18.971        .    49.72   208.79        .
  - combine                0.123        1    0.123    0.123    0.123    0.123        .     0.32     1.35        .
  - exhaustiveness         8.267        1    8.267    8.267    8.267    8.267        .    21.67    90.99        .
    - is_useful() 2        8.261        1    8.261    8.261    8.261    8.261        .    21.65    90.92        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()             13.157        1   13.157   13.157   13.157   13.157        .    34.48   144.81        .
  + Difference()           5.499        1    5.499    5.499    5.499    5.499        .    14.41    60.52        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                    10.111        1   10.111   10.111   10.111   10.111        .    26.50   111.28        .
  total                   38.153        1   38.153   38.153   38.153   38.153        .   100.00   419.91   29.067
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_float,   obs(10000000) levels(1000) rep(1)
. 
. profile_obs_string,  obs(1000)     levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.001        1    0.001    0.001    0.001    0.001        .     0.01     9.09        .
  base                     0.011        1    0.011    0.011    0.011    0.011        .     0.07   100.00        .
  init                     0.001        1    0.001    0.001    0.001    0.001        .     0.01     9.09        .
  parse                    0.071        1    0.071    0.071    0.071    0.071        .     0.44   645.45        .
  check                   16.028        1   16.028   16.028   16.028   16.028        .    99.47  1.5e+05        .
  - usefulness             7.999        1    7.999    7.999    7.999    7.999        .    49.64 72718.18        .
    - is_useful() 1        7.902        1    7.902    7.902    7.902    7.902        .    49.04 71836.36        .
  - combine                0.048        1    0.048    0.048    0.048    0.048        .     0.30   436.36        .
  - exhaustiveness         7.979        1    7.979    7.979    7.979    7.979        .    49.52 72536.36        .
    - is_useful() 2        7.973        1    7.973    7.973    7.973    7.973        .    49.48 72481.82        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     9.09        .
  + Overlap()              7.889        1    7.889    7.889    7.889    7.889        .    48.96 71718.18        .
  + Difference()           5.117        1    5.117    5.117    5.117    5.117        .    31.76 46518.18        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.013        1    0.013    0.013    0.013    0.013        .     0.08   118.18        .
  total                   16.113        1   16.113   16.113   16.113   16.113        .   100.00  1.5e+05   16.102
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.008        1    0.008    0.008    0.008    0.008        .     0.05     7.92        .
  base                     0.101        1    0.101    0.101    0.101    0.101        .     0.63   100.00        .
  init                     0.006        1    0.006    0.006    0.006    0.006        .     0.04     5.94        .
  parse                    0.068        1    0.068    0.068    0.068    0.068        .     0.42    67.33        .
  check                   15.948        1   15.948   15.948   15.948   15.948        .    98.91 15790.10        .
  - usefulness             7.817        1    7.817    7.817    7.817    7.817        .    48.48  7739.60        .
    - is_useful() 1        7.728        1    7.728    7.728    7.728    7.728        .    47.93  7651.49        .
  - combine                0.047        1    0.047    0.047    0.047    0.047        .     0.29    46.53        .
  - exhaustiveness         8.081        1    8.081    8.081    8.081    8.081        .    50.12  8000.99        .
    - is_useful() 2        8.076        1    8.076    8.076    8.076    8.076        .    50.09  7996.04        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              7.863        1    7.863    7.863    7.863    7.863        .    48.77  7785.15        .
  + Difference()           5.121        1    5.121    5.121    5.121    5.121        .    31.76  5070.30        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.101        1    0.101    0.101    0.101    0.101        .     0.63   100.00        .
  total                   16.124        1   16.124   16.124   16.124   16.124        .   100.00 15964.36   16.023
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.071        1    0.071    0.071    0.071    0.071        .     0.42     7.05        .
  base                     1.007        1    1.007    1.007    1.007    1.007        .     5.89   100.00        .
  init                     0.067        1    0.067    0.067    0.067    0.067        .     0.39     6.65        .
  parse                    0.064        1    0.064    0.064    0.064    0.064        .     0.37     6.36        .
  check                   15.978        1   15.978   15.978   15.978   15.978        .    93.53  1586.69        .
  - usefulness             7.859        1    7.859    7.859    7.859    7.859        .    46.00   780.44        .
    - is_useful() 1        7.777        1    7.777    7.777    7.777    7.777        .    45.52   772.29        .
  - combine                0.048        1    0.048    0.048    0.048    0.048        .     0.28     4.77        .
  - exhaustiveness         8.068        1    8.068    8.068    8.068    8.068        .    47.23   801.19        .
    - is_useful() 2        8.062        1    8.062    8.062    8.062    8.062        .    47.19   800.60        .
  - compress               0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - print                  0.001        1    0.001    0.001    0.001    0.001        .     0.01     0.10        .
  + Overlap()              7.869        1    7.869    7.869    7.869    7.869        .    46.06   781.43        .
  + Difference()           5.152        1    5.152    5.152    5.152    5.152        .    30.16   511.62        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.973        1    0.973    0.973    0.973    0.973        .     5.70    96.62        .
  total                   17.083        1   17.083   17.083   17.083   17.083        .   100.00  1696.43   16.076
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(1000) rep(1)
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.746        1    0.746    0.746    0.746    0.746        .     2.85     7.61        .
  base                     9.807        1    9.807    9.807    9.807    9.807        .    37.49   100.00        .
  init                     0.519        1    0.519    0.519    0.519    0.519        .     1.98     5.29        .
  parse                    0.064        1    0.064    0.064    0.064    0.064        .     0.24     0.65        .
  check                   15.847        1   15.847   15.847   15.847   15.847        .    60.58   161.59        .
  - usefulness             7.789        1    7.789    7.789    7.789    7.789        .    29.78    79.42        .
    - is_useful() 1        7.697        1    7.697    7.697    7.697    7.697        .    29.43    78.48        .
  - combine                0.049        1    0.049    0.049    0.049    0.049        .     0.19     0.50        .
  - exhaustiveness         8.007        1    8.007    8.007    8.007    8.007        .    30.61    81.65        .
    - is_useful() 2        8.001        1    8.001    8.001    8.001    8.001        .    30.59    81.58        .
  - compress               0.001        1    0.001    0.001    0.001    0.001        .     0.00     0.01        .
  - print                  0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  + Overlap()              7.794        1    7.794    7.794    7.794    7.794        .    29.80    79.47        .
  + Difference()           5.101        1    5.101    5.101    5.101    5.101        .    19.50    52.01        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     9.727        1    9.727    9.727    9.727    9.727        .    37.19    99.18        .
  total                   26.157        1   26.157   26.157   26.157   26.157        .   100.00   266.72   16.350
-------------------------------------------------------------------------------------------------------------------

. // profile_obs_string,  obs(10000000) levels(1000) rep(1)
. 
. 
. ////////////////////////////////////////////////////// Benchmarks without checks
> 
. profile_obs_integer, obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.625     1000    0.000    0.001    0.001    0.001    0.000    59.47   209.73        .
  base                     0.298     1000    0.000    0.000    0.000    0.001    0.000    28.35   100.00        .
  init                     0.068     1000    0.000    0.000    0.000    0.001    0.000     6.47    22.82        .
  parse                    0.627     1000    0.000    0.001    0.001    0.002    0.000    59.66   210.40        .
  check                    0.003     1000    0.000    0.000    0.000    0.001    0.000     0.29     1.01        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.320     1000    0.000    0.000    0.000    0.001    0.000    30.45   107.38        .
  total                    1.051     1000    0.001    0.001    0.001    0.002    0.000   100.00   352.68    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.867     1000    0.001    0.002    0.002    0.005    0.000    57.55    74.74        .
  base                     2.498     1000    0.002    0.002    0.002    0.004    0.001    77.00   100.00        .
  init                     0.076     1000    0.000    0.000    0.000    0.001    0.000     2.34     3.04        .
  parse                    0.632     1000    0.000    0.001    0.001    0.002    0.000    19.48    25.30        .
  check                    0.006     1000    0.000    0.000    0.000    0.001    0.000     0.18     0.24        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.495     1000    0.002    0.002    0.002    0.004    0.001    76.91    99.88        .
  total                    3.244     1000    0.003    0.003    0.003    0.005    0.000   100.00   129.86    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.102      100    0.010    0.011    0.011    0.015    0.001    43.59    45.20        .
  base                     2.438      100    0.024    0.024    0.024    0.027    0.001    96.44   100.00        .
  init                     0.017      100    0.000    0.000    0.000    0.001    0.000     0.67     0.70        .
  parse                    0.057      100    0.000    0.001    0.001    0.001    0.000     2.25     2.34        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.449      100    0.023    0.024    0.024    0.030    0.001    96.87   100.45        .
  total                    2.528      100    0.024    0.025    0.025    0.031    0.001   100.00   103.69    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.810       10    0.166    0.181    0.181    0.193    0.010    73.82    74.09        .
  base                     2.443       10    0.242    0.244    0.244    0.250    0.003    99.63   100.00        .
  init                     0.002       10    0.000    0.000    0.000    0.001    0.000     0.08     0.08        .
  parse                    0.005       10    0.000    0.001    0.000    0.001    0.001     0.20     0.20        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.444       10    0.242    0.244    0.244    0.253    0.003    99.67   100.04        .
  total                    2.452       10    0.242    0.245    0.244    0.254    0.003   100.00   100.37    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.029        1    3.029    3.029    3.029    3.029        .   122.73   123.89        .
  base                     2.445        1    2.445    2.445    2.445    2.445        .    99.07   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.467        1    2.467    2.467    2.467    2.467        .    99.96   100.90        .
  total                    2.468        1    2.468    2.468    2.468    2.468        .   100.00   100.94    0.023
-------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float,   obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               0.776     1000    0.000    0.001    0.001    0.003    0.000    72.12   253.59        .
  base                     0.306     1000    0.000    0.000    0.000    0.003    0.000    28.44   100.00        .
  init                     0.069     1000    0.000    0.000    0.000    0.001    0.000     6.41    22.55        .
  parse                    0.611     1000    0.000    0.001    0.001    0.001    0.000    56.78   199.67        .
  check                    0.003     1000    0.000    0.000    0.000    0.001    0.000     0.28     0.98        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.364     1000    0.000    0.000    0.000    0.001    0.000    33.83   118.95        .
  total                    1.076     1000    0.001    0.001    0.001    0.002    0.000   100.00   351.63    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               2.252     1000    0.001    0.002    0.002    0.003    0.000    62.07    82.31        .
  base                     2.736     1000    0.002    0.003    0.003    0.006    0.001    75.41   100.00        .
  init                     0.070     1000    0.000    0.000    0.000    0.001    0.000     1.93     2.56        .
  parse                    0.658     1000    0.000    0.001    0.001    0.003    0.000    18.14    24.05        .
  check                    0.006     1000    0.000    0.000    0.000    0.001    0.000     0.17     0.22        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.865     1000    0.002    0.003    0.003    0.007    0.000    78.97   104.71        .
  total                    3.628     1000    0.003    0.004    0.004    0.008    0.001   100.00   132.60    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.605      100    0.014    0.016    0.016    0.020    0.001    26.95    27.64        .
  base                     5.806      100    0.056    0.058    0.058    0.066    0.001    97.48   100.00        .
  init                     0.004      100    0.000    0.000    0.000    0.001    0.000     0.07     0.07        .
  parse                    0.070      100    0.000    0.001    0.001    0.001    0.000     1.18     1.21        .
  check                    0.001      100    0.000    0.000    0.000    0.001    0.000     0.02     0.02        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     5.878      100    0.057    0.059    0.059    0.068    0.001    98.69   101.24        .
  total                    5.956      100    0.057    0.060    0.059    0.069    0.002   100.00   102.58    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.892       10    0.179    0.189    0.188    0.208    0.009    75.05    75.38        .
  base                     2.510       10    0.249    0.251    0.251    0.256    0.002    99.56   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.04     0.04        .
  parse                    0.007       10    0.000    0.001    0.001    0.001    0.000     0.28     0.28        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.513       10    0.248    0.251    0.250    0.257    0.003    99.68   100.12        .
  total                    2.521       10    0.249    0.252    0.251    0.258    0.003   100.00   100.44    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_float,   obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               3.001        1    3.001    3.001    3.001    3.001        .   119.04   122.84        .
  base                     2.443        1    2.443    2.443    2.443    2.443        .    96.91   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.04     0.04        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     2.520        1    2.520    2.520    2.520    2.520        .    99.96   103.15        .
  total                    2.521        1    2.521    2.521    2.521    2.521        .   100.00   103.19    0.078
-------------------------------------------------------------------------------------------------------------------

.  
. profile_obs_string,  obs(1000)     levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               1.311     1000    0.001    0.001    0.001    0.003    0.000   133.78   724.31        .
  base                     0.181     1000    0.000    0.000    0.000    0.001    0.000    18.47   100.00        .
  init                     0.067     1000    0.000    0.000    0.000    0.001    0.000     6.84    37.02        .
  parse                    0.682     1000    0.000    0.001    0.001    0.002    0.000    69.59   376.80        .
  check                    0.000     1000    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     0.204     1000    0.000    0.000    0.000    0.001    0.000    20.82   112.71        .
  total                    0.980     1000    0.000    0.001    0.001    0.002    0.000   100.00   541.44    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000)    levels(10) rep(1000) nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.025     1000    0.006    0.007    0.007    0.012    0.001   301.11   446.60        .
  base                     1.573     1000    0.001    0.002    0.002    0.004    0.001    67.42   100.00        .
  init                     0.073     1000    0.000    0.000    0.000    0.001    0.000     3.13     4.64        .
  parse                    0.657     1000    0.000    0.001    0.001    0.002    0.000    28.16    41.77        .
  check                    0.004     1000    0.000    0.000    0.000    0.001    0.000     0.17     0.25        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.569     1000    0.001    0.002    0.002    0.003    0.001    67.25    99.75        .
  total                    2.333     1000    0.002    0.002    0.002    0.005    0.001   100.00   148.32    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(100000)   levels(10) rep(100)  nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               6.358      100    0.062    0.064    0.063    0.069    0.001   402.41   417.47        .
  base                     1.523      100    0.014    0.015    0.015    0.017    0.001    96.39   100.00        .
  init                     0.009      100    0.000    0.000    0.000    0.001    0.000     0.57     0.59        .
  parse                    0.067      100    0.000    0.001    0.001    0.001    0.000     4.24     4.40        .
  check                    0.000      100    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.499      100    0.014    0.015    0.015    0.017    0.001    94.87    98.42        .
  total                    1.580      100    0.015    0.016    0.016    0.017    0.001   100.00   103.74    0.001
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(1000000)  levels(10) rep(10)   nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               7.044       10    0.687    0.704    0.704    0.716    0.008   466.49   467.73        .
  base                     1.506       10    0.149    0.151    0.150    0.155    0.002    99.74   100.00        .
  init                     0.001       10    0.000    0.000    0.000    0.001    0.000     0.07     0.07        .
  parse                    0.007       10    0.000    0.001    0.001    0.001    0.000     0.46     0.46        .
  check                    0.000       10    0.000    0.000    0.000    0.000    0.000     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.502       10    0.148    0.150    0.150    0.152    0.001    99.47    99.73        .
  total                    1.510       10    0.149    0.151    0.151    0.153    0.001   100.00   100.27    0.000
-------------------------------------------------------------------------------------------------------------------

. profile_obs_string,  obs(10000000) levels(10) rep(1)    nocheck
-------------------------------------------------------------------------------------------------------------------
profiler report
Name                       Total        N      min     mean   median      max       sd   %total    %base     diff
  build data               8.255        1    8.255    8.255    8.255    8.255        .   548.50   541.31        .
  base                     1.525        1    1.525    1.525    1.525    1.525        .   101.33   100.00        .
  init                     0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  parse                    0.001        1    0.001    0.001    0.001    0.001        .     0.07     0.07        .
  check                    0.000        1    0.000    0.000    0.000    0.000        .     0.00     0.00        .
  - usefulness                 .        .        .        .        .        .        .        .        .        .
    - is_useful() 1            .        .        .        .        .        .        .        .        .        .
  - combine                    .        .        .        .        .        .        .        .        .        .
  - exhaustiveness             .        .        .        .        .        .        .        .        .        .
    - is_useful() 2            .        .        .        .        .        .        .        .        .        .
  - compress                   .        .        .        .        .        .        .        .        .        .
  - print                      .        .        .        .        .        .        .        .        .        .
  + Overlap()                  .        .        .        .        .        .        .        .        .        .
  + Difference()               .        .        .        .        .        .        .        .        .        .
  + Compress()                 .        .        .        .        .        .        .        .        .        .
  eval                     1.504        1    1.504    1.504    1.504    1.504        .    99.93    98.62        .
  total                    1.505        1    1.505    1.505    1.505    1.505        .   100.00    98.69   -0.020
-------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\dev/logs/bench_e2e.log
  log type:  text
 closed on:   6 Oct 2024, 14:22:45
-----------------------------------------------------------------------------------------------------------------------------------------------------
