------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\benchmark/logs/bench_e2e.log
  log type:  text
 opened on:  14 Aug 2024, 23:49:03

. 
. dis "`c(current_date)'"
14 Aug 2024

. dis "`c(current_time)'"
23:49:03

. 
. profile_obs_integer, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.231     1000    0.000    0.000    0.000    0.001    0.000     3.54   100.00        .
        init          0.200     1000    0.000    0.000    0.000    0.001    0.000     3.07    86.58        .
       parse          0.645     1000    0.000    0.001    0.001    0.002    0.000     9.89   279.22        .
       check          4.880     1000    0.004    0.005    0.005    0.021    0.001    74.84  2112.55        .
        eval          0.640     1000    0.000    0.001    0.000    0.144    0.005     9.81   277.06        .
       total          6.521     1000    0.005    0.007    0.006    0.149    0.005   100.00  2822.94    0.006
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.649     1000    0.001    0.002    0.002    0.026    0.001    18.03   100.00        .
        init          1.370     1000    0.001    0.001    0.001    0.004    0.000    14.98    83.08        .
       parse          0.600     1000    0.000    0.001    0.001    0.002    0.000     6.56    36.39        .
       check          4.380     1000    0.004    0.004    0.004    0.027    0.001    47.89   265.62        .
        eval          2.665     1000    0.002    0.003    0.003    0.026    0.001    29.14   161.61        .
       total          9.146     1000    0.008    0.009    0.009    0.032    0.001   100.00   554.64    0.007
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.596      100    0.014    0.016    0.016    0.021    0.001    37.98   100.00        .
        init          1.425      100    0.013    0.014    0.014    0.020    0.001    33.91    89.29        .
       parse          0.053      100    0.000    0.001    0.001    0.001    0.001     1.26     3.32        .
       check          0.448      100    0.004    0.004    0.004    0.006    0.001    10.66    28.07        .
        eval          2.263      100    0.021    0.023    0.022    0.031    0.002    53.86   141.79        .
       total          4.202      100    0.039    0.042    0.041    0.054    0.002   100.00   263.28    0.026
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.418       10    0.136    0.142    0.141    0.149    0.004    42.87   100.00        .
        init          1.260       10    0.123    0.126    0.125    0.131    0.002    38.09    88.86        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.21     0.49        .
       check          0.044       10    0.004    0.004    0.004    0.005    0.001     1.33     3.10        .
        eval          1.997       10    0.193    0.200    0.200    0.210    0.005    60.37   140.83        .
       total          3.308       10    0.324    0.331    0.329    0.347    0.007   100.00   233.29    0.189
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.443       10    1.336    1.444    1.385    1.848    0.156    42.33   100.00        .
        init         13.352       10    1.168    1.335    1.224    1.953    0.251    39.13    92.45        .
       parse          0.008       10    0.000    0.001    0.001    0.001    0.000     0.02     0.06        .
       check          0.055       10    0.004    0.005    0.004    0.011    0.002     0.16     0.38        .
        eval         20.698       10    1.896    2.070    1.940    2.506    0.217    60.67   143.31        .
       total         34.118       10    3.078    3.412    3.166    4.472    0.464   100.00   236.23    1.968
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.229     1000    0.000    0.000    0.000    0.002    0.000     2.31   100.00        .
        init          0.086     1000    0.000    0.000    0.000    0.001    0.000     0.87    37.55        .
       parse          0.583     1000    0.000    0.001    0.001    0.002    0.000     5.88   254.59        .
       check          3.172     1000    0.002    0.003    0.003    0.019    0.001    31.98  1385.15        .
        eval          5.921     1000    0.000    0.006    0.001    4.931    0.156    59.70  2585.59        .
       total          9.918     1000    0.003    0.010    0.005    4.936    0.156   100.00  4331.00    0.010
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          8.266     1000    0.001    0.008    0.002    6.350    0.201    95.88   100.00        .
        init          0.392     1000    0.000    0.000    0.000    0.002    0.000     4.55     4.74        .
       parse          0.600     1000    0.000    0.001    0.001    0.003    0.001     6.96     7.26        .
       check          3.281     1000    0.002    0.003    0.003    0.143    0.005    38.06    39.69        .
        eval          4.189     1000    0.002    0.004    0.003    0.162    0.008    48.59    50.68        .
       total          8.621     1000    0.006    0.009    0.008    0.168    0.010   100.00   104.29    0.000
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.922      100    0.015    0.019    0.017    0.172    0.016    49.55   100.00        .
        init          0.351      100    0.003    0.004    0.003    0.006    0.001     9.05    18.26        .
       parse          0.065      100    0.000    0.001    0.001    0.002    0.001     1.68     3.38        .
       check          0.322      100    0.002    0.003    0.003    0.006    0.001     8.30    16.75        .
        eval          3.123      100    0.025    0.031    0.028    0.177    0.017    80.51   162.49        .
       total          3.879      100    0.032    0.039    0.036    0.185    0.017   100.00   201.82    0.020
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.608       10    0.138    0.161    0.144    0.282    0.044    58.64   100.00        .
        init          0.146       10    0.013    0.015    0.014    0.018    0.002     5.32     9.08        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.22     0.37        .
       check          0.037       10    0.003    0.004    0.003    0.007    0.001     1.35     2.30        .
        eval          2.552       10    0.245    0.255    0.255    0.263    0.005    93.07   158.71        .
       total          2.742       10    0.262    0.274    0.274    0.283    0.006   100.00   170.52    0.113
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         19.194       10    1.471    1.919    1.751    2.446    0.389    54.57   100.00        .
        init          1.695       10    0.131    0.170    0.160    0.212    0.032     4.82     8.83        .
       parse          0.008       10    0.000    0.001    0.001    0.002    0.001     0.02     0.04        .
       check          0.045       10    0.003    0.004    0.004    0.009    0.002     0.13     0.23        .
        eval         33.423       10    2.645    3.342    2.930    4.147    0.645    95.02   174.13        .
       total         35.173       10    2.784    3.517    3.096    4.323    0.675   100.00   183.25    1.598
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.433     1000    0.000    0.000    0.000    0.002    0.001     4.69   100.00        .
        init          1.174     1000    0.000    0.001    0.001    0.003    0.001    12.71   271.13        .
       parse          1.095     1000    0.000    0.001    0.001    0.003    0.001    11.85   252.89        .
       check          5.873     1000    0.003    0.006    0.006    0.013    0.002    63.58  1356.35        .
        eval          0.803     1000    0.000    0.001    0.001    0.011    0.001     8.69   185.45        .
       total          9.237     1000    0.004    0.009    0.010    0.020    0.003   100.00  2133.26    0.009
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.571     1000    0.001    0.003    0.002    0.008    0.001    14.90   100.00        .
        init          7.825     1000    0.004    0.008    0.007    0.023    0.003    45.34   304.36        .
       parse          0.775     1000    0.000    0.001    0.001    0.003    0.001     4.49    30.14        .
       check          3.772     1000    0.002    0.004    0.003    0.014    0.002    21.85   146.71        .
        eval          4.606     1000    0.002    0.005    0.004    0.062    0.003    26.69   179.15        .
       total         17.260     1000    0.010    0.017    0.014    0.077    0.007   100.00   671.33    0.015
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.510      100    0.017    0.025    0.022    0.054    0.007    12.45   100.00        .
        init         14.987      100    0.104    0.150    0.147    0.223    0.027    74.34   597.09        .
       parse          0.095      100    0.000    0.001    0.001    0.004    0.001     0.47     3.78        .
       check          0.451      100    0.003    0.005    0.004    0.009    0.002     2.24    17.97        .
        eval          4.596      100    0.033    0.046    0.041    0.078    0.014    22.80   183.11        .
       total         20.159      100    0.145    0.202    0.200    0.294    0.032   100.00   803.15    0.176
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.065       10    0.171    0.206    0.197    0.254    0.025     8.50   100.00        .
        init         20.043       10    1.873    2.004    1.952    2.199    0.096    82.50   970.61        .
       parse          0.011       10    0.001    0.001    0.001    0.002    0.000     0.05     0.53        .
       check          0.046       10    0.003    0.005    0.004    0.008    0.002     0.19     2.23        .
        eval          4.190       10    0.342    0.419    0.420    0.524    0.051    17.25   202.91        .
       total         24.295       10    2.271    2.429    2.379    2.733    0.143   100.00  1176.51    2.223
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         20.849       10    1.288    2.085    2.261    2.437    0.420     5.62   100.00        .
        init        334.786       10   19.424   33.479   36.076   39.862    6.230    90.24  1605.77        .
       parse          0.007       10    0.000    0.001    0.001    0.002    0.001     0.00     0.03        .
       check          0.033       10    0.002    0.003    0.003    0.005    0.001     0.01     0.16        .
        eval         36.176       10    2.370    3.618    4.030    4.245    0.789     9.75   173.51        .
       total        371.004       10   21.798   37.100   40.305   42.528    6.637   100.00  1779.48   35.016
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\benchmark/logs/bench_e2e.log
  log type:  text
 closed on:  15 Aug 2024, 00:01:15
------------------------------------------------------------------------------------------------------------------------------------------------------------
