------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\benchmark/logs/bench_e2e.log
  log type:  text
 opened on:  13 Aug 2024, 19:20:00

. 
. dis "`c(current_date)'"
13 Aug 2024

. dis "`c(current_time)'"
19:20:00

. 
. profile_obs_integer, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.216     1000    0.000    0.000    0.000    0.002    0.000     1.73   100.00        .
        init          0.236     1000    0.000    0.000    0.000    0.002    0.000     1.89   109.26        .
       parse          0.740     1000    0.000    0.001    0.001    0.003    0.001     5.94   342.59        .
       check         10.703     1000    0.009    0.011    0.010    0.026    0.002    85.86  4955.09        .
        eval          0.625     1000    0.000    0.001    0.001    0.041    0.002     5.01   289.35        .
       total         12.465     1000    0.010    0.012    0.012    0.056    0.003   100.00  5770.83    0.012
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.707     1000    0.001    0.002    0.002    0.047    0.002    11.03   100.00        .
        init          1.454     1000    0.001    0.001    0.001    0.029    0.001     9.40    85.18        .
       parse          0.752     1000    0.000    0.001    0.001    0.019    0.001     4.86    44.05        .
       check         10.151     1000    0.009    0.010    0.009    0.067    0.004    65.59   594.67        .
        eval          2.970     1000    0.002    0.003    0.003    0.060    0.002    19.19   173.99        .
       total         15.476     1000    0.013    0.015    0.014    0.128    0.007   100.00   906.62    0.014
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.535      100    0.014    0.015    0.015    0.019    0.001    33.54   100.00        .
        init          1.387      100    0.013    0.014    0.014    0.016    0.001    30.30    90.36        .
       parse          0.067      100    0.000    0.001    0.001    0.001    0.000     1.46     4.36        .
       check          0.933      100    0.009    0.009    0.009    0.012    0.001    20.38    60.78        .
        eval          2.174      100    0.021    0.022    0.022    0.025    0.001    47.50   141.63        .
       total          4.577      100    0.044    0.046    0.046    0.050    0.001   100.00   298.18    0.030
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.353       10    0.132    0.135    0.136    0.138    0.002    42.52   100.00        .
        init          1.193       10    0.117    0.119    0.119    0.124    0.002    37.49    88.17        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.19     0.44        .
       check          0.095       10    0.009    0.009    0.009    0.010    0.001     2.99     7.02        .
        eval          1.887       10    0.187    0.189    0.189    0.190    0.001    59.30   139.47        .
       total          3.182       10    0.316    0.318    0.317    0.325    0.003   100.00   235.18    0.183
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         13.431       10    1.329    1.343    1.341    1.370    0.014    43.52   100.00        .
        init         11.862       10    1.163    1.186    1.187    1.211    0.014    38.44    88.32        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.02     0.05        .
       check          0.093       10    0.009    0.009    0.009    0.010    0.000     0.30     0.69        .
        eval         18.897       10    1.883    1.890    1.886    1.907    0.009    61.24   140.70        .
       total         30.859       10    3.059    3.086    3.081    3.126    0.019   100.00   229.76    1.743
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.159     1000    0.000    0.000    0.000    0.001    0.000     2.66   100.00        .
        init          0.053     1000    0.000    0.000    0.000    0.001    0.000     0.89    33.33        .
       parse          0.589     1000    0.000    0.001    0.001    0.003    0.000     9.87   370.44        .
       check          4.779     1000    0.004    0.005    0.005    0.007    0.000    80.05  3005.66        .
        eval          0.428     1000    0.000    0.000    0.000    0.004    0.001     7.17   269.18        .
       total          5.970     1000    0.005    0.006    0.006    0.010    0.000   100.00  3754.72    0.006
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.551     1000    0.001    0.002    0.002    0.005    0.001    17.43   100.00        .
        init          0.224     1000    0.000    0.000    0.000    0.002    0.000     2.52    14.44        .
       parse          0.603     1000    0.000    0.001    0.001    0.002    0.000     6.78    38.88        .
       check          4.846     1000    0.004    0.005    0.005    0.009    0.000    54.45   312.44        .
        eval          3.076     1000    0.002    0.003    0.003    0.006    0.001    34.56   198.32        .
       total          8.900     1000    0.008    0.009    0.009    0.016    0.001   100.00   573.82    0.007
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.565      100    0.015    0.016    0.016    0.019    0.001    44.05   100.00        .
        init          0.334      100    0.003    0.003    0.003    0.006    0.001     9.40    21.34        .
       parse          0.063      100    0.000    0.001    0.001    0.001    0.000     1.77     4.03        .
       check          0.488      100    0.004    0.005    0.005    0.009    0.001    13.73    31.18        .
        eval          2.656      100    0.025    0.027    0.026    0.031    0.001    74.75   169.71        .
       total          3.553      100    0.034    0.036    0.035    0.041    0.001   100.00   227.03    0.020
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.356       10    0.134    0.136    0.135    0.138    0.001    52.76   100.00        .
        init          0.133       10    0.013    0.013    0.013    0.014    0.000     5.18     9.81        .
       parse          0.003       10    0.000    0.000    0.000    0.001    0.000     0.12     0.22        .
       check          0.048       10    0.004    0.005    0.005    0.005    0.000     1.87     3.54        .
        eval          2.384       10    0.236    0.238    0.238    0.244    0.002    92.76   175.81        .
       total          2.570       10    0.254    0.257    0.257    0.263    0.002   100.00   189.53    0.121
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         13.571       10    1.346    1.357    1.350    1.387    0.012    53.88   100.00        .
        init          1.301       10    0.129    0.130    0.130    0.132    0.001     5.16     9.59        .
       parse          0.008       10    0.000    0.001    0.001    0.001    0.000     0.03     0.06        .
       check          0.051       10    0.004    0.005    0.005    0.007    0.001     0.20     0.38        .
        eval         23.828       10    2.359    2.383    2.376    2.462    0.029    94.60   175.58        .
       total         25.189       10    2.495    2.519    2.513    2.599    0.029   100.00   185.61    1.162
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.153     1000    0.000    0.000    0.000    0.001    0.000     2.28   100.00        .
        init          0.409     1000    0.000    0.000    0.000    0.001    0.000     6.11   267.32        .
       parse          0.594     1000    0.000    0.001    0.001    0.002    0.000     8.87   388.24        .
       check          5.189     1000    0.005    0.005    0.005    0.009    0.000    77.48  3391.50        .
        eval          0.378     1000    0.000    0.000    0.000    0.002    0.000     5.64   247.06        .
       total          6.697     1000    0.006    0.007    0.007    0.013    0.001   100.00  4377.12    0.007
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.278     1000    0.001    0.001    0.001    0.006    0.000     9.88   100.00        .
        init          4.434     1000    0.004    0.004    0.004    0.008    0.001    34.27   346.95        .
       parse          0.575     1000    0.000    0.001    0.001    0.002    0.000     4.44    44.99        .
       check          5.297     1000    0.005    0.005    0.005    0.009    0.001    40.94   414.48        .
        eval          2.506     1000    0.002    0.003    0.003    0.004    0.001    19.37   196.09        .
       total         12.940     1000    0.012    0.013    0.013    0.017    0.001   100.00  1012.52    0.012
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.269      100    0.012    0.013    0.013    0.016    0.001    15.17   100.00        .
        init          5.357      100    0.052    0.054    0.053    0.057    0.001    64.05   422.14        .
       parse          0.058      100    0.000    0.001    0.001    0.001    0.000     0.69     4.57        .
       check          0.522      100    0.005    0.005    0.005    0.006    0.000     6.24    41.13        .
        eval          2.411      100    0.023    0.024    0.024    0.026    0.001    28.83   189.99        .
       total          8.364      100    0.082    0.084    0.084    0.087    0.001   100.00   659.10    0.071
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.256       10    0.124    0.126    0.125    0.132    0.002    10.31   100.00        .
        init          9.707       10    0.944    0.971    0.963    0.995    0.017    79.72   772.85        .
       parse          0.008       10    0.000    0.001    0.001    0.001    0.000     0.07     0.64        .
       check          0.052       10    0.005    0.005    0.005    0.006    0.000     0.43     4.14        .
        eval          2.408       10    0.239    0.241    0.240    0.245    0.002    19.77   191.72        .
       total         12.177       10    1.193    1.218    1.214    1.240    0.016   100.00   969.51    1.092
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         12.784       10    1.257    1.278    1.273    1.314    0.021     5.73   100.00        .
        init        198.940       10   19.103   19.894   19.596   20.913    0.648    89.16  1556.16        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.00     0.04        .
       check          0.054       10    0.005    0.005    0.005    0.006    0.001     0.02     0.42        .
        eval         24.136       10    2.369    2.414    2.393    2.500    0.043    10.82   188.80        .
       total        223.137       10   21.609   22.314   22.025   23.295    0.626   100.00  1745.44   21.035
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\benchmark/logs/bench_e2e.log
  log type:  text
 closed on:  13 Aug 2024, 19:28:07
------------------------------------------------------------------------------------------------------------------------------------------------------------
