------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\benchmark/logs/bench_e2e.log
  log type:  text
 opened on:  14 Aug 2024, 01:05:57

. 
. dis "`c(current_date)'"
14 Aug 2024

. dis "`c(current_time)'"
01:05:57

. 
. profile_obs_integer, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.196     1000    0.000    0.000    0.000    0.002    0.000     2.97   100.00        .
        init          0.190     1000    0.000    0.000    0.000    0.001    0.000     2.87    96.94        .
       parse          0.601     1000    0.000    0.001    0.001    0.012    0.001     9.09   306.63        .
       check          5.071     1000    0.004    0.005    0.005    0.013    0.001    76.72  2587.24        .
        eval          0.602     1000    0.000    0.001    0.001    0.022    0.001     9.11   307.14        .
       total          6.610     1000    0.005    0.007    0.006    0.029    0.001   100.00  3372.45    0.006
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.603     1000    0.001    0.002    0.002    0.004    0.001    15.33   100.00        .
        init          1.345     1000    0.001    0.001    0.001    0.003    0.000    12.87    83.91        .
       parse          0.627     1000    0.000    0.001    0.001    0.007    0.001     6.00    39.11        .
       check          5.022     1000    0.004    0.005    0.005    0.033    0.001    48.04   313.29        .
        eval          3.315     1000    0.002    0.003    0.003    0.346    0.012    31.71   206.80        .
       total         10.454     1000    0.008    0.010    0.010    0.354    0.012   100.00   652.15    0.009
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.316      100    0.020    0.023    0.022    0.034    0.003    43.05   100.00        .
        init          1.634      100    0.014    0.016    0.016    0.021    0.002    30.37    70.55        .
       parse          0.063      100    0.000    0.001    0.001    0.002    0.001     1.17     2.72        .
       check          0.636      100    0.004    0.006    0.005    0.130    0.013    11.82    27.46        .
        eval          3.034      100    0.026    0.030    0.029    0.057    0.004    56.39   131.00        .
       total          5.380      100    0.047    0.054    0.051    0.183    0.014   100.00   232.30    0.031
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.451       10    0.133    0.145    0.139    0.171    0.012    43.74   100.00        .
        init          1.276       10    0.118    0.128    0.128    0.143    0.008    38.47    87.94        .
       parse          0.012       10    0.000    0.001    0.001    0.003    0.001     0.36     0.83        .
       check          0.048       10    0.004    0.005    0.005    0.005    0.000     1.45     3.31        .
        eval          1.981       10    0.190    0.198    0.193    0.221    0.010    59.72   136.53        .
       total          3.317       10    0.315    0.332    0.326    0.356    0.013   100.00   228.60    0.187
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         20.404       10    1.396    2.040    2.131    2.374    0.333    42.50   100.00        .
        init         18.413       10    1.280    1.841    1.889    2.120    0.266    38.35    90.24        .
       parse          0.009       10    0.000    0.001    0.001    0.002    0.001     0.02     0.04        .
       check          0.078       10    0.005    0.008    0.006    0.013    0.003     0.16     0.38        .
        eval         29.504       10    1.964    2.950    3.114    3.363    0.490    61.46   144.60        .
       total         48.007       10    3.250    4.801    5.078    5.490    0.748   100.00   235.28    2.760
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.478     1000    0.000    0.000    0.000    0.003    0.001     4.52   100.00        .
        init          0.145     1000    0.000    0.000    0.000    0.002    0.000     1.37    30.33        .
       parse          1.345     1000    0.000    0.001    0.001    0.006    0.001    12.73   281.38        .
       check          7.496     1000    0.003    0.007    0.008    0.015    0.002    70.96  1568.20        .
        eval          1.296     1000    0.000    0.001    0.001    0.006    0.001    12.27   271.13        .
       total         10.564     1000    0.004    0.011    0.011    0.021    0.002   100.00  2210.04    0.010
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          4.471     1000    0.001    0.004    0.005    0.011    0.001    23.41   100.00        .
        init          0.702     1000    0.000    0.001    0.001    0.009    0.001     3.68    15.70        .
       parse          1.444     1000    0.000    0.001    0.001    0.007    0.001     7.56    32.30        .
       check          7.772     1000    0.003    0.008    0.008    0.015    0.001    40.70   173.83        .
        eval          8.823     1000    0.003    0.009    0.009    0.019    0.002    46.20   197.34        .
       total         19.097     1000    0.008    0.019    0.020    0.036    0.004   100.00   427.13    0.015
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          5.574      100    0.020    0.056    0.053    0.077    0.013    64.47   100.00        .
        init          0.754      100    0.004    0.008    0.006    0.014    0.003     8.72    13.53        .
       parse          0.097      100    0.000    0.001    0.001    0.006    0.001     1.12     1.74        .
       check          0.529      100    0.003    0.005    0.004    0.012    0.002     6.12     9.49        .
        eval          7.239      100    0.033    0.072    0.068    0.124    0.020    83.73   129.87        .
       total          8.646      100    0.042    0.086    0.084    0.146    0.022   100.00   155.11    0.031
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.199       10    0.169    0.220    0.219    0.277    0.037    53.18   100.00        .
        init          0.181       10    0.016    0.018    0.017    0.025    0.003     4.38     8.23        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.17     0.32        .
       check          0.037       10    0.003    0.004    0.004    0.004    0.000     0.89     1.68        .
        eval          3.908       10    0.314    0.391    0.365    0.519    0.067    94.51   177.72        .
       total          4.135       10    0.338    0.413    0.387    0.541    0.066   100.00   188.04    0.194
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         21.644       10    2.089    2.164    2.144    2.299    0.071    51.10   100.00        .
        init          2.129       10    0.175    0.213    0.212    0.249    0.022     5.03     9.84        .
       parse          0.008       10    0.000    0.001    0.001    0.002    0.001     0.02     0.04        .
       check          0.061       10    0.003    0.006    0.006    0.008    0.002     0.14     0.28        .
        eval         40.153       10    3.725    4.015    4.030    4.248    0.162    94.80   185.52        .
       total         42.354       10    3.929    4.235    4.235    4.477    0.172   100.00   195.68    2.071
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.422     1000    0.000    0.000    0.000    0.005    0.001     3.93   100.00        .
        init          1.082     1000    0.000    0.001    0.001    0.003    0.000    10.08   256.40        .
       parse          1.191     1000    0.000    0.001    0.001    0.006    0.001    11.10   282.23        .
       check          6.989     1000    0.003    0.007    0.007    0.014    0.002    65.12  1656.16        .
        eval          1.160     1000    0.000    0.001    0.001    0.008    0.001    10.81   274.88        .
       total         10.733     1000    0.005    0.011    0.011    0.019    0.002   100.00  2543.36    0.010
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          3.339     1000    0.001    0.003    0.003    0.008    0.001    12.92   100.00        .
        init         11.043     1000    0.005    0.011    0.012    0.019    0.002    42.74   330.73        .
       parse          1.231     1000    0.000    0.001    0.001    0.006    0.001     4.76    36.87        .
       check          6.866     1000    0.003    0.007    0.007    0.015    0.002    26.57   205.63        .
        eval          6.385     1000    0.003    0.006    0.007    0.016    0.002    24.71   191.22        .
       total         25.838     1000    0.012    0.026    0.028    0.042    0.006   100.00   773.82    0.022
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.275      100    0.015    0.023    0.018    0.040    0.008    16.93   100.00        .
        init          9.015      100    0.067    0.090    0.088    0.153    0.020    67.07   396.26        .
       parse          0.090      100    0.000    0.001    0.001    0.002    0.001     0.67     3.96        .
       check          0.471      100    0.003    0.005    0.004    0.009    0.002     3.50    20.70        .
        eval          3.831      100    0.029    0.038    0.033    0.077    0.011    28.50   168.40        .
       total         13.441      100    0.102    0.134    0.132    0.207    0.025   100.00   590.81    0.112
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          2.090       10    0.165    0.209    0.199    0.275    0.038     9.95   100.00        .
        init         16.913       10    1.551    1.691    1.703    1.819    0.102    80.53   809.23        .
       parse          0.008       10    0.000    0.001    0.001    0.001    0.000     0.04     0.38        .
       check          0.042       10    0.003    0.004    0.004    0.009    0.002     0.20     2.01        .
        eval          4.037       10    0.332    0.404    0.380    0.465    0.045    19.22   193.16        .
       total         21.002       10    1.945    2.100    2.069    2.287    0.122   100.00  1004.88    1.891
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         20.124       10    1.281    2.012    2.111    2.286    0.331     5.75   100.00        .
        init        318.125       10   22.035   31.813   33.033   35.707    5.215    90.83  1580.82        .
       parse          0.009       10    0.000    0.001    0.001    0.001    0.000     0.00     0.04        .
       check          0.044       10    0.003    0.004    0.003    0.009    0.002     0.01     0.22        .
        eval         32.081       10    2.390    3.208    2.624    4.244    0.782     9.16   159.42        .
       total        350.260       10   24.663   35.026   35.451   39.620    5.738   100.00  1740.51   33.014
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\benchmark/logs/bench_e2e.log
  log type:  text
 closed on:  14 Aug 2024, 01:18:38
------------------------------------------------------------------------------------------------------------------------------------------------------------
