------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\benchmark/logs/bench_e2e.log
  log type:  text
 opened on:  13 Aug 2024, 19:44:52

. 
. dis "`c(current_date)'"
13 Aug 2024

. dis "`c(current_time)'"
19:44:52

. 
. profile_obs_integer, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.187     1000    0.000    0.000    0.000    0.002    0.000     1.72   100.00        .
        init          0.159     1000    0.000    0.000    0.000    0.001    0.000     1.46    85.03        .
       parse          0.703     1000    0.000    0.001    0.001    0.002    0.000     6.47   375.94        .
       check          9.416     1000    0.009    0.009    0.009    0.036    0.001    86.72  5035.29        .
        eval          0.449     1000    0.000    0.000    0.000    0.012    0.001     4.14   240.11        .
       total         10.858     1000    0.010    0.011    0.011    0.038    0.001   100.00  5806.42    0.011
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.485     1000    0.001    0.001    0.001    0.005    0.001    10.62   100.00        .
        init          1.336     1000    0.001    0.001    0.001    0.003    0.000     9.55    89.97        .
       parse          0.682     1000    0.000    0.001    0.001    0.002    0.000     4.88    45.93        .
       check          9.243     1000    0.009    0.009    0.009    0.011    0.000    66.10   622.42        .
        eval          2.593     1000    0.002    0.003    0.003    0.006    0.001    18.54   174.61        .
       total         13.983     1000    0.013    0.014    0.014    0.018    0.001   100.00   941.62    0.012
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.532      100    0.015    0.015    0.015    0.019    0.001    33.54   100.00        .
        init          1.360      100    0.013    0.014    0.014    0.015    0.001    29.78    88.77        .
       parse          0.071      100    0.000    0.001    0.001    0.001    0.000     1.55     4.63        .
       check          0.937      100    0.009    0.009    0.009    0.014    0.001    20.52    61.16        .
        eval          2.182      100    0.021    0.022    0.022    0.026    0.001    47.78   142.43        .
       total          4.567      100    0.044    0.046    0.045    0.051    0.001   100.00   298.11    0.030
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.350       10    0.132    0.135    0.135    0.139    0.002    42.17   100.00        .
        init          1.189       10    0.117    0.119    0.119    0.123    0.002    37.14    88.07        .
       parse          0.009       10    0.000    0.001    0.001    0.001    0.000     0.28     0.67        .
       check          0.095       10    0.009    0.009    0.009    0.012    0.001     2.97     7.04        .
        eval          1.906       10    0.188    0.191    0.189    0.195    0.003    59.54   141.19        .
       total          3.201       10    0.315    0.320    0.319    0.327    0.004   100.00   237.11    0.185
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         13.617       10    1.328    1.362    1.346    1.481    0.045    43.96   100.00        .
        init         11.913       10    1.168    1.191    1.184    1.230    0.019    38.46    87.49        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.02     0.05        .
       check          0.092       10    0.009    0.009    0.009    0.010    0.000     0.30     0.68        .
        eval         18.963       10    1.883    1.896    1.895    1.922    0.012    61.21   139.26        .
       total         30.978       10    3.067    3.098    3.093    3.124    0.022   100.00   227.50    1.736
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.178     1000    0.000    0.000    0.000    0.001    0.000     2.97   100.00        .
        init          0.057     1000    0.000    0.000    0.000    0.001    0.000     0.95    32.02        .
       parse          0.582     1000    0.000    0.001    0.001    0.003    0.000     9.70   326.97        .
       check          4.799     1000    0.004    0.005    0.005    0.008    0.000    79.97  2696.07        .
        eval          0.441     1000    0.000    0.000    0.000    0.005    0.001     7.35   247.75        .
       total          6.001     1000    0.005    0.006    0.006    0.011    0.000   100.00  3371.35    0.006
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.567     1000    0.001    0.002    0.002    0.003    0.001    17.54   100.00        .
        init          0.264     1000    0.000    0.000    0.000    0.001    0.000     2.96    16.85        .
       parse          0.611     1000    0.000    0.001    0.001    0.003    0.001     6.84    38.99        .
       check          4.841     1000    0.004    0.005    0.005    0.007    0.000    54.20   308.93        .
        eval          3.096     1000    0.002    0.003    0.003    0.007    0.001    34.66   197.57        .
       total          8.932     1000    0.008    0.009    0.009    0.014    0.001   100.00   570.01    0.007
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.552      100    0.015    0.016    0.015    0.019    0.001    44.07   100.00        .
        init          0.321      100    0.003    0.003    0.003    0.004    0.000     9.11    20.68        .
       parse          0.071      100    0.000    0.001    0.001    0.003    0.001     2.02     4.57        .
       check          0.475      100    0.004    0.005    0.005    0.005    0.000    13.49    30.61        .
        eval          2.639      100    0.025    0.026    0.026    0.030    0.001    74.93   170.04        .
       total          3.522      100    0.034    0.035    0.035    0.039    0.001   100.00   226.93    0.020
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.369       10    0.134    0.137    0.136    0.143    0.003    53.00   100.00        .
        init          0.133       10    0.013    0.013    0.013    0.014    0.000     5.15     9.72        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.27     0.51        .
       check          0.049       10    0.004    0.005    0.005    0.005    0.000     1.90     3.58        .
        eval          2.392       10    0.237    0.239    0.238    0.244    0.002    92.61   174.73        .
       total          2.583       10    0.256    0.258    0.257    0.263    0.002   100.00   188.68    0.121
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         13.641       10    1.343    1.364    1.360    1.409    0.020    53.86   100.00        .
        init          1.340       10    0.130    0.134    0.133    0.149    0.005     5.29     9.82        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.03     0.05        .
       check          0.047       10    0.004    0.005    0.005    0.006    0.001     0.19     0.34        .
        eval         23.928       10    2.370    2.393    2.395    2.418    0.014    94.48   175.41        .
       total         25.325       10    2.508    2.532    2.535    2.556    0.016   100.00   185.65    1.168
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.170     1000    0.000    0.000    0.000    0.002    0.000     2.54   100.00        .
        init          0.471     1000    0.000    0.000    0.000    0.002    0.001     7.02   277.06        .
       parse          0.554     1000    0.000    0.001    0.001    0.003    0.001     8.26   325.88        .
       check          5.155     1000    0.005    0.005    0.005    0.007    0.000    76.88  3032.35        .
        eval          0.394     1000    0.000    0.000    0.000    0.004    0.001     5.88   231.76        .
       total          6.705     1000    0.006    0.007    0.007    0.011    0.001   100.00  3944.12    0.007
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.288     1000    0.001    0.001    0.001    0.004    0.000     9.86   100.00        .
        init          4.525     1000    0.004    0.005    0.004    0.007    0.001    34.65   351.32        .
       parse          0.574     1000    0.000    0.001    0.001    0.002    0.000     4.40    44.57        .
       check          5.248     1000    0.005    0.005    0.005    0.010    0.001    40.19   407.45        .
        eval          2.571     1000    0.002    0.003    0.003    0.006    0.001    19.69   199.61        .
       total         13.059     1000    0.012    0.013    0.013    0.022    0.001   100.00  1013.90    0.012
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.268      100    0.012    0.013    0.013    0.016    0.001    14.86   100.00        .
        init          5.519      100    0.053    0.055    0.055    0.066    0.002    64.66   435.25        .
       parse          0.055      100    0.000    0.001    0.001    0.001    0.000     0.64     4.34        .
       check          0.530      100    0.005    0.005    0.005    0.010    0.001     6.21    41.80        .
        eval          2.415      100    0.023    0.024    0.024    0.028    0.001    28.30   190.46        .
       total          8.535      100    0.083    0.085    0.085    0.096    0.002   100.00   673.11    0.073
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.264       10    0.124    0.126    0.125    0.132    0.003    10.32   100.00        .
        init          9.797       10    0.955    0.980    0.973    1.013    0.019    80.00   775.08        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.06     0.55        .
       check          0.052       10    0.005    0.005    0.005    0.006    0.000     0.42     4.11        .
        eval          2.386       10    0.235    0.239    0.239    0.241    0.002    19.48   188.77        .
       total         12.246       10    1.202    1.225    1.219    1.255    0.018   100.00   968.83    1.098
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         12.657       10    1.241    1.266    1.259    1.288    0.016     5.77   100.00        .
        init        195.512       10   16.379   19.551   19.613   21.504    1.300    89.06  1544.69        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.00     0.06        .
       check          0.054       10    0.005    0.005    0.005    0.007    0.001     0.02     0.43        .
        eval         23.951       10    2.373    2.395    2.395    2.422    0.016    10.91   189.23        .
       total        219.529       10   18.770   21.953   22.014   23.883    1.300   100.00  1734.45   20.687
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\benchmark/logs/bench_e2e.log
  log type:  text
 closed on:  13 Aug 2024, 19:52:53
------------------------------------------------------------------------------------------------------------------------------------------------------------
