------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\benchmark/logs/bench_e2e.log
  log type:  text
 opened on:  13 Aug 2024, 17:51:52

. 
. dis "`c(current_date)'"
13 Aug 2024

. dis "`c(current_time)'"
17:51:52

. 
. profile_obs_integer, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.179     1000    0.000    0.000    0.000    0.001    0.000     1.56   100.00        .
        init          0.184     1000    0.000    0.000    0.000    0.001    0.000     1.60   102.79        .
       parse          0.687     1000    0.000    0.001    0.001    0.003    0.001     5.98   383.80        .
       check          9.957     1000    0.009    0.010    0.009    0.058    0.003    86.71  5562.57        .
        eval          0.504     1000    0.000    0.001    0.000    0.020    0.001     4.39   281.56        .
       total         11.483     1000    0.010    0.011    0.011    0.061    0.003   100.00  6415.08    0.011
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.376     1000    0.001    0.001    0.001    0.004    0.001    10.05   100.00        .
        init          1.277     1000    0.001    0.001    0.001    0.004    0.000     9.33    92.81        .
       parse          0.675     1000    0.000    0.001    0.001    0.003    0.000     4.93    49.06        .
       check          9.448     1000    0.009    0.009    0.009    0.018    0.001    69.04   686.63        .
        eval          2.156     1000    0.001    0.002    0.002    0.005    0.000    15.75   156.69        .
       total         13.685     1000    0.013    0.014    0.014    0.023    0.001   100.00   994.55    0.012
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.423      100    0.013    0.014    0.014    0.019    0.001    32.63   100.00        .
        init          1.280      100    0.011    0.013    0.012    0.023    0.002    29.35    89.95        .
       parse          0.066      100    0.000    0.001    0.001    0.002    0.001     1.51     4.64        .
       check          0.965      100    0.009    0.010    0.009    0.014    0.001    22.13    67.81        .
        eval          2.030      100    0.019    0.020    0.020    0.035    0.002    46.55   142.66        .
       total          4.361      100    0.041    0.044    0.042    0.058    0.003   100.00   306.47    0.029
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.463       10    0.139    0.146    0.144    0.164    0.008    43.62   100.00        .
        init          1.232       10    0.119    0.123    0.121    0.131    0.004    36.73    84.21        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.21     0.48        .
       check          0.099       10    0.009    0.010    0.009    0.012    0.001     2.95     6.77        .
        eval          2.014       10    0.192    0.201    0.202    0.211    0.006    60.05   137.66        .
       total          3.354       10    0.321    0.335    0.334    0.349    0.009   100.00   229.25    0.189
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_integer, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.044       10    1.377    1.404    1.394    1.435    0.021    43.66   100.00        .
        init         12.267       10    1.209    1.227    1.222    1.265    0.016    38.13    87.35        .
       parse          0.005       10    0.000    0.001    0.000    0.001    0.001     0.02     0.04        .
       check          0.101       10    0.009    0.010    0.010    0.013    0.001     0.31     0.72        .
        eval         19.792       10    1.946    1.979    1.967    2.054    0.031    61.53   140.93        .
       total         32.168       10    3.175    3.217    3.206    3.292    0.038   100.00   229.05    1.812
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_float, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.171     1000    0.000    0.000    0.000    0.001    0.000     2.69   100.00        .
        init          0.058     1000    0.000    0.000    0.000    0.001    0.000     0.91    33.92        .
       parse          0.624     1000    0.000    0.001    0.001    0.002    0.000     9.82   364.91        .
       check          5.117     1000    0.004    0.005    0.005    0.010    0.001    80.56  2992.40        .
        eval          0.435     1000    0.000    0.000    0.000    0.006    0.001     6.85   254.39        .
       total          6.352     1000    0.005    0.006    0.006    0.013    0.001   100.00  3714.62    0.006
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.688     1000    0.001    0.002    0.002    0.011    0.001    17.97   100.00        .
        init          0.309     1000    0.000    0.000    0.000    0.002    0.000     3.29    18.31        .
       parse          0.587     1000    0.000    0.001    0.001    0.003    0.001     6.25    34.77        .
       check          5.127     1000    0.004    0.005    0.005    0.012    0.001    54.58   303.73        .
        eval          3.231     1000    0.002    0.003    0.003    0.009    0.001    34.40   191.41        .
       total          9.393     1000    0.008    0.009    0.009    0.019    0.001   100.00   556.46    0.008
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.678      100    0.015    0.017    0.016    0.030    0.002    44.60   100.00        .
        init          0.343      100    0.003    0.003    0.003    0.005    0.001     9.12    20.44        .
       parse          0.073      100    0.000    0.001    0.001    0.001    0.000     1.94     4.35        .
       check          0.524      100    0.004    0.005    0.005    0.008    0.001    13.93    31.23        .
        eval          2.805      100    0.026    0.028    0.027    0.038    0.002    74.56   167.16        .
       total          3.762      100    0.035    0.038    0.037    0.047    0.002   100.00   224.20    0.021
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.474       10    0.139    0.147    0.144    0.160    0.007    54.80   100.00        .
        init          0.142       10    0.013    0.014    0.014    0.017    0.001     5.28     9.63        .
       parse          0.006       10    0.000    0.001    0.001    0.001    0.001     0.22     0.41        .
       check          0.049       10    0.004    0.005    0.005    0.006    0.001     1.82     3.32        .
        eval          2.490       10    0.242    0.249    0.248    0.257    0.005    92.57   168.93        .
       total          2.690       10    0.262    0.269    0.268    0.278    0.005   100.00   182.50    0.122
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_float, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         14.368       10    1.387    1.437    1.438    1.473    0.024    54.53   100.00        .
        init          1.379       10    0.132    0.138    0.138    0.149    0.005     5.23     9.60        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.03     0.05        .
       check          0.050       10    0.004    0.005    0.005    0.006    0.000     0.19     0.35        .
        eval         24.908       10    2.460    2.491    2.479    2.538    0.024    94.54   173.36        .
       total         26.347       10    2.599    2.635    2.631    2.683    0.025   100.00   183.37    1.198
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. profile_obs_string, obs(1000)     rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          0.180     1000    0.000    0.000    0.000    0.001    0.000     2.55   100.00        .
        init          0.452     1000    0.000    0.000    0.000    0.002    0.001     6.39   251.11        .
       parse          0.590     1000    0.000    0.001    0.001    0.005    0.001     8.35   327.78        .
       check          5.480     1000    0.005    0.005    0.005    0.026    0.001    77.52  3044.44        .
        eval          0.400     1000    0.000    0.000    0.000    0.004    0.001     5.66   222.22        .
       total          7.069     1000    0.006    0.007    0.007    0.032    0.001   100.00  3927.22    0.007
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000)    rep(1000)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.344     1000    0.001    0.001    0.001    0.003    0.000    10.11   100.00        .
        init          4.631     1000    0.004    0.005    0.005    0.010    0.001    34.83   344.57        .
       parse          0.569     1000    0.000    0.001    0.001    0.002    0.001     4.28    42.34        .
       check          5.395     1000    0.005    0.005    0.005    0.011    0.001    40.58   401.41        .
        eval          2.596     1000    0.002    0.003    0.003    0.006    0.001    19.53   193.15        .
       total         13.295     1000    0.012    0.013    0.013    0.025    0.001   100.00   989.21    0.012
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(100000)   rep(100)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.309      100    0.012    0.013    0.013    0.019    0.001    14.84   100.00        .
        init          5.661      100    0.054    0.057    0.056    0.065    0.003    64.17   432.47        .
       parse          0.063      100    0.000    0.001    0.001    0.002    0.001     0.71     4.81        .
       check          0.544      100    0.005    0.005    0.005    0.007    0.001     6.17    41.56        .
        eval          2.539      100    0.023    0.025    0.025    0.031    0.002    28.78   193.96        .
       total          8.822      100    0.084    0.088    0.088    0.098    0.003   100.00   673.95    0.075
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(1000000)  rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base          1.303       10    0.127    0.130    0.130    0.139    0.004    10.38   100.00        .
        init         10.020       10    0.960    1.002    0.987    1.062    0.030    79.80   768.99        .
       parse          0.007       10    0.000    0.001    0.001    0.001    0.000     0.06     0.54        .
       check          0.056       10    0.005    0.006    0.005    0.007    0.001     0.45     4.30        .
        eval          2.469       10    0.242    0.247    0.246    0.254    0.004    19.66   189.49        .
       total         12.556       10    1.217    1.256    1.236    1.320    0.031   100.00   963.62    1.125
------------------------------------------------------------------------------------------------------------------------------------------------------------

. profile_obs_string, obs(10000000) rep(10)
------------------------------------------------------------------------------------------------------------------------------------------------------------
profiler report
        Name          Total        N      min     mean   median      max       sd   %total    %base     diff
        base         13.128       10    1.282    1.313    1.309    1.378    0.029     5.55   100.00        .
        init        212.088       10   17.480   21.209   21.549   23.734    2.120    89.62  1615.54        .
       parse          0.003       10    0.000    0.000    0.000    0.001    0.000     0.00     0.02        .
       check          0.053       10    0.005    0.005    0.005    0.006    0.000     0.02     0.40        .
        eval         24.511       10    2.419    2.451    2.441    2.511    0.026    10.36   186.71        .
       total        236.661       10   19.929   23.666   23.995   26.252    2.131   100.00  1802.72   22.353
------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\malsouder\Documents\Projets\stata_match\benchmark/logs/bench_e2e.log
  log type:  text
 closed on:  13 Aug 2024, 18:00:20
------------------------------------------------------------------------------------------------------------------------------------------------------------
